{
  "book": "1Peter",
  "chapters": [
   {
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, this letter’s from Peter — an apostle of Jesus Christ. I’m talkin’ to the believers scattered all over Pontus, Galatia, Cappadocia, Asia, and Bithynia — the real diaspora squad."
    },
    {
      "verse": "2",
      "text": "Y’all were chosen by God the Father, set apart by the Spirit, and sprinkled clean through the blood of Jesus. Grace and peace stay multiplied on you heavy."
    },
    {
      "verse": "3",
      "text": "Big praise to God, the Father of our Lord Jesus Christ — through His mercy, we got a fresh start, a new life, and a living hope ‘cause Jesus rose up from the dead."
    },
    {
      "verse": "4",
      "text": "And now, we’ve got an inheritance — one that never dies, never glitches, never fades. Locked safe in heaven for you."
    },
    {
      "verse": "5",
      "text": "You’re being guarded by God’s power through faith, waiting for the full salvation drop coming soon in the last days."
    },
    {
      "verse": "6",
      "text": "So yeah, even if you’re struggling for a bit now, hold tight — you still got reasons to be hyped."
    },
    {
      "verse": "7",
      "text": "‘Cause your faith’s being tested like gold in fire — so when Jesus shows up, your faith’ll shine way brighter than gold."
    },
    {
      "verse": "8",
      "text": "You’ve never seen Him, but you love Him anyway. You don’t see Him now, but you trust Him — and that trust got you vibing with joy that words can’t even capture."
    },
    {
      "verse": "9",
      "text": "You’re receiving the end result of all that faith — your souls getting saved."
    },
    {
      "verse": "10",
      "text": "The prophets back then? They were grinding hard trying to figure out the same grace that’s now your reality."
    },
    {
      "verse": "11",
      "text": "They were decoding what the Spirit of Christ in them was hinting at — how He’d suffer first, then flex in glory later."
    },
    {
      "verse": "12",
      "text": "And it got revealed to them that they were serving y’all, not themselves. The stuff they spoke? Now preached to you by the Holy Spirit sent from heaven. Even angels wanna peek into this mystery."
    },
    {
      "verse": "13",
      "text": "So lock in your minds, stay alert, and set your full hope on the grace that’s coming when Jesus pulls up."
    },
    {
      "verse": "14",
      "text": "Be obedient kids. Don’t go back to your old clueless ways from before you knew better."
    },
    {
      "verse": "15",
      "text": "Be holy in everything you do — just like the God who called you is holy."
    },
    {
      "verse": "16",
      "text": "Remember the script: “Be holy, ‘cause I’m holy.”"
    },
    {
      "verse": "17",
      "text": "And since you call God “Father,” respect Him for real — live with reverent fear while you’re just passing through this world."
    },
    {
      "verse": "18",
      "text": "‘Cause you know you weren’t saved with silver or gold — that temporary stuff."
    },
    {
      "verse": "19",
      "text": "You were bought with the priceless blood of Christ — the spotless Lamb with zero flaws."
    },
    {
      "verse": "20",
      "text": "He was chosen before the world even started, but got revealed in these last times for your sake."
    },
    {
      "verse": "21",
      "text": "Through Him you believe in God, who raised Him from the dead and gave Him glory — so your faith and hope stay anchored in God."
    },
    {
      "verse": "22",
      "text": "Since you purified your souls by obeying the truth, love each other deeply — not the fake type, but the real one."
    },
    {
      "verse": "23",
      "text": "You’ve been born again, not from something that dies, but from the living and permanent Word of God."
    },
    {
      "verse": "24",
      "text": "Like it says, “People are like grass — and all their glory like flowers. Grass dries up, flowers fall off.”"
    },
    {
      "verse": "25",
      "text": "But the Word of the Lord? That stays forever. And that Word — that’s the good news that got preached to you."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Aight, first things first — ditch the fake stuff. No more malice, cap, envy, or trash talk."
    },
    {
      "verse": "2",
      "text": "Like newborns craving milk, thirst hard for the pure Word — that’s how you grow in salvation mode."
    },
    {
      "verse": "3",
      "text": "Since you’ve already tasted how good the Lord is, stay feeding on that."
    },
    {
      "verse": "4",
      "text": "Come to Him — the real Living Stone. Rejected by people, but chosen and priceless to God."
    },
    {
      "verse": "5",
      "text": "You’re living stones too — being built into a spiritual house, a holy priesthood, dropping spiritual sacrifices that God actually vibes with through Jesus Christ."
    },
    {
      "verse": "6",
      "text": "Scripture said it first: “Look, I’m laying a cornerstone in Zion — chosen, precious. Whoever trusts in Him won’t flop.”"
    },
    {
      "verse": "7",
      "text": "For y’all believers, He’s the prize. But for the unbelievers? “The stone the builders tossed aside became the main piece.”"
    },
    {
      "verse": "8",
      "text": "And also, “a stone that makes people trip — a rock that makes ‘em fall.” They stumble ‘cause they disobey the Word — exactly what they were warned about."
    },
    {
      "verse": "9",
      "text": "But y’all? You’re different. Chosen squad, royal priesthood, holy nation, God’s own people — meant to show off His greatness. He called you outta darkness into His wild light."
    },
    {
      "verse": "10",
      "text": "Once, y’all weren’t even a people — now you’re God’s people. Once mercy was MIA — now mercy lives with you."
    },
    {
      "verse": "11",
      "text": "Dear fam, as strangers and outsiders here, I’m begging you — don’t let the world’s cravings run you. They’re fighting your soul daily."
    },
    {
      "verse": "12",
      "text": "Live clean among unbelievers. Even if they slander you now, they’ll have to admit God’s glory when He shows up."
    },
    {
      "verse": "13",
      "text": "Respect authority — every human system. King? Respect him. Governors? Same energy."
    },
    {
      "verse": "14",
      "text": "They’re sent to punish wrong and hype up good behavior."
    },
    {
      "verse": "15",
      "text": "It’s God’s will that doing good shuts down the ignorant talk of clowns."
    },
    {
      "verse": "16",
      "text": "Move like free people, but don’t use freedom as an excuse for sin. Live as God’s servants."
    },
    {
      "verse": "17",
      "text": "Show respect to everyone. Love the believers. Fear God. Honor the king."
    },
    {
      "verse": "18",
      "text": "Workers, respect your bosses — even the harsh ones."
    },
    {
      "verse": "19",
      "text": "It’s grace when you suffer unjustly yet stay patient ‘cause you’re aware of God."
    },
    {
      "verse": "20",
      "text": "But yo, if you mess up and get punished — that’s on you. If you suffer doing good though, and take it calmly — that’s the real W."
    },
    {
      "verse": "21",
      "text": "You were called for that — Christ suffered too, leaving the perfect blueprint."
    },
    {
      "verse": "22",
      "text": "He never sinned. Never lied."
    },
    {
      "verse": "23",
      "text": "When people roasted Him, He didn’t clap back. When He suffered, He didn’t threaten. He just left it to God, the real Judge."
    },
    {
      "verse": "24",
      "text": "He carried our sins in His own body on the cross — so we’d die to sin and live for righteousness. By His wounds, you got healed."
    },
    {
      "verse": "25",
      "text": "You were lost sheep once — wandering off — but now you’re back with the Shepherd and Guardian of your souls."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Wives, chill and respect your men — even if they don’t vibe with the Word yet, your pure and humble energy might win ’em over without you even talkin’."
    },
    {
      "verse": "2",
      "text": "When they peep how you move — pure, loyal, and unbothered — that hits harder than a sermon."
    },
    {
      "verse": "3",
      "text": "Don’t let your whole personality depend on outfits, hairstyles, or jewelry flexes."
    },
    {
      "verse": "4",
      "text": "The real glow-up is a quiet and peaceful spirit — the type that heaven finds precious fr."
    },
    {
      "verse": "5",
      "text": "The OG godly women used to rock that same energy — trusting God, staying calm, and respecting their men."
    },
    {
      "verse": "6",
      "text": "Sarah did it with Abraham and called him “lord.” If you keep your cool and don’t freak out over stuff, you’re built like her."
    },
    {
      "verse": "7",
      "text": "Husbands, treat your girls right. She’s not your competition — she’s your teammate. Respect her as an equal so your prayers don’t bounce."
    },
    {
      "verse": "8",
      "text": "All of y’all, stay synced: love deep, chill on pride, and move with compassion."
    },
    {
      "verse": "9",
      "text": "Don’t clap back when people act dumb. Bless ’em instead — that’s how you catch God’s favor."
    },
    {
      "verse": "10",
      "text": "If you wanna actually enjoy life, shut down toxic talk and keep your lips from wild stuff."
    },
    {
      "verse": "11",
      "text": "Dip outta evil, run toward good. Seek peace, chase it down like it owes you money."
    },
    {
      "verse": "12",
      "text": "God’s eyes are locked on the righteous, His ears stay open — but He turns His face from those wildin’."
    },
    {
      "verse": "13",
      "text": "If you’re out here doing good, who’s really gonna try you?"
    },
    {
      "verse": "14",
      "text": "But even if they do hate on you for doing right, you’re still blessed. Don’t trip, don’t let fear rent space in your head."
    },
    {
      "verse": "15",
      "text": "Set Jesus as King in your heart. Be ready to explain your hope anytime, but do it calmly and respectfully."
    },
    {
      "verse": "16",
      "text": "Keep your conscience clean. If people drag you, let it be for doing good — not dumb stuff."
    },
    {
      "verse": "17",
      "text": "If you gotta suffer, better it be for doing right than doing wrong."
    },
    {
      "verse": "18",
      "text": "Jesus suffered once to take our Ls — the Righteous for the unrighteous — to bring us to God. He died in the body but came back alive in the Spirit."
    },
    {
      "verse": "19",
      "text": "Then He flexed His victory, proclaiming it even to the spirits locked up in prison."
    },
    {
      "verse": "20",
      "text": "Those were the ones from Noah’s era who ignored God while the ark was being built. Only eight people made it out through the flood."
    },
    {
      "verse": "21",
      "text": "That water points to baptism — not just a bath for dirt, but a sign of a clean conscience before God through Jesus’ resurrection."
    },
    {
      "verse": "22",
      "text": "Now Jesus sits at God’s right hand, angels and powers bowing down, full authority secured."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "So since Christ pulled through pain for us, arm yourself with that same mindset — whoever’s done with sin got no time for weak temptations anymore."
    },
    {
      "verse": "2",
      "text": "From now on, stop living like it’s your show — chase God’s will, not human cravings."
    },
    {
      "verse": "3",
      "text": "You already wasted enough time on wild stuff: lust, parties, being lit in the wrong way, idol nonsense — it’s over."
    },
    {
      "verse": "4",
      "text": "Now your old crew’s confused like, “Bro switched up?” and start throwing shade."
    },
    {
      "verse": "5",
      "text": "But chill, they’ll answer to God — the ultimate Judge who checks both the living and the dead."
    },
    {
      "verse": "6",
      "text": "That’s why the gospel even hit those who’ve passed — so that even if judged by humans, they’d live by God’s Spirit."
    },
    {
      "verse": "7",
      "text": "Yo, end times vibes are near. Stay clear-headed, stay prayed up — no distractions."
    },
    {
      "verse": "8",
      "text": "Top-tier rule: keep loving hard. Love covers a lotta mess-ups."
    },
    {
      "verse": "9",
      "text": "Be hospitable without whining — yeah, even to that one annoying friend."
    },
    {
      "verse": "10",
      "text": "Use your gifts like tools — serve others with what God dropped in you."
    },
    {
      "verse": "11",
      "text": "If you speak, speak like God’s mic. If you serve, serve with His strength. Everything gotta point back to Him — full glory to God through Jesus. Period."
    },
    {
      "verse": "12",
      "text": "Don’t act shocked when life gets fiery — trials ain’t glitches, they’re part of the plan."
    },
    {
      "verse": "13",
      "text": "Instead, rejoice — if you share Christ’s sufferings now, you’ll share His glory later."
    },
    {
      "verse": "14",
      "text": "If people diss you for repping Jesus, congrats — that’s proof the Holy Spirit’s glow is on you."
    },
    {
      "verse": "15",
      "text": "Just make sure your suffering ain’t because you’re acting dumb — no stealing, wilding, or drama."
    },
    {
      "verse": "16",
      "text": "But if it’s for being a Christian, don’t hide it. Rep that badge proudly."
    },
    {
      "verse": "17",
      "text": "Judgment starts at God’s house first — so if we’re up first, imagine the world’s turn later."
    },
    {
      "verse": "18",
      "text": "If even the righteous barely make it, what about those still clowning God?"
    },
    {
      "verse": "19",
      "text": "So if you’re suffering for doing right, chill and trust God — He’s the ultimate Creator; He knows what He’s doing."
    }]},
    {
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, I’m talking to the elders — I’m one too, and I saw Christ’s suffering firsthand. So yeah, I got some authority to talk."
    },
    {
      "verse": "2",
      "text": "Shepherd God’s squad — don’t be forced, do it willingly. Not chasing clout or cash, but outta pure heart."
    },
    {
      "verse": "3",
      "text": "Don’t flex power over them — be the example they can follow, not the boss they fear."
    },
    {
      "verse": "4",
      "text": "And when the Big Shepherd (Jesus) shows up, He’s handing out crowns that never fade. Immortal drip."
    },
    {
      "verse": "5",
      "text": "Same for the young ones — respect your elders. But yo, everyone better wear humility like an outfit, ‘cause God resists the proud but boosts the humble."
    },
    {
      "verse": "6",
      "text": "So humble yourself under God’s mighty hand — He’ll raise you up at the perfect time. No rush, just trust."
    },
    {
      "verse": "7",
      "text": "Drop all your stress on Him — He actually cares, fr."
    },
    {
      "verse": "8",
      "text": "Stay woke. Your enemy the devil out here prowling like a lion looking for someone to munch."
    },
    {
      "verse": "9",
      "text": "Stand your ground. You ain’t alone — your brothers and sisters worldwide are fighting the same war."
    },
    {
      "verse": "10",
      "text": "After you’ve suffered a bit, the God of all grace — who called you to eternal glory — will personally restore, strengthen, and settle you. That’s His vibe."
    },
    {
      "verse": "11",
      "text": "All power to Him, forever. Period."
    },
    {
      "verse": "12",
      "text": "I wrote this with Silvanus’ help — short but real. Stay firm in God’s true grace, no fake faith allowed."
    },
    {
      "verse": "13",
      "text": "The crew in Babylon (aka the Church out here) sends love. Mark says hey too."
    },
    {
      "verse": "14",
      "text": "Wrap it up with peace and love — greet each other warmly. Peace out to everyone living in Christ."
    }]}]}