{
  "book": "2John",
  "chapters": [
    {
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, this is James’ bro, writing to the OG lady and her squad—big love from me, and from the whole crew that’s keeping it real in the truth."
    },
    {
      "verse": "2",
      "text": "Mad respect, ‘cause you’ve been walking straight in God’s truth—real talk, that’s what we’re here for."
    },
    {
      "verse": "3",
      "text": "Big vibes of grace, mercy, and peace from God the Father and Jesus our Lord, who is fully real and true, coming at you straight."
    },
    {
      "verse": "4",
      "text": "Lowkey, I was hyped to find out some of your squad is living by the truth—staying loyal to Jesus, no cap."
    },
    {
      "verse": "5",
      "text": "Now, I’m asking for one thing: keep showing love in real ways. Don’t just talk it, live it."
    },
    {
      "verse": "6",
      "text": "Love isn’t random—it’s following God’s commands. That’s how we keep walking in the truth."
    },
    {
      "verse": "7",
      "text": "Watch out for imposters—people sneaking in teaching stuff that denies Jesus came in the flesh. That’s shady."
    },
    {
      "verse": "8",
      "text": "Stay alert! Don’t lose the reward you’ve been working for—keep your eyes on the prize, fully locked in."
    },
    {
      "verse": "9",
      "text": "Anyone rolling with false teachings? Don’t even vibe with them in a way that gives approval—don’t welcome them into your squad."
    },
    {
      "verse": "10",
      "text": "If you do welcome them, you’re basically joining their shady moves. Big no-no."
    },
    {
      "verse": "11",
      "text": "Anyone who gives props to their sketchy actions shares in the consequences. Keep your energy clean."
    },
    {
      "verse": "12",
      "text": "I’m not gonna spam you with a long letter—hope to see you IRL soon and we can talk face-to-face."
    },
    {
      "verse": "13",
      "text": "Peace out from the squad here—our friends send mad love."
    }
  ]
}

    ]}