{
  "book": "2Peter",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, it’s Simon Peter here — servant and apostle of Jesus Christ. Shout-out to y’all who got the same faith as us, ‘cause God’s fairness hooked us up through Christ."
    },
    {
      "verse": "2",
      "text": "Grace and peace to you, multiplied like crazy, as you keep leveling up in knowing God and Jesus our Lord."
    },
    {
      "verse": "3",
      "text": "God already dropped everything we need for a godly life — power pack unlocked — through knowing Him who called us by His glory and vibes."
    },
    {
      "verse": "4",
      "text": "He gave us promises that hit different — so we can bounce outta the world’s corruption and actually share in His divine nature. That’s real transformation, not just talk."
    },
    {
      "verse": "5",
      "text": "So add to your faith some grind: moral excellence; to excellence, knowledge;"
    },
    {
      "verse": "6",
      "text": "to knowledge, self-control; to self-control, perseverance; to perseverance, godliness;"
    },
    {
      "verse": "7",
      "text": "to godliness, brotherly love; and to that, full-on agape love. Stack ‘em like upgrades."
    },
    {
      "verse": "8",
      "text": "If you keep growing in these, you won’t be useless or washed in your walk with Christ."
    },
    {
      "verse": "9",
      "text": "But if you’re slacking, it’s like you forgot you were forgiven — blind, can’t even see what God’s already done for you."
    },
    {
      "verse": "10",
      "text": "So lock in, brothers and sisters — make sure your calling and election stay verified. If you do that, you won’t trip."
    },
    {
      "verse": "11",
      "text": "Then you’ll get a rich welcome into the eternal kingdom of our Lord and Savior Jesus Christ — VIP access type beat."
    },
    {
      "verse": "12",
      "text": "That’s why I’ll keep reminding you of this stuff even though you already know it. Repetition builds resilience."
    },
    {
      "verse": "13",
      "text": "As long as I’m still in this body (aka my tent), I’ll keep shaking y’all awake with reminders."
    },
    {
      "verse": "14",
      "text": "‘Cause I know my time’s almost up — Jesus told me so."
    },
    {
      "verse": "15",
      "text": "So I’m setting things up so that after I dip, y’all will still remember this truth. Legacy secured."
    },
    {
      "verse": "16",
      "text": "We didn’t follow made-up stories — we were eyewitnesses of His majesty, straight up."
    },
    {
      "verse": "17",
      "text": "He got glory from God the Father when that voice came from heaven saying, “This is My beloved Son; I’m proud of Him.”"
    },
    {
      "verse": "18",
      "text": "We heard that voice ourselves while we were with Him on the holy mountain."
    },
    {
      "verse": "19",
      "text": "And we’ve got the prophetic word confirmed — pay attention to it like a light shining in a dark room until the Morning Star rises in your hearts."
    },
    {
      "verse": "20",
      "text": "Know this: no prophecy in Scripture came from private interpretation or someone’s random idea."
    },
    {
      "verse": "21",
      "text": "Prophecy came when holy people spoke under the move of the Holy Spirit — not from human imagination."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "But yo, just like there were fake prophets back then, there’ll be fake teachers among y’all now. They’ll sneak in cap doctrines, even deny Jesus who bought ‘em. Self-destruct sequence: activated."
    },
    {
      "verse": "2",
      "text": "A lotta people gonna follow their messy lifestyle, and because of them, the real truth gon’ get clowned."
    },
    {
      "verse": "3",
      "text": "They’ll milk y’all with smooth words for cash. But don’t worry—God’s judgment ain’t napping; payback’s already loading."
    },
    {
      "verse": "4",
      "text": "God didn’t spare angels who wilded out—He locked ‘em in darkness till judgment day. So trust, nobody gets a free pass."
    },
    {
      "verse": "5",
      "text": "He wiped the whole world in Noah’s era, sparing only eight people. That flood was proof He doesn’t joke with sin."
    },
    {
      "verse": "6",
      "text": "Sodom and Gomorrah? Ashes. Exhibit A of what happens when people go full rebellion."
    },
    {
      "verse": "7",
      "text": "But He rescued Lot—dude was sick of the city’s filthy drama."
    },
    {
      "verse": "8",
      "text": "Every day that man was tormented seeing all that wickedness around him. Real talk, it drained his spirit."
    },
    {
      "verse": "9",
      "text": "So yeah, God knows how to rescue the righteous outta chaos and hold the wicked till judgment. Perfect timing always."
    },
    {
      "verse": "10",
      "text": "Especially those wild with lust and disrespect authority. They’re bold, arrogant—talk big but got zero reverence."
    },
    {
      "verse": "11",
      "text": "Even angels, who got way more power, don’t speak reckless like that when bringing charges before God."
    },
    {
      "verse": "12",
      "text": "These clowns talk trash about what they don’t even understand—like beasts running on instinct—destined to be taken down."
    },
    {
      "verse": "13",
      "text": "They gon’ reap what they sow. They party in daytime, flexing their sins like it’s a trophy. Their vibe at your table? Pure contamination."
    },
    {
      "verse": "14",
      "text": "Their eyes are addicted to lust, hearts trained for greed—cursed generation energy."
    },
    {
      "verse": "15",
      "text": "They ditched the straight road and copied Balaam, that prophet who fumbled for a bag."
    },
    {
      "verse": "16",
      "text": "Remember? A donkey literally spoke to check him—man got roasted by his own ride."
    },
    {
      "verse": "17",
      "text": "These false teachers are dry wells and storm clouds with no rain—loud, dramatic, but empty."
    },
    {
      "verse": "18",
      "text": "They talk flashy nonsense, dragging unstable people back into old sins with temptation bait."
    },
    {
      "verse": "19",
      "text": "They promise freedom, but they’re slaves themselves—sin got ‘em chained up. Whoever you obey, owns you."
    },
    {
      "verse": "20",
      "text": "If someone escapes the world’s mess by knowing Jesus but dives back in, they’re worse off than before."
    },
    {
      "verse": "21",
      "text": "It would’ve been better if they never knew the truth than to know it and ditch it."
    },
    {
      "verse": "22",
      "text": "Like that proverb says—dog goes back to its vomit, and washed pigs dive right back into the mud. Full circle of foolishness."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Fam, this is my second letter. I’m tryna wake y’all brains up — remind you what the prophets said and what Jesus commanded."
    },
    {
      "verse": "2",
      "text": "You gotta keep those words loaded — the OG prophets and the Lord’s apostles both dropped pure truth."
    },
    {
      "verse": "3",
      "text": "Heads-up: in the last days, scoffers gonna rise. Mockers with loud mouths, living however they want, saying “where’s this ‘Jesus coming back’ thing?”"
    },
    {
      "verse": "4",
      "text": "They’ll act like nothing ever changed since creation — like God forgot the timeline. Straight denial of history."
    },
    {
      "verse": "5",
      "text": "They forget that by God’s Word the heavens existed, and the earth came from water and through water. He spoke, and boom — world loaded."
    },
    {
      "verse": "6",
      "text": "That same world got flooded later — water wiped it clean. Reset mode."
    },
    {
      "verse": "7",
      "text": "Now the current heavens and earth are being reserved for fire. Not random, but divine judgment day-type fire. Ungodly folks? Toasted if they don’t turn."
    },
    {
      "verse": "8",
      "text": "But don’t get it twisted — time hits different for God. A thousand years = one day to Him. He’s not lagging, He’s just eternal."
    },
    {
      "verse": "9",
      "text": "God ain’t slow; He’s patient. He’s giving people extra time to repent, not wanting anyone to perish. That’s mercy in HD."
    },
    {
      "verse": "10",
      "text": "But when the Day of the Lord hits — no warning, like a thief. The skies gonna vanish, elements burn, and everything exposed. No cap, no hiding."
    },
    {
      "verse": "11",
      "text": "So if that’s how everything ends, how holy and focused should y’all be while you wait? Act right — you know what’s coming."
    },
    {
      "verse": "12",
      "text": "Stay locked in, waiting and even speeding it up by living righteously, till heaven gets burned up and everything melts."
    },
    {
      "verse": "13",
      "text": "But the real ones — we wait for new heavens and a new earth where righteousness actually runs the place."
    },
    {
      "verse": "14",
      "text": "So fam, since you’re waiting, stay spotless and at peace. Keep your record clean before God."
    },
    {
      "verse": "15",
      "text": "Count His patience as salvation. Paul said the same thing — man wrote wisdom, sometimes deep but true."
    },
    {
      "verse": "16",
      "text": "Some twist his words, same way they twist Scripture, and that’s how they self-destruct spiritually."
    },
    {
      "verse": "17",
      "text": "So don’t get dragged by their foolishness. You already know the truth, don’t lose your grip and fall from your secure spot."
    },
    {
      "verse": "18",
      "text": "Grow in grace. Level up in knowing Jesus — the Savior and King. To Him be the glory, now and forever. Period."
    }]}
  ]}