{
  "book": "3John",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, this is James’ bro, writing to my homie Gaius—mad respect and love, fam."
    },
    {
      "verse": "2",
      "text": "Lowkey, I hope you’re thriving in every way—health, happiness, faith—leveling up fully."
    },
    {
      "verse": "3",
      "text": "Nothing hits harder than hearing your squad is walking in truth. I was hyped, seriously."
    },
    {
      "verse": "4",
      "text": "Seeing you live in the real Jesus energy? Big joy for me—pure hype."
    },
    {
      "verse": "5",
      "text": "Fam, you’re doing mad things for traveling missionaries—giving them room, helping them out. God sees that, no cap."
    },
    {
      "verse": "6",
      "text": "They’re repping Jesus, going out for the squad, no thanks needed from anyone else."
    },
    {
      "verse": "7",
      "text": "It’s good vibes to support real missionaries—they travel for the Gospel, chasing the truth, fully committed."
    },
    {
      "verse": "8",
      "text": "If you help them, you’re part of the squad doing good work—basically tagging along in their mission."
    },
    {
      "verse": "9",
      "text": "I sent a note to the squad, telling them to respect this shady dude, Diotrephes. He’s out here blocking visitors, talking big, and refusing to welcome the squad."
    },
    {
      "verse": "10",
      "text": "Not cool. Even talking trash about me to the crew—straight-up manipulative energy. Don’t follow that vibe."
    },
    {
      "verse": "11",
      "text": "Fam, don’t copy bad energy—copy good. Real love, real truth, real respect."
    },
    {
      "verse": "12",
      "text": "Demetrius? Everyone’s hyping him up for truth and vibes—he’s got receipts and respect from everyone, including us."
    },
    {
      "verse": "13",
      "text": "I would’ve told you more, but we keep it short—can’t fit everything in text."
    },
    {
      "verse": "14",
      "text": "Peace out, fam. The squad sends love, and I hope we can link up soon."
    }
  ]
}]}