{
  "book": "Colossians",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, Paul here, God’s chosen apostle, with my dude Timothy, sending mad love to Colossians saints in Christ."
    },
    {
      "verse": "2",
      "text": "Grace and peace from God the Father and Jesus Christ, leveling up your soul game."
    },
    {
      "verse": "3",
      "text": "We flex gratitude to God every time we think of y’all, hearing about your faith vibes and love for the squad of saints."
    },
    {
      "verse": "4",
      "text": "Your faith? Legendary status. Everyone talks about it, lowkey hyped."
    },
    {
      "verse": "5",
      "text": "And that hope you’re holding for heaven? Eternal, unshakable, no cap."
    },
    {
      "verse": "6",
      "text": "The gospel you caught? It’s live, fruit-bearing, going global—full energy."
    },
    {
      "verse": "7",
      "text": "Big ups to Epaphras, our faithful homie, representing you and the squad."
    },
    {
      "verse": "8",
      "text": "He spilled all the tea on your love in the Spirit, showing God flexing in your lives."
    },
    {
      "verse": "9",
      "text": "So we keep praying, asking God to fill you with max wisdom and next-level spiritual insight."
    },
    {
      "verse": "10",
      "text": "Walk worthy of the Lord—live big, do good deeds, glow up in Him."
    },
    {
      "verse": "11",
      "text": "Strengthened with power through the Spirit; endure, stay patient, keep joyful—boss-level."
    },
    {
      "verse": "12",
      "text": "Shoutout to the Father, who made you fit for your ultimate heavenly inheritance."
    },
    {
      "verse": "13",
      "text": "He rescued us from darkness, pulling us into the kingdom of His Son—VIP access."
    },
    {
      "verse": "14",
      "text": "Jesus cleared our sins, making us holy and blameless in God’s eyes—full reset."
    },
    {
      "verse": "15",
      "text": "He’s the image of the invisible God, firstborn over all creation—OG flex."
    },
    {
      "verse": "16",
      "text": "All stuff was made through Him, everything in the universe—thrones, powers, authorities, rulers—all for Him."
    },
    {
      "verse": "17",
      "text": "He’s before everything, holding it all together like ultimate glue."
    },
    {
      "verse": "18",
      "text": "He’s the head of the church, firstborn from the dead, Supreme Boss over all."
    },
    {
      "verse": "19",
      "text": "God was hyped to have all His fullness dwell in Him—total power move."
    },
    {
      "verse": "20",
      "text": "Through Him, God reconciles everything to Himself, making peace via the cross—game changer."
    },
    {
      "verse": "21",
      "text": "We were once far from God, enemies in mindset, now reconciled, holy, blameless—VIP squad."
    },
    {
      "verse": "22",
      "text": "Stand firm in faith, rooted, no shifting with hype waves."
    },
    {
      "verse": "23",
      "text": "This is the gospel you heard; hold tight, live it, glow up in maturity."
    },
    {
      "verse": "24",
      "text": "I rejoice in my sufferings for you, filling what’s lacking in Christ’s afflictions for the church—lowkey grind."
    },
    {
      "verse": "25",
      "text": "God gave me the stewardship of His mystery, fully revealed—next-level flex."
    },
    {
      "verse": "26",
      "text": "The mystery hidden for ages? Now revealed to His saints—mind blown."
    },
    {
      "verse": "27",
      "text": "That mystery? Christ in you—the hope of ultimate glory—boss energy."
    },
    {
      "verse": "28",
      "text": "We preach Him, teach, and warn everyone, making disciples who are peak-level spiritually."
    },
    {
      "verse": "29",
      "text": "My grind? Working hard according to God’s power within me, nonstop, 24/7—no cap."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, Paul here, lowkey heavy in spirit for you, and for Laodicea, making sure you’re fully woke in God’s vibes."
    },
    {
      "verse": "2",
      "text": "I want you fully encouraged, tied together in love, and knowing the full squad plan God set."
    },
    {
      "verse": "3",
      "text": "All wisdom and knowledge treasures? Fully packed in Christ—no hacks, no cap."
    },
    {
      "verse": "4",
      "text": "Don’t get played by smooth-talking hype merchants flexing empty philosophies."
    },
    {
      "verse": "5",
      "text": "I repeat: my presence may be lacking, but my heart is fully with you."
    },
    {
      "verse": "6",
      "text": "Grab Jesus and keep walking in Him, living the high-energy vibes of His life."
    },
    {
      "verse": "7",
      "text": "Rooted, built up, faith stacked, overflowing in gratitude—maxed out."
    },
    {
      "verse": "8",
      "text": "Watch out—don’t let anyone flex human traditions or worldly rules over you, empty hype."
    },
    {
      "verse": "9",
      "text": "Full Godness? Lives in Christ, bodily—ultimate boss flex."
    },
    {
      "verse": "10",
      "text": "He’s the head of all powers, supreme over everything—OG authority."
    },
    {
      "verse": "11",
      "text": "In Him, spiritual glow-up: circumcised in heart, reborn in Spirit, no skin-only moves."
    },
    {
      "verse": "12",
      "text": "Buried with Him in baptism, raised with Him by faith in God’s power flex."
    },
    {
      "verse": "13",
      "text": "Even dead in sins? God made you alive with Christ, straight-up grace download."
    },
    {
      "verse": "14",
      "text": "He wiped the slate, erased the record of debts against us, nailed it to the cross—destroyed the vibes of sin."
    },
    {
      "verse": "15",
      "text": "Stripped rulers and powers, exposed publicly, flexed total victory on the cross."
    },
    {
      "verse": "16",
      "text": "Don’t let anyone judge you for food, drink, festivals, new moon, or sabbaths—these are shadows."
    },
    {
      "verse": "17",
      "text": "Those shadows? Pointing to Christ—the real deal, full substance, ultimate energy."
    },
    {
      "verse": "18",
      "text": "Nobody should flex control over you with fake humility, angel visions, or empty bragging."
    },
    {
      "verse": "19",
      "text": "Christ is head, holding everything together; the church grows aligned under Him—full squad synergy."
    },
    {
      "verse": "20",
      "text": "If you died with Christ to the world’s vibes, why live under rules like “don’t handle, don’t taste, don’t touch”? Pure dead energy."
    },
    {
      "verse": "21",
      "text": "Rules are temporary, just shadows pointing to the real flex in Christ."
    },
    {
      "verse": "22",
      "text": "Don’t get trapped in human commandments and teachings—they can’t beat flesh desires or resurrect the spirit."
    },
    {
      "verse": "23",
      "text": "Those rules look spiritual on the outside, showing wisdom, humility, or strictness—but inside? They’re powerless against sin. Straight-up fake flex energy."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "If you’re vibing with Christ—like dead-to-the-old-you—look for the real stuff above, not the earth grind."
    },
    {
      "verse": "2",
      "text": "Keep your mind locked on heaven stuff, not petty human chaos."
    },
    {
      "verse": "3",
      "text": "You’re dead in the old grind; your life? Hidden in Christ, ultimate cloak flex."
    },
    {
      "verse": "4",
      "text": "When He pops up, your life will flex publicly, fully revealed—glory squad move."
    },
    {
      "verse": "5",
      "text": "Kill the earth vibes: sexual sins, lust, evil desires—total wipeout."
    },
    {
      "verse": "6",
      "text": "Greed? That’s straight-up idolatry. Remove it from your squad."
    },
    {
      "verse": "7",
      "text": "That stuff is coming for you, like fire—God’s wrath isn’t cap."
    },
    {
      "verse": "8",
      "text": "Don’t lie, slander, rage, or curse—leave the old self in the dust."
    },
    {
      "verse": "9",
      "text": "Stop fronting with each other; old self tricks = extinct."
    },
    {
      "verse": "10",
      "text": "Put on the new self: renewed, full of God energy, getting smarter every day."
    },
    {
      "verse": "11",
      "text": "No squad divisions: Jew, Greek, slave, free—Christ smashes all barriers."
    },
    {
      "verse": "12",
      "text": "Now, roll with compassion, kindness, humility, gentleness, and patience—new self flex."
    },
    {
      "verse": "13",
      "text": "Forgive each other, just like Christ forgave you—no receipts, pure energy."
    },
    {
      "verse": "14",
      "text": "Most importantly? Love. Love stacks it all together perfectly, ultimate glue."
    },
    {
      "verse": "15",
      "text": "Let peace run your squad—Christ called you together as one body, max unity."
    },
    {
      "verse": "16",
      "text": "Wisdom? Let it flow. Sing psalms, hymns, spiritual remixes with gratitude in your heart."
    },
    {
      "verse": "17",
      "text": "Whatever you do—talk, grind, or vibe—do it in Jesus’ name. Big thanks to God."
    },
    {
      "verse": "18",
      "text": "Wives, respect your husbands, full-on respect mode."
    },
    {
      "verse": "19",
      "text": "Husbands, love your wives, no lowkey rage—keep it clean, real flex."
    },
    {
      "verse": "20",
      "text": "Kids, obey your parents, no backtalk—this pleases the Lord, not just humans."
    },
    {
      "verse": "21",
      "text": "Parents, don’t cap your kids; no threats, no toxicity—let them grow in God energy."
    },
    {
      "verse": "22",
      "text": "Slaves (workers under authority), obey earthly bosses with respect and sincerity, not just eyes-on-the-paycheck energy."
    },
    {
      "verse": "23",
      "text": "Whatever you do, work like God sees you—heart in it, not just human applause."
    },
    {
      "verse": "24",
      "text": "Remember, you’re grinding for the Lord, not humans—eternal rewards flex."
    },
    {
      "verse": "25",
      "text": "Wrongdoing gets its payback; God’s justice is on point—no favoritism, full checkmate."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "Bosses, treat your workers right—God’s watching. No unfair vibes, pure respect energy."
    },
    {
      "verse": "2",
      "text": "Pray hard. Keep alert. Be on that thankful flex 24/7."
    },
    {
      "verse": "3",
      "text": "Pray for us too—Paul’s crew needs doors open, God moves, messages spread, unblocked grind."
    },
    {
      "verse": "4",
      "text": "Pray I can spit wisdom in words that make God flex, not get blocked by haters."
    },
    {
      "verse": "5",
      "text": "Live smart with outsiders, flex with that God wisdom, make every move count."
    },
    {
      "verse": "6",
      "text": "Let your talk be salted, seasoned right, so you can drop truth vibes everywhere."
    },
    {
      "verse": "7",
      "text": "Tychicus, faithful squad member, brings news, encourages hearts—real MVP vibes."
    },
    {
      "verse": "8",
      "text": "I’m sending him so you can get the full scoop and know what’s really popping in our squad."
    },
    {
      "verse": "9",
      "text": "Onesimus, our brother in the grind, a faithful soldier, sends his greetings too."
    },
    {
      "verse": "10",
      "text": "Aristarchus, my ride-or-die in prison, greets you. So does Mark, Barnabas’ cousin. If he rolls with you, welcome him with open squad energy."
    },
    {
      "verse": "11",
      "text": "Jesus, called Justus, real men of the squad here—true comfort for me, sending love."
    },
    {
      "verse": "12",
      "text": "Epaphras, my hype man for you in prayer, grinding for you with tears, so you stay strong and full of God energy."
    },
    {
      "verse": "13",
      "text": "He’s repping you hard in chains, fighting for you in the spiritual realm."
    },
    {
      "verse": "14",
      "text": "Luke, the doc, and Demas send love. Real ones keeping it 100."
    },
    {
      "verse": "15",
      "text": "Greet the squad in Laodicea, and Nympha’s house crew, and the church meeting in her pad."
    },
    {
      "verse": "16",
      "text": "Read this letter in your squad circles, make sure everyone gets the vibe. And this letter? Share it with Colossae."
    },
    {
      "verse": "17",
      "text": "Tell Archippus: “Stay woke in the mission, keep the grind alive.”"
    },
    {
      "verse": "18",
      "text": "Paul signs it himself—remember, my hand seals this. Keep it real, for the grace of God is massive."
    }]}
  ]}