{
  "book": "Ephesians",
  "chapters": [
    {
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Paul, God’s assigned messenger, texting the believers in Ephesus who stay locked-in with Christ."
    },
    {
      "verse": "2",
      "text": "Grace and peace pulling up on y’all — straight from God our Father and the Lord Jesus."
    },
    {
      "verse": "3",
      "text": "Praise to God — He loaded us with every spiritual buff in Christ from the heavenly realm."
    },
    {
      "verse": "4",
      "text": "Before the world even loaded, He picked us to be holy and blameless in His presence — no glitches."
    },
    {
      "verse": "5",
      "text": "In love, He pre-decided to adopt us into His family through Jesus. That was His exact plan — no reroute."
    },
    {
      "verse": "6",
      "text": "So all the credit lands on His glorious grace — the same grace He poured heavy on us in His Son."
    },
    {
      "verse": "7",
      "text": "In Jesus, we got redemption — paid in full — and forgiveness through His blood. Grace overflow mode."
    },
    {
      "verse": "8",
      "text": "He didn’t give grace sparingly; He dropped WISDOM + INSIGHT on us like DLC."
    },
    {
      "verse": "9",
      "text": "He revealed His secret plan: the mystery He intended from the jump, all centered on Christ."
    },
    {
      "verse": "10",
      "text": "Plan was this: when the time hits max level, He’ll unite everything — heaven and earth — under Christ."
    },
    {
      "verse": "11",
      "text": "In Him, we gained an inheritance — decided beforehand by the God who doesn’t miss with His plans."
    },
    {
      "verse": "12",
      "text": "So that we, the ones who hoped in Christ early, would be walking displays of His glory."
    },
    {
      "verse": "13",
      "text": "And y’all too — once you heard the truth (the gospel that saved you) and believed — boom, sealed with the Holy Spirit."
    },
    {
      "verse": "14",
      "text": "The Spirit is the down payment — God’s guarantee — that He’s finishing everything He promised. Full redemption pending. Glory incoming."
    },
    {
      "verse": "15",
      "text": "I heard about your faith and your love for the saints — had me smiling lowkey."
    },
    {
      "verse": "16",
      "text": "I don’t stop thanking God for y’all; I keep mentioning you in prayer."
    },
    {
      "verse": "17",
      "text": "I ask God — the Father of glory — to give y’all wisdom and revelation so you really KNOW Him."
    },
    {
      "verse": "18",
      "text": "Praying the eyes of your heart get brightness so you see three things: – the hope He called you to, – the riches of His inheritance, – and the magnitude of His power."
    },
    {
      "verse": "19",
      "text": "His power hits different — same energy He flexed in Christ when He raised Him from the dead."
    },
    {
      "verse": "20",
      "text": "That same power seated Jesus at God’s right hand in the heavenly places."
    },
    {
      "verse": "21",
      "text": "Above all rule, authority, power, domination — above every name now or later. No competition."
    },
    {
      "verse": "22",
      "text": "God placed EVERYTHING under Jesus’ feet and made Him the Head over everything for the church."
    },
    {
      "verse": "23",
      "text": "The church — His body — is His fullness, the expression of Him who fills all things completely."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Y’all were spiritually dead — running on sin mode, no life bar."
    },
    {
      "verse": "2",
      "text": "You used to follow the world’s flow — the enemy running ops in the hearts of the disobedient."
    },
    {
      "verse": "3",
      "text": "We all lived like that once: chasing cravings, doing whatever our body + mind wanted. We were headed for wrath like everyone else."
    },
    {
      "verse": "4",
      "text": "But God — rich in mercy, crazy loving us…"
    },
    {
      "verse": "5",
      "text": "Made us alive with Christ even when we were dead in sin. Grace saved you, no cap."
    },
    {
      "verse": "6",
      "text": "He raised us up and seated us with Christ in the heavenly realm. That’s our new position."
    },
    {
      "verse": "7",
      "text": "So in the ages to come, God gonna flex how unbelievably rich His grace and kindness are to us in Jesus."
    },
    {
      "verse": "8",
      "text": "You’re saved by grace through faith — this ain’t from yourselves. Zero bragging rights."
    },
    {
      "verse": "9",
      "text": "Not from works. So nobody can boast like they earned it."
    },
    {
      "verse": "10",
      "text": "We’re God’s handiwork — His crafted project — created in Christ for good works He prepared in advance."
    },
    {
      "verse": "11",
      "text": "Remember: y’all Gentiles used to be called “uncircumcised” by the Jews — the “circumcision” squad."
    },
    {
      "verse": "12",
      "text": "Back then you were without Christ, outside Israel’s promises, no covenant, no hope, no God in the world."
    },
    {
      "verse": "13",
      "text": "But now in Christ, you who were far away got brought near by His blood."
    },
    {
      "verse": "14",
      "text": "Jesus Himself is our peace — He made both groups one and broke the dividing wall."
    },
    {
      "verse": "15",
      "text": "He removed the hostility by setting aside the old regulations so He could create one new humanity in Himself."
    },
    {
      "verse": "16",
      "text": "He reconciled both groups to God in one body through the cross — killing the beef."
    },
    {
      "verse": "17",
      "text": "He came preaching peace to those far away and those close."
    },
    {
      "verse": "18",
      "text": "Through Him, we both get access to the Father through the same Spirit."
    },
    {
      "verse": "19",
      "text": "So y’all aren’t strangers anymore — you’re fellow citizens with God’s people and members of His household."
    },
    {
      "verse": "20",
      "text": "Built on the foundation of the apostles and prophets, with Jesus Himself as the cornerstone."
    },
    {
      "verse": "21",
      "text": "In Him the whole building fits together, growing into a holy temple in the Lord."
    },
    {
      "verse": "22",
      "text": "And in Him, y’all are being built together into a place where God’s Spirit dwells."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "So for this reason, I Paul — the guy locked up for Jesus on behalf of you Gentiles —"
    },
    {
      "verse": "2",
      "text": "You’ve heard how God put me in charge of bringing His grace to you."
    },
    {
      "verse": "3",
      "text": "He revealed the mystery to me — I already hinted at it earlier."
    },
    {
      "verse": "4",
      "text": "When you read this, you’ll understand the insight I got into Christ’s mystery."
    },
    {
      "verse": "5",
      "text": "This mystery wasn’t revealed to past generations the way it’s now shown to the apostles and prophets by the Spirit."
    },
    {
      "verse": "6",
      "text": "Here’s the tea: the Gentiles are co-heirs, part of the same body, and share the promise in Christ through the gospel."
    },
    {
      "verse": "7",
      "text": "I became a servant of this gospel by God’s gift of grace — powered by His strength."
    },
    {
      "verse": "8",
      "text": "To me — the least qualified of all saints — this grace was given: to preach Christ’s limitless riches to the Gentiles."
    },
    {
      "verse": "9",
      "text": "And to bring light to how this mystery works — the plan God hid for ages in Himself, the Creator of everything."
    },
    {
      "verse": "10",
      "text": "So now, through the church, God’s multi-layered wisdom is being revealed to rulers and powers in the spiritual realm."
    },
    {
      "verse": "11",
      "text": "This lines up with God’s eternal plan accomplished in Christ Jesus our Lord."
    },
    {
      "verse": "12",
      "text": "In Him we have boldness and confident access through faith."
    },
    {
      "verse": "13",
      "text": "So please don’t lose heart over my sufferings for you — it’s actually your glory."
    },
    {
      "verse": "14",
      "text": "For this reason, I kneel before the Father…"
    },
    {
      "verse": "15",
      "text": "From whom every family in heaven and on earth gets its name."
    },
    {
      "verse": "16",
      "text": "I pray He strengthens you with power through His Spirit in your inner being."
    },
    {
      "verse": "17",
      "text": "So Christ may dwell in your hearts through faith — and you, being rooted and grounded in love…"
    },
    {
      "verse": "18",
      "text": "May have strength to grasp with all believers how wide, long, high, and deep Christ’s love is."
    },
    {
      "verse": "19",
      "text": "And to KNOW the love that surpasses knowledge — so you get filled with all God’s fullness."
    },
    {
      "verse": "20",
      "text": "Now to Him who can do way more than anything we ask or imagine — according to His power working in us —"
    },
    {
      "verse": "21",
      "text": "To Him be glory in the church and in Christ Jesus throughout all generations forever. Amen."
    }]},
{
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, I beg y’all — live worthy of the calling God gave you. Keep it humble, patient, chill, and love-heavy."
    },
    {
      "verse": "2",
      "text": "Stay lowkey humble, gentle with others, and patient — put up with each other in love like pros."
    },
    {
      "verse": "3",
      "text": "Do your best to keep the squad unified by peace — like glue in the Spirit."
    },
    {
      "verse": "4",
      "text": "One body, one Spirit, one hope — all in Christ. One team, one mission."
    },
    {
      "verse": "5",
      "text": "One Lord, one faith, one baptism — no clones, no substitutes."
    },
    {
      "verse": "6",
      "text": "One God and Father of all, above all, through all, inside all — main controller, CEO of everything."
    },
    {
      "verse": "7",
      "text": "But each of us got grace measured by Christ — like different power-ups for different players."
    },
    {
      "verse": "8",
      "text": "When Jesus leveled up, He took captives and dropped gifts to the people."
    },
    {
      "verse": "9",
      "text": "Some say, “He ascended?” Sure — but first, He came down, went under, then rose — all legit."
    },
    {
      "verse": "10",
      "text": "He fills everything from the underworld to the top — no empty slots."
    },
    {
      "verse": "11",
      "text": "He gave some to be apostles, some prophets, some evangelists, some pastors/teachers — all squad leaders."
    },
    {
      "verse": "12",
      "text": "Why? To train the saints, build up the squad, till we all hit full boss level — Christ-level unity and maturity."
    },
    {
      "verse": "13",
      "text": "So we stop being noobs, tossed around by every hype trend, and finally get strong in faith and knowledge of God."
    },
    {
      "verse": "14",
      "text": "No more baby-level instability, gullible to lies and shady vibes."
    },
    {
      "verse": "15",
      "text": "Instead, speak the truth with love — leveling everyone up — just like Christ, the Head, does."
    },
    {
      "verse": "16",
      "text": "The whole squad fits together; each part works right; the body grows and builds itself in love — like God designed it."
    },
    {
      "verse": "17",
      "text": "This is the lowkey you need to know: no more walking like the old life — full on lies, chasing whatever the world flexes."
    },
    {
      "verse": "18",
      "text": "They’re blind, separated from God’s life — can’t even see the truth because they’re stuck in stupidity and heart hard-mode."
    },
    {
      "verse": "19",
      "text": "They’re numb, giving in to every impulse, going wild with every lust — zero self-control."
    },
    {
      "verse": "20",
      "text": "But y’all didn’t roll that way — if you heard Christ, learned Him, got the truth down,"
    },
    {
      "verse": "21",
      "text": "And were taught by Him like real students, like the Bible says."
    },
    {
      "verse": "22",
      "text": "Drop your old habits — the old self decays, corrupted by desire tricks."
    },
    {
      "verse": "23",
      "text": "Get renewed in your inner game — mindset, spirit, heart — upgrade time."
    },
    {
      "verse": "24",
      "text": "Put on the new self, crafted to God’s image, real righteousness and truth energy."
    },
    {
      "verse": "25",
      "text": "Drop lies. Speak straight. Your squad needs the truth."
    },
    {
      "verse": "26",
      "text": "Angry? Cool down fast — don’t let it turn into sin mode."
    },
    {
      "verse": "27",
      "text": "Don’t give the enemy an open lobby — don’t let him run wild in your anger."
    },
    {
      "verse": "28",
      "text": "Work legit. Share. Help out. Don’t be lazy — supply what’s needed for the community."
    },
    {
      "verse": "29",
      "text": "Speak hype stuff — words that lift, build up, give grace where needed."
    },
    {
      "verse": "30",
      "text": "Don’t grieve the Holy Spirit — He’s sealing y’all for the final boss, the day of redemption."
    },
    {
      "verse": "31",
      "text": "Drop all bitterness, rage, slander, and foul vibes — like zero tolerance."
    },
    {
      "verse": "32",
      "text": "Be kind, compassionate, forgive each other — just like God forgave y’all in Christ."
    }]},
    {
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, be imitators of God — straight-up copy His moves like the ultimate role model."
    },
    {
      "verse": "2",
      "text": "Walk in love — Christ flexed hard for us, gave Himself up like the ultimate sacrifice. That’s peak energy."
    },
    {
      "verse": "3",
      "text": "Zero room for immorality, no filthy talk, no greed — none of that toxic stuff. God’s squad doesn’t vibe there."
    },
    {
      "verse": "4",
      "text": "And no dumb jokes about God — not even hint-level. Keep it holy."
    },
    {
      "verse": "5",
      "text": "Trust me, nothing immoral or greedy fits with God’s squad — those run out eventually."
    },
    {
      "verse": "6",
      "text": "Don’t get played by empty words — that’s how people fall into God’s wrath."
    },
    {
      "verse": "7",
      "text": "Stop rolling with shady vibes — your squad should be light, not dark."
    },
    {
      "verse": "8",
      "text": "Once you were darkness, now y’all are light — walk like it, vibe like it."
    },
    {
      "verse": "9",
      "text": "Light vibes = goodness, righteousness, truth. That’s the upgrade mode."
    },
    {
      "verse": "10",
      "text": "Check what pleases God — don’t just float, be intentional."
    },
    {
      "verse": "11",
      "text": "Dump the darkness stuff — don’t collab with shady ops."
    },
    {
      "verse": "12",
      "text": "Expose it all — call out bad vibes, not bury them."
    },
    {
      "verse": "13",
      "text": "Anything exposed by the light? Yeah, it shows up. Anything visible = God-approved to deal with."
    },
    {
      "verse": "14",
      "text": "Light wakes you up: “Up, sleeper! Rise from dead mode! Christ gonna glow on you.”"
    },
    {
      "verse": "15",
      "text": "Don’t move like noobs. Be woke, watch your step."
    },
    {
      "verse": "16",
      "text": "Time = currency — spend it smart. These days? Short AF."
    },
    {
      "verse": "17",
      "text": "Don’t be stupid. Know God’s will — don’t fall for hype or weak trends."
    },
    {
      "verse": "18",
      "text": "Don’t get sloshed — drunkenness = chaos. Be filled by the Spirit instead."
    },
    {
      "verse": "19",
      "text": "Speak to each other in psalms, hymns, spiritual bars — sing, hype, give glory."
    },
    {
      "verse": "20",
      "text": "Always thank God for everything — vibe positive, grateful heart."
    },
    {
      "verse": "21",
      "text": "Submit to each other outta respect for Christ — mutual flex, not domination."
    },
    {
      "verse": "22",
      "text": "Wives — vibe with husbands like respect-mode on."
    },
    {
      "verse": "23",
      "text": "Husbands — love your wives like Christ loves the church — peak sacrificial energy."
    },
    {
      "verse": "24",
      "text": "Church = wife-subject to Christ; wives = subject to husbands in everything God-approved."
    },
    {
      "verse": "25",
      "text": "Husbands — love like He gave Himself up, clean wipe-sacrifice, max selflessness."
    },
    {
      "verse": "26",
      "text": "Cleanse, refresh, level her up — no spiritual bugs, just full glory."
    },
    {
      "verse": "27",
      "text": "Love her to perfection — holy, pure, no weak spots, ready for final flex."
    },
    {
      "verse": "28",
      "text": "Husbands, love your wives like your own body — self-care level: God mode."
    },
    {
      "verse": "29",
      "text": "Nobody hates their own body — we feed, nurture, keep alive. Same with your wife."
    },
    {
      "verse": "30",
      "text": "We’re all members of His body — Spirit vibes connect us, hardcore synced."
    },
    {
      "verse": "31",
      "text": "Scripture said: “Man leaves fam, sticks with wife, becomes one flesh” — that’s real-life co-op mode."
    },
    {
      "verse": "32",
      "text": "Mystery alert: This is Christ + church energy — peak analogy."
    },
    {
      "verse": "33",
      "text": "So husbands? Love her like yourself. Wives? Respect like boss-mode respect."
    }
  ]},
  {
  "chapter": "6",
  "verses": [
    {
      "verse": "1",
      "text": "Kids — obey your parents. It’s the OG command with a reward — long life, solid blessing."
    },
    {
      "verse": "2",
      "text": "“Honor your parents” — that’s top-tier energy; it’s backed by God Himself."
    },
    {
      "verse": "3",
      "text": "This flex comes with life perks — you wanna stay blessed IRL? Do this."
    },
    {
      "verse": "4",
      "text": "Parents — don’t overheat your kids. Don’t be toxic with pressure. Build them up with God’s training and vibes."
    },
    {
      "verse": "5",
      "text": "Slaves — obey earthly bosses like you’re working for God, not humans. Full respect mode."
    },
    {
      "verse": "6",
      "text": "Don’t fake it or hide your hustle — do it from the heart like serving the Lord."
    },
    {
      "verse": "7",
      "text": "Work like it’s God watching, not just your boss. Peak accountability."
    },
    {
      "verse": "8",
      "text": "You know the energy: whatever good you do, God sees it — no cap."
    },
    {
      "verse": "9",
      "text": "Bosses — treat your crew right. No threats, no shady vibes. God’s watching — He’s the real CEO."
    },
    {
      "verse": "10",
      "text": "Yo, stay strong in the Lord — His power is your cheat code."
    },
    {
      "verse": "11",
      "text": "Suit up with the full armor of God — don’t even try to fight the devil naked."
    },
    {
      "verse": "12",
      "text": "Because the real battle isn’t against people IRL — it’s spiritual: powers, authorities, rulers of darkness, cosmic bad vibes."
    },
    {
      "verse": "13",
      "text": "Pull up the full armor — your squad’s survival depends on it. Stand firm."
    },
    {
      "verse": "14",
      "text": "Belt of truth cinched, breastplate of righteousness on — stay solid."
    },
    {
      "verse": "15",
      "text": "Feet in gospel peace — ready to bounce anywhere, swift like a sprint."
    },
    {
      "verse": "16",
      "text": "Shield of faith — block every flaming arrow, doubt, and lie."
    },
    {
      "verse": "17",
      "text": "Helmet of salvation, sword of the Spirit (God’s word) — full combo."
    },
    {
      "verse": "18",
      "text": "Pray all the time — Spirit-led, awake, keep grinding for all saints."
    },
    {
      "verse": "19",
      "text": "Pray for me too — that I can drop the word boldly, no cap."
    },
    {
      "verse": "20",
      "text": "I’m locked up for Jesus, doing God’s mission — pray my delivery is savage, Spirit-powered."
    },
    {
      "verse": "21",
      "text": "Tychicus — your boy, loyal servant, will update you on everything."
    },
    {
      "verse": "22",
      "text": "He’ll tell you the vibe and stabilize you — don’t sleep on him."
    },
    {
      "verse": "23",
      "text": "Peace, love, faith — straight from God the Father and Jesus."
    },
    {
      "verse": "24",
      "text": "Grace with all who love our Lord Jesus — fully unfiltered, zero limits."
    }]}]}