{
  "book": "Galatians",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Paul here — not repping human authority or self-appointment, but straight from Jesus Christ and God the Father, the One who raised Him from the dead."
    },
    {
      "verse": "2",
      "text": "All the believers rollin’ with me send love to the churches in Galatia."
    },
    {
      "verse": "3",
      "text": "Grace and peace to you, from God our Father and Jesus Christ, the ultimate source of both."
    },
    {
      "verse": "4",
      "text": "He gave Himself up for our sins, to rescue us from this corrupt age, exactly like God planned."
    },
    {
      "verse": "5",
      "text": "All glory belongs to Him — forever and ever. No debate."
    },
    {
      "verse": "6",
      "text": "I’m lowkey shocked y’all switched up so fast — turning from the One who called you through grace to chase some fake gospel."
    },
    {
      "verse": "7",
      "text": "Not that there’s another gospel — it’s just some people twisting the truth and trying to throw y’all off track."
    },
    {
      "verse": "8",
      "text": "If anyone — even if it’s me or an angel — comes through preaching a different gospel, let them be cursed. Period."
    },
    {
      "verse": "9",
      "text": "I’ll say it again: if anyone drops a remix of the gospel that ain’t the original, they’re cursed. End of story."
    },
    {
      "verse": "10",
      "text": "Y’all think I’m here to impress people? Nah. If I was chasing clout, I wouldn’t be serving Christ."
    },
    {
      "verse": "11",
      "text": "This gospel I’m preaching? Not man-made. I didn’t invent it, didn’t copy it, didn’t get it from no influencer."
    },
    {
      "verse": "12",
      "text": "I got it straight from Jesus Christ Himself. Divine download."
    },
    {
      "verse": "13",
      "text": "You already know my backstory — I used to wild out, attacking the church and trying to wreck the faith."
    },
    {
      "verse": "14",
      "text": "I was the overachiever in Jewish tradition, rising fast, more devoted than most my age."
    },
    {
      "verse": "15",
      "text": "But then God — who handpicked me before I was even born — decided to reveal His Son to me."
    },
    {
      "verse": "16",
      "text": "He did it so I could spread the gospel to non-Jews. I didn’t rush to get human approval or mentorship."
    },
    {
      "verse": "17",
      "text": "Didn’t hit Jerusalem or consult apostles right away — I went straight to Arabia, then came back to Damascus."
    },
    {
      "verse": "18",
      "text": "Three years later, I finally met Peter, chilled for fifteen days."
    },
    {
      "verse": "19",
      "text": "Didn’t see any other apostle except James, the Lord’s brother."
    },
    {
      "verse": "20",
      "text": "What I’m writing ain’t cap — God Himself knows that."
    },
    {
      "verse": "21",
      "text": "Then I traveled to Syria and Cilicia — stayed lowkey for a bit."
    },
    {
      "verse": "22",
      "text": "The churches in Judea hadn’t even seen my face yet."
    },
    {
      "verse": "23",
      "text": "They just kept hearing, “That dude who used to destroy the faith? He’s now preaching it.”"
    },
    {
      "verse": "24",
      "text": "And they praised God ‘cause of my glow-up in Christ."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Fourteen years later, Paul pulled up to Jerusalem again—this time bringing Barnabas and the homie Titus along."
    },
    {
      "verse": "2",
      "text": "He went ‘cause God told him to, and when he got there, he had a private convo with the church big dawgs—just to make sure all his grind preaching the gospel wasn’t for nothing."
    },
    {
      "verse": "3",
      "text": "Titus, a full-on Greek, didn’t even get pressured to get circumcised—thank God."
    },
    {
      "verse": "4",
      "text": "But some fake believers snuck in, tryna spy on the freedom we got in Christ, hoping to chain us back up with rules."
    },
    {
      "verse": "5",
      "text": "Paul said “nah fam,” didn’t give them one second of power, so the real gospel could stay unedited."
    },
    {
      "verse": "6",
      "text": "The so-called “leaders” didn’t add a single new thing to what Paul preached—‘cause God doesn’t care about titles or status."
    },
    {
      "verse": "7",
      "text": "Instead, they saw God had assigned Paul the gospel lane for the uncircumcised (the Gentiles), same way Peter was assigned the circumcised (the Jews)."
    },
    {
      "verse": "8",
      "text": "Same God working power through Peter was also working through Paul."
    },
    {
      "verse": "9",
      "text": "James, Peter, and John—the big three—recognized God’s grace on Paul, gave him and Barnabas the right hand of fellowship, saying, “You hit the Gentiles, we’ll handle the Jews.”"
    },
    {
      "verse": "10",
      "text": "Only one thing they asked: “Don’t forget the poor.” Paul was like, “Bet. Already on it.”"
    },
    {
      "verse": "11",
      "text": "But when Peter came to Antioch, Paul straight-up called him out in public—man was acting sus."
    },
    {
      "verse": "12",
      "text": "Before some Jews from James showed up, Peter was chillin’ and eating with Gentiles. Then when they arrived, he switched up, scared of what the Jewish crew would say."
    },
    {
      "verse": "13",
      "text": "The other Jews started acting fake too—even Barnabas fell for it."
    },
    {
      "verse": "14",
      "text": "Paul saw the hypocrisy and said to Peter in front of everyone, “Yo, if you, a Jew, live like a Gentile, why you forcing Gentiles to live like Jews?”"
    },
    {
      "verse": "15",
      "text": "“We’re Jews by birth, not ‘sinners’ like the Gentiles…”"
    },
    {
      "verse": "16",
      "text": "“But we know no one gets right with God by following the law—only by believing in Jesus Christ. So we believed in Him too, ‘cause the law can’t save nobody.”"
    },
    {
      "verse": "17",
      "text": "“If we’re made right by Christ and still end up sinning, does that mean Christ promotes sin? Nah bro.”"
    },
    {
      "verse": "18",
      "text": "“If I rebuild the same rules I tore down, I’m just proving I’m fake.”"
    },
    {
      "verse": "19",
      "text": "“The law made me realize I was dead spiritually—so now I live for God.”"
    },
    {
      "verse": "20",
      "text": "“I got crucified with Christ. My old self? Gone. Now Christ lives in me. The life I live now, I live by faith in the Son of God who loved me and gave Himself for me.”"
    },
    {
      "verse": "21",
      "text": "“I’m not tossing God’s grace aside. If righteousness could come from following rules, then Christ died for nothing.”"
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, Galatians—who put y’all under a spell, bruh? You literally saw the message of Jesus’ crucifixion loud and clear!"
    },
    {
      "verse": "2",
      "text": "Let’s be real: did you get the Spirit by obeying the law, or by hearing the gospel and believing it?"
    },
    {
      "verse": "3",
      "text": "Y’all really started off with the Spirit and now tryna finish with flesh logic? That’s downgrade behavior."
    },
    {
      "verse": "4",
      "text": "You went through all that for nothing? Hope not."
    },
    {
      "verse": "5",
      "text": "Does God work miracles ‘cause you obey the law, or ‘cause you got faith? Exactly. It’s faith, not flex."
    },
    {
      "verse": "6",
      "text": "Remember Abraham? Man believed God, and that’s what counted as righteousness."
    },
    {
      "verse": "7",
      "text": "So anyone who believes like Abraham is basically his spiritual fam."
    },
    {
      "verse": "8",
      "text": "Scripture already predicted God would bless all nations through faith, not bloodline."
    },
    {
      "verse": "9",
      "text": "That’s why everyone who walks by faith gets the same blessing Abraham did."
    },
    {
      "verse": "10",
      "text": "But anyone depending on law rules is under a curse—‘cause you gotta obey all of it perfectly or else."
    },
    {
      "verse": "11",
      "text": "Facts: no one gets right with God through the law. The righteous live by faith, period."
    },
    {
      "verse": "12",
      "text": "The law ain’t about faith—it’s “do this or die trying.”"
    },
    {
      "verse": "13",
      "text": "Christ freed us from that curse by taking it on Himself—He became the cursed one on that cross."
    },
    {
      "verse": "14",
      "text": "So now, through Jesus, Gentiles get Abraham’s blessing too, and we all receive the Spirit through faith."
    },
    {
      "verse": "15",
      "text": "Listen, fam—human contracts don’t just get edited once they’re confirmed. Same with God’s promise."
    },
    {
      "verse": "16",
      "text": "God made the promise to Abraham and his “Seed”—that “Seed” is Christ, not multiple people."
    },
    {
      "verse": "17",
      "text": "The law came 430 years later; it didn’t cancel the promise God made to Abraham."
    },
    {
      "verse": "18",
      "text": "If inheritance came from the law, then it wouldn’t be a promise. But God gave it to Abraham by promise."
    },
    {
      "verse": "19",
      "text": "So why even bring in the law? It was temporary—to expose sin—until the promised Seed (Christ) came."
    },
    {
      "verse": "20",
      "text": "And yo, a mediator is needed when there’s two sides; but God? He’s one. No middleman energy."
    },
    {
      "verse": "21",
      "text": "So is the law against God’s promises? Nah. It’s just that the law couldn’t give life."
    },
    {
      "verse": "22",
      "text": "Scripture locked everyone up under sin so that only faith in Jesus could set us free."
    },
    {
      "verse": "23",
      "text": "Before faith came, the law was like a babysitter—keeping us in check till Jesus showed up."
    },
    {
      "verse": "24",
      "text": "The law was the tutor showing us our need for Christ so we could be made right by faith."
    },
    {
      "verse": "25",
      "text": "But now that faith is here, we don’t need the tutor no more."
    },
    {
      "verse": "26",
      "text": "You’re all children of God through faith in Christ Jesus."
    },
    {
      "verse": "27",
      "text": "Anyone baptized into Christ has put on Christ—like wearing His jersey full-time."
    },
    {
      "verse": "28",
      "text": "There’s no Jew or Greek, slave or free, male or female—you’re all one in Christ Jesus."
    },
    {
      "verse": "29",
      "text": "And if you belong to Christ, you’re part of Abraham’s fam and heirs of every promise."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "So check this: as long as an heir is still a kid, he got the same status as a servant—even though he technically owns everything."
    },
    {
      "verse": "2",
      "text": "He’s still under guardians and managers till the time his father set."
    },
    {
      "verse": "3",
      "text": "That’s basically us—we were spiritual toddlers under the world’s system, following rules like ABCs."
    },
    {
      "verse": "4",
      "text": "But when the time hit perfectly, God sent His Son—born from a woman, living under the law—"
    },
    {
      "verse": "5",
      "text": "So He could buy our freedom from that law life and make us God’s legit kids."
    },
    {
      "verse": "6",
      "text": "And since we’re His kids, God dropped His Spirit into our hearts—the one that cries, “Abba, Father!”"
    },
    {
      "verse": "7",
      "text": "You’re not a servant anymore, but a son. And if a son, then an heir through God. Royal lineage, no cap."
    },
    {
      "verse": "8",
      "text": "Back then, you didn’t know God and were basically simping for fake gods that weren’t even real."
    },
    {
      "verse": "9",
      "text": "But now that you know God—or rather, that He knows you—why go back to weak and basic rules? That’s regression."
    },
    {
      "verse": "10",
      "text": "You’re stressing over days, months, seasons, and years like it earns you points—nah, that’s outdated religion."
    },
    {
      "verse": "11",
      "text": "I’m lowkey worried I wasted my grind on y’all."
    },
    {
      "verse": "12",
      "text": "Yo, fam, be like me—free. I was once like you. You treated me right before."
    },
    {
      "verse": "13",
      "text": "You remember when I first came through with that sickness? I still preached, and y’all didn’t clown me for it."
    },
    {
      "verse": "14",
      "text": "You treated me like I was an angel—like Jesus Himself pulled up."
    },
    {
      "verse": "15",
      "text": "What happened to that vibe? You’d have even given me your eyes if I needed ‘em."
    },
    {
      "verse": "16",
      "text": "So now I’m the villain ‘cause I tell you truth? Bet."
    },
    {
      "verse": "17",
      "text": "Those fake teachers tryna win y’all over—but not for good reasons. They wanna gatekeep you so you’ll chase them."
    },
    {
      "verse": "18",
      "text": "It’s cool to be passionate, but make sure it’s for the right cause, not just hype when I’m around."
    },
    {
      "verse": "19",
      "text": "My spiritual babies, I’m literally in pain till Christ is fully formed in you."
    },
    {
      "verse": "20",
      "text": "If I could pull up in person, I’d switch my tone ‘cause y’all confusing me, fr."
    },
    {
      "verse": "21",
      "text": "Tell me, you law fans—did you even read what the law says?"
    },
    {
      "verse": "22",
      "text": "Abraham had two sons—one from a slave woman, one from a free woman."
    },
    {
      "verse": "23",
      "text": "The one from the slave was human effort; the one from the free woman was pure promise."
    },
    {
      "verse": "24",
      "text": "This is like a whole metaphor—two covenants. One’s from Mount Sinai (law grind), that’s Hagar."
    },
    {
      "verse": "25",
      "text": "Hagar = Mount Sinai = slavery system = earthly Jerusalem."
    },
    {
      "verse": "26",
      "text": "But the Jerusalem above? That’s freedom. That’s our real home."
    },
    {
      "verse": "27",
      "text": "It’s written: “The barren woman will have more kids than the one who had it all.”"
    },
    {
      "verse": "28",
      "text": "So fam, we’re children of promise like Isaac—not rule-bound slaves."
    },
    {
      "verse": "29",
      "text": "But just like then, the one born of the flesh beefed with the one born of the Spirit—same now."
    },
    {
      "verse": "30",
      "text": "Scripture says: “Kick the slave woman and her son out.” Why? ‘Cause the slave’s son ain’t inheriting with the free one."
    },
    {
      "verse": "31",
      "text": "So we’re not kids of the slave woman, but of the free. Free born. Covenant of grace."
    }]},
    {
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "Christ set us free — so stay free. Don’t go back to that law-slave lifestyle."
    },
    {
      "verse": "2",
      "text": "Paul here — if you start relying on circumcision to be saved, Jesus’ death won’t mean squat for you."
    },
    {
      "verse": "3",
      "text": "I’ll say it again: if you choose that path, you gotta keep every law perfectly. No slip-ups allowed."
    },
    {
      "verse": "4",
      "text": "That means you ditched grace and tried to earn it — spoiler: that don’t work."
    },
    {
      "verse": "5",
      "text": "But we, through the Spirit, wait on righteousness by faith — not flexing rules, but trusting Jesus."
    },
    {
      "verse": "6",
      "text": "In Christ, circumcised or not don’t matter. What counts is faith that moves through love."
    },
    {
      "verse": "7",
      "text": "Y’all were running smooth — who tripped you up from obeying truth?"
    },
    {
      "verse": "8",
      "text": "That pressure ain’t from God, I’ll tell you that."
    },
    {
      "verse": "9",
      "text": "A little false teaching spreads fast — like yeast in dough. Corrupts the whole batch."
    },
    {
      "verse": "10",
      "text": "I trust the Lord that you’ll get this right. But whoever’s causing this drama? They’ll face the smoke."
    },
    {
      "verse": "11",
      "text": "And if I were still preaching circumcision, why would I still be getting dragged? The cross offends fake religion, that’s why."
    },
    {
      "verse": "12",
      "text": "Honestly, if those false teachers love cutting people, they might as well go all the way — yikes."
    },
    {
      "verse": "13",
      "text": "You were called to freedom, fam — but don’t use that as an excuse to wild out. Serve each other in love instead."
    },
    {
      "verse": "14",
      "text": "The whole law’s summed up like this: Love your neighbor like yourself."
    },
    {
      "verse": "15",
      "text": "But if you keep biting and shading each other, you’ll just eat yourselves alive."
    },
    {
      "verse": "16",
      "text": "Walk by the Spirit and you won’t fall for the flesh’s cravings."
    },
    {
      "verse": "17",
      "text": "The flesh wants one thing, the Spirit another — constant beef, so you don’t just do whatever you feel."
    },
    {
      "verse": "18",
      "text": "But if you’re led by the Spirit, the law ain’t boss over you anymore."
    },
    {
      "verse": "19",
      "text": "The flesh’s works are obvious — stuff like lust, impurity, bad vibes,"
    },
    {
      "verse": "20",
      "text": "Idolatry, witchcraft, drama, jealousy, rage, beef, selfish ambition, division,"
    },
    {
      "verse": "21",
      "text": "Envy, drunkenness, wild parties — you get it. Those who keep living like that won’t touch the Kingdom."
    },
    {
      "verse": "22",
      "text": "But the Spirit? His fruit’s different: love, joy, peace, patience, kindness, goodness, faithfulness,"
    },
    {
      "verse": "23",
      "text": "Gentleness, and self-control. No law can block that energy."
    },
    {
      "verse": "24",
      "text": "The ones who belong to Christ already nailed their fleshly cravings to the cross — it’s dead."
    },
    {
      "verse": "25",
      "text": "Since we live by the Spirit, let’s walk like it — consistent vibe."
    },
    {
      "verse": "26",
      "text": "Don’t get cocky, don’t flex, don’t envy each other"
    }]},
    {
  "chapter": "6",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, if someone slips up while walking in truth, you Spirit-led folks gotta restore them gently. Watch yourself too — don’t get dragged by temptation."
    },
    {
      "verse": "2",
      "text": "Carry each other’s burdens — that’s how you live out Christ’s law."
    },
    {
      "verse": "3",
      "text": "If you think you’re flexing, but really you’re fooling yourself, that’s peak delusion."
    },
    {
      "verse": "4",
      "text": "Everyone checks their own work — then they can flex with confidence, no comparing."
    },
    {
      "verse": "5",
      "text": "Each person handles their own load, but still, support the crew where needed."
    },
    {
      "verse": "6",
      "text": "Share resources with your teachers—those preaching the Word deserve a solid bag."
    },
    {
      "verse": "7",
      "text": "Don’t be fooled: God isn’t mocked. Whatever you sow, you’ll harvest. Plant selfishness, get chaos. Plant Spirit, get life."
    },
    {
      "verse": "8",
      "text": "Those chasing flesh reap death; those chasing Spirit reap eternal life."
    },
    {
      "verse": "9",
      "text": "Don’t get lazy. Keep doing good. In time, if you don’t quit, you’ll harvest big."
    },
    {
      "verse": "10",
      "text": "So while you can, hit up everyone with love, especially the family of believers."
    },
    {
      "verse": "11",
      "text": "Check it — big letters, because I wrote this part myself, just to flex authenticity."
    },
    {
      "verse": "12",
      "text": "Those tryna make circumcision look necessary? They’re flexing for applause, not faith. They want you to do all the work, so they can claim glory."
    },
    {
      "verse": "13",
      "text": "Me? I don’t even flex with circumcision. I only remember the cross of Jesus — that’s the ultimate drip. Everything else is dust."
    },
    {
      "verse": "14",
      "text": "God forbid I boast about anything else but the cross. That cross? World is dead to me, me to the world."
    },
    {
      "verse": "15",
      "text": "No matter circumcision or not — what counts is being a new creation. That’s the real glow-up."
    },
    {
      "verse": "16",
      "text": "Peace and mercy to everyone who walks by this rule, to God’s Israel."
    },
    {
      "verse": "17",
      "text": "From now on, no one give me grief. I carry the scars of Jesus on my body — I wear them like badges of honor."
    },
    {
      "verse": "18",
      "text": "Grace from our Lord Jesus Christ be with your spirit, squad. Amen." }]}]}   