{
  "book": "Genesis",
  "chapters": [
   {
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "At first, God was like, “Let’s get this universe popping,” and the earth was a total chaos—dark, empty, and floating in the void, while God’s energy hovered over the waters."
    },
    {
      "verse": "2",
      "text": "Then God said, “Let there be light,” and boom—light appeared."
    },
    {
      "verse": "3",
      "text": "God saw the light was fire-level good, and He separated it from the darkness."
    },
    {
      "verse": "4",
      "text": "God called the light “Day” and the darkness “Night.” And just like that, Day 1 happened."
    },
    {
      "verse": "5",
      "text": "God was vibing with His creation and saw it was good. Night ended, Day started—Day 1 complete."
    },
    {
      "verse": "6",
      "text": "God said, “Let’s get some sky up here to separate the waters.”"
    },
    {
      "verse": "7",
      "text": "So He made the sky to split the waters above from the waters below."
    },
    {
      "verse": "8",
      "text": "God called the sky “Heaven.” Evening passed, morning came—Day 2."
    },
    {
      "verse": "9",
      "text": "God said, “Water, gather up into one spot, and let dry land show itself.” And it happened."
    },
    {
      "verse": "10",
      "text": "God called the dry land “Earth” and the water “Seas.” God was hyped about how good it looked."
    },
    {
      "verse": "11",
      "text": "Then God said, “Earth, let’s get some plants going—grasses, herbs, trees that drop fruit.” And the earth delivered."
    },
    {
      "verse": "12",
      "text": "Plants started growing, each making seeds and fruit according to its kind. God saw it was top-tier good."
    },
    {
      "verse": "13",
      "text": "Evening passed, morning came—Day 3."
    },
    {
      "verse": "14",
      "text": "God said, “Let’s have lights in the sky to separate day from night, and to mark time—days, seasons, years.”"
    },
    {
      "verse": "15",
      "text": "“They’ll light up the earth,” God added."
    },
    {
      "verse": "16",
      "text": "So God made two major lights: the big one for the day (Sun) and the smaller one for the night (Moon). He also made stars."
    },
    {
      "verse": "17",
      "text": "God put them all in the sky to light the earth, rule over day and night, and separate light from darkness."
    },
    {
      "verse": "18",
      "text": "God saw it was vibes—super good."
    },
    {
      "verse": "19",
      "text": "Evening passed, morning came—Day 4."
    },
    {
      "verse": "20",
      "text": "God said, “Water, start teaming up with creatures—fish, whales, everything that swims. Sky, fill up with birds.” And it happened."
    },
    {
      "verse": "21",
      "text": "God blessed them, saying, “Be fruitful, multiply, and fill the seas; birds, go global—spread out.”"
    },
    {
      "verse": "22",
      "text": "God saw it was fire-level good."
    },
    {
      "verse": "23",
      "text": "Evening passed, morning came—Day 5."
    },
    {
      "verse": "24",
      "text": "God said, “Earth, produce living creatures: livestock, wild animals, and crawling things.” And the earth delivered, each according to its type."
    },
    {
      "verse": "25",
      "text": "God saw it was good."
    },
    {
      "verse": "26",
      "text": "Then God was like, “Let’s make humans in our image—like us—and give them the reign over everything: fish, birds, animals, earth.”"
    },
    {
      "verse": "27",
      "text": "So God made humans in His image—male and female."
    },
    {
      "verse": "28",
      "text": "God blessed them, saying, “Multiply, fill the earth, take charge, and vibe with the planet. Rule the fish, birds, and every living creature.”"
    },
    {
      "verse": "29",
      "text": "God said, “Here’s your menu: every seed-bearing plant and fruit tree is yours to eat.”"
    },
    {
      "verse": "30",
      "text": "“All green plants are food for the animals,” He added. God saw it was mega good."
    },
    {
      "verse": "31",
      "text": "Day 6 check-in: God looked at everything He made and was like, “Okay, this is top-tier, no cap—everything is perfect.”"
    }]},
{
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "So, when God finished setting up the whole universe,"
    },
    {
      "verse": "2",
      "text": "He took a chill moment and rested on the seventh day from all the work He’d done."
    },
    {
      "verse": "3",
      "text": "God blessed the seventh day and made it special because that’s when He paused from creating everything."
    },
    {
      "verse": "4",
      "text": "Here’s the story of how the heavens and the earth came together when they first started: when God made the earth and sky,"
    },
    {
      "verse": "5",
      "text": "No shrubs or plants had popped up yet because He hadn’t made it rain, and there was no human to work the land."
    },
    {
      "verse": "6",
      "text": "But streams were rising from the ground, watering the whole planet."
    },
    {
      "verse": "7",
      "text": "Then God shaped a human out of the dust and breathed life into him—so now he was a living being."
    },
    {
      "verse": "8",
      "text": "God planted a garden eastward in Eden, and He put the human there to live in it."
    },
    {
      "verse": "9",
      "text": "The garden had all sorts of fire-level fruit trees for looks and for snacking, plus the tree of life and the tree that could get you in trouble if you ate from it."
    },
    {
      "verse": "10",
      "text": "A river ran through Eden to water the garden, splitting into four main rivers."
    },
    {
      "verse": "11",
      "text": "The first one is called Pishon—it circles the land where gold is at, and the gold there is super nice."
    },
    {
      "verse": "12",
      "text": "There’s also bdellium and onyx stones in that area."
    },
    {
      "verse": "13",
      "text": "The second river is called Gihon—it wraps around the land called Cush."
    },
    {
      "verse": "14",
      "text": "The third is Tigris, flowing east of Assyria. The fourth is the Euphrates."
    },
    {
      "verse": "15",
      "text": "God put the human in the garden to keep it and take care of it."
    },
    {
      "verse": "16",
      "text": "He told him, “Eat freely from any tree you want,"
    },
    {
      "verse": "17",
      "text": "but don’t eat from the tree of knowledge of good and bad, because if you do, it’s game over—you’ll die for real.”"
    },
    {
      "verse": "18",
      "text": "God said, “It’s not good for humans to be solo. I’ll make a helper who’s vibing with you.”"
    },
    {
      "verse": "19",
      "text": "God formed all the animals and birds and brought them to the human to see what he’d call them. Whatever he called each, that was their name."
    },
    {
      "verse": "20",
      "text": "The human named all the livestock, birds, and wild animals, but no one matched him perfectly."
    },
    {
      "verse": "21",
      "text": "So God made him a deep sleep, took one of his ribs, and made a woman from it."
    },
    {
      "verse": "22",
      "text": "God brought her to the human, and he was like, “Finally! This one actually gets me.”"
    },
    {
      "verse": "23",
      "text": "That’s why a man leaves his parents, sticks with his partner, and they’re tight as one."
    },
    {
      "verse": "24",
      "text": "They’re one team now—fused physically and emotionally."
    },
    {
      "verse": "25",
      "text": "Back then, they were both naked and totally unbothered—zero shame, totally at peace."
    }]},

  {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Now the serpent was the sneakiest creature the LORD God had made. It slid up to the woman and said, “So, did God really say you can’t eat from any tree in the garden?”"
    },
    {
      "verse": "2",
      "text": "The woman said, “We can eat fruit from the trees,"
    },
    {
      "verse": "3",
      "text": "but there’s this one in the middle — God said, ‘Don’t eat it, don’t even touch it, or you’ll die.’”"
    },
    {
      "verse": "4",
      "text": "The serpent said, “You won’t die."
    },
    {
      "verse": "5",
      "text": "God just knows that when you eat it, your eyes will open up, and you’ll be like God — knowing good and evil.”"
    },
    {
      "verse": "6",
      "text": "The woman saw the tree looked good for food, pretty to look at, and seemed like a shortcut to wisdom. She took the fruit and ate it. Then she gave some to her man, who was with her, and he ate too."
    },
    {
      "verse": "7",
      "text": "Instantly, their eyes opened — and boom, they realized they were naked. Panic mode. They stitched fig leaves together to make makeshift outfits."
    },
    {
      "verse": "8",
      "text": "Later, they heard the sound of the LORD God walking in the garden during the cool part of the day. They dipped — hid among the trees."
    },
    {
      "verse": "9",
      "text": "God called out, “Where you at?”"
    },
    {
      "verse": "10",
      "text": "Adam said, “I heard You walking, and I got scared ’cause I was naked, so I hid.”"
    },
    {
      "verse": "11",
      "text": "God said, “Who told you that you were naked? Did you eat from the tree I told you not to touch?”"
    },
    {
      "verse": "12",
      "text": "The man said, “The woman You gave me — she gave me the fruit, and I ate.”"
    },
    {
      "verse": "13",
      "text": "Then the LORD said to the woman, “What did you do?” She said, “The serpent tricked me — that’s why I ate.”"
    },
    {
      "verse": "14",
      "text": "The LORD God said to the serpent: “Because you pulled this stunt, you’re cursed more than any animal. You’ll crawl on your belly and eat dust all your life."
    },
    {
      "verse": "15",
      "text": "And I’ll make beef between you and the woman, between your kids and hers — her offspring will crush your head, and you’ll strike his heel.”"
    },
    {
      "verse": "16",
      "text": "To the woman He said: “You’ll have pain bringing life into the world, and you’ll long for your husband — but he’ll lead the way.”"
    },
    {
      "verse": "17",
      "text": "To Adam He said: “Because you listened to your wife and ate what I said not to, the ground’s cursed because of you. You’ll struggle to eat from it all your life."
    },
    {
      "verse": "18",
      "text": "It’ll grow thorns and weeds, but you’ll still be grinding to get your bread."
    },
    {
      "verse": "19",
      "text": "You’ll sweat to survive until you go back to the dirt — ‘cause that’s where you came from.”"
    },
    {
      "verse": "20",
      "text": "Adam named his wife Eve, meaning “life,” because she’d be the mother of all humans."
    },
    {
      "verse": "21",
      "text": "Then God made clothes from animal skins for Adam and Eve — real protection, not fig-leaf DIYs."
    },
    {
      "verse": "22",
      "text": "The LORD said, “Humans now know good and evil, like Us. They can’t stay here and reach for the tree of life too.”"
    },
    {
      "verse": "23",
      "text": "So God sent them out from the garden to work the ground they came from."
    },
    {
      "verse": "24",
      "text": "And He posted heavenly guards — cherubim with a flashing sword — to block the way to the tree of life."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "Adam and Eve had their first kid — a son named Cain. Eve said, “With God’s help, I brought a man into the world.”"
    },
    {
      "verse": "2",
      "text": "Then she had another son — Abel. Abel grew up tending sheep, and Cain worked the fields."
    },
    {
      "verse": "3",
      "text": "One day, Cain pulled up an offering to God from his harvest."
    },
    {
      "verse": "4",
      "text": "Abel brought his offering too — the best parts from the firstborn of his flock. God was cool with Abel’s gift,"
    },
    {
      "verse": "5",
      "text": "but He didn’t vibe with Cain’s. Cain got heated — face all down, energy off."
    },
    {
      "verse": "6",
      "text": "God said, “Why you mad? Why’s your face dropped?"
    },
    {
      "verse": "7",
      "text": "If you do what’s right, won’t you be accepted? But if you don’t, sin’s crouching at your door — it wants to control you, but you gotta be the one running the show.”"
    },
    {
      "verse": "8",
      "text": "Later, Cain told Abel, “Let’s go out to the field.” When they were out there, Cain attacked his brother Abel — and killed him."
    },
    {
      "verse": "9",
      "text": "Then God said, “Cain, where’s your brother?” Cain said, “Uh… I don’t know. Am I my brother’s babysitter?”"
    },
    {
      "verse": "10",
      "text": "God said, “What have you done? Your brother’s blood is crying out to Me from the ground!”"
    },
    {
      "verse": "11",
      "text": "“Now you’re cursed — the ground itself won’t back you anymore."
    },
    {
      "verse": "12",
      "text": "When you farm, it won’t produce like before. You’ll be a wanderer, drifting place to place.”"
    },
    {
      "verse": "13",
      "text": "Cain said, “That’s too much, God! My punishment’s heavier than I can handle."
    },
    {
      "verse": "14",
      "text": "You’re driving me away from the land and from You. Anyone who finds me will want me gone.”"
    },
    {
      "verse": "15",
      "text": "But God said, “Not happening. If anyone touches Cain, they’ll face it seven times worse.” Then God put a mark on Cain so no one would mess with him."
    },
    {
      "verse": "16",
      "text": "So Cain left God’s presence and settled east of Eden, in a place called Nod."
    },
    {
      "verse": "17",
      "text": "Cain and his wife had a son named Enoch, and Cain built a city — named it after his son."
    },
    {
      "verse": "18",
      "text": "Enoch had Irad, Irad had Mehujael, Mehujael had Methushael, and Methushael had Lamech."
    },
    {
      "verse": "19",
      "text": "Lamech had two wives — Adah and Zillah."
    },
    {
      "verse": "20",
      "text": "Adah’s son was Jabal — he started the whole “living-in-tents and raising animals” lifestyle."
    },
    {
      "verse": "21",
      "text": "His brother Jubal invented instruments — harps and flutes."
    },
    {
      "verse": "22",
      "text": "Zillah’s son was Tubal-Cain, the first metalworker, making tools from bronze and iron. His sister was Naamah."
    },
    {
      "verse": "23",
      "text": "One day, Lamech said to his wives: “Adah, Zillah, listen up. I took someone out for hitting me — a young guy for bruising me."
    },
    {
      "verse": "24",
      "text": "If Cain was avenged seven times, then Lamech’s revenge would be seventy-seven times.” (Yeah, Lamech was really in his villain arc.)"
    },
    {
      "verse": "25",
      "text": "Adam and Eve had another son, named Seth, because Eve said, “God’s given me another child instead of Abel, since Cain took him out.”"
    },
    {
      "verse": "26",
      "text": "Seth had a son named Enosh. That’s when people started calling on the name of the LORD again — revival vibes."
    }]},
   {
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "This is the roll call of Adam’s fam. When God made humans, He created them to reflect His vibe — His own image."
    },
    {
      "verse": "2",
      "text": "He made them male and female, blessed them up, and called them human when they were created."
    },
    {
      "verse": "3",
      "text": "When Adam was 130 years old (yeah, long life energy), he had a son in his own image and named him Seth."
    },
    {
      "verse": "4",
      "text": "After Seth was born, Adam kept living for 800 more years and had more sons and daughters."
    },
    {
      "verse": "5",
      "text": "Adam clocked out at 930 years old — and then he was gone."
    },
    {
      "verse": "6",
      "text": "When Seth was 105, he had a son named Enosh."
    },
    {
      "verse": "7",
      "text": "Seth lived 807 more years and had more kids."
    },
    {
      "verse": "8",
      "text": "He lived 912 years total, then passed."
    },
    {
      "verse": "9",
      "text": "Enosh was 90 when he had Kenan."
    },
    {
      "verse": "10",
      "text": "After that, he lived 815 more years, had more kids,"
    },
    {
      "verse": "11",
      "text": "and dipped at 905."
    },
    {
      "verse": "12",
      "text": "Kenan was 70 when he had Mahalalel."
    },
    {
      "verse": "13",
      "text": "He lived 840 more years with more kids,"
    },
    {
      "verse": "14",
      "text": "and wrapped up at 910."
    },
    {
      "verse": "15",
      "text": "Mahalalel was 65 when he had Jared."
    },
    {
      "verse": "16",
      "text": "He lived 830 more years with more kids,"
    },
    {
      "verse": "17",
      "text": "and finished at 895."
    },
    {
      "verse": "18",
      "text": "Jared was 162 when he had Enoch."
    },
    {
      "verse": "19",
      "text": "He lived 800 more years, had more kids,"
    },
    {
      "verse": "20",
      "text": "and closed his run at 962."
    },
    {
      "verse": "21",
      "text": "Enoch was 65 when he had Methuselah."
    },
    {
      "verse": "22",
      "text": "Enoch walked faithfully with God for 300 more years and had more kids."
    },
    {
      "verse": "23",
      "text": "He lived 365 years total — short compared to the others, but listen:"
    },
    {
      "verse": "24",
      "text": "Enoch was vibing so close with God that one day — poof — he was just gone. God took him straight up. No death, just divine teleport."
    },
    {
      "verse": "25",
      "text": "Methuselah was 187 when he had Lamech."
    },
    {
      "verse": "26",
      "text": "He lived 782 more years, had more kids,"
    },
    {
      "verse": "27",
      "text": "and wrapped at 969 years — the oldest to ever do it."
    },
    {
      "verse": "28",
      "text": "Lamech was 182 when he had a son."
    },
    {
      "verse": "29",
      "text": "He named him Noah, saying, “This one’s gonna bring us comfort from all the stress and grind that came from the cursed ground.”"
    },
    {
      "verse": "30",
      "text": "Lamech lived 595 more years, had more kids,"
    },
    {
      "verse": "31",
      "text": "and ended at 777."
    },
    {
      "verse": "32",
      "text": "When Noah was 500 years old, he had Shem, Ham, and Japheth — the trio who’d carry the story into the flood era."
    }]},
    {
  "chapter": "6",
  "verses": [
    {
      "verse": "1",
      "text": "As people started filling up the world and having daughters,"
    },
    {
      "verse": "2",
      "text": "the sons of God saw how fine the daughters of humans were and said, “Yeah, we’re tryna wife up.” So they picked whoever they wanted and married them."
    },
    {
      "verse": "3",
      "text": "Then the LORD said, “Humans are doing too much. I’m not letting My Spirit stay with them forever — they’re just flesh. I’ll cap their lifespan at 120 years.”"
    },
    {
      "verse": "4",
      "text": "Back then (and even after), there were some legendary giants on earth — real big names. When the sons of God had kids with human women, their children became the OG heroes everyone talked about."
    },
    {
      "verse": "5",
      "text": "But then God saw that humanity had fully lost the plot — every thought, every idea, all evil, all day."
    },
    {
      "verse": "6",
      "text": "That broke God’s heart. He legit regretted making humans."
    },
    {
      "verse": "7",
      "text": "So the LORD said, “I’m wiping out humans, animals, birds — everything. I’m done.”"
    },
    {
      "verse": "8",
      "text": "But Noah found favor — God looked at him and said, “He’s different.”"
    },
    {
      "verse": "9",
      "text": "Here’s Noah’s story: Noah was a real one — righteous, solid, and walking with God when everyone else was wildin’."
    },
    {
      "verse": "10",
      "text": "He had three sons: Shem, Ham, and Japheth."
    },
    {
      "verse": "11",
      "text": "The earth was absolutely corrupted in God’s eyes — violence everywhere."
    },
    {
      "verse": "12",
      "text": "God looked and saw it for Himself: total mess. Humanity had completely glitched out."
    },
    {
      "verse": "13",
      "text": "So God said to Noah, “The end of humanity’s coming. Everyone’s gone violent, and I’m ending this.”"
    },
    {
      "verse": "14",
      "text": "“Build yourself an ark — big boat made of cypress wood. Make rooms inside, seal it up with pitch inside and out.”"
    },
    {
      "verse": "15",
      "text": "“Here’s the blueprint: 450 feet long, 75 feet wide, 45 feet tall.”"
    },
    {
      "verse": "16",
      "text": "“Add a roof with space for light near the top. Put a door on the side and make it with three floors — lower, middle, and upper decks.”"
    },
    {
      "verse": "17",
      "text": "“I’m bringing a flood to wipe out everything that breathes under heaven. The earth’s gonna get reset.”"
    },
    {
      "verse": "18",
      "text": "“But I’m making a covenant with you. You’ll go in the ark — you, your sons, your wife, and your sons’ wives.”"
    },
    {
      "verse": "19",
      "text": "“Bring two of every creature — male and female — so they can stay alive with you.”"
    },
    {
      "verse": "20",
      "text": "“Birds, animals, and ground creatures — two of each kind will pull up automatically.”"
    },
    {
      "verse": "21",
      "text": "“And grab enough food for everyone — you and them.”"
    },
    {
      "verse": "22",
      "text": "Noah did exactly what God told him — no edits, no shortcuts, just full obedience."
    }]},
    {
  "chapter": "7",
  "verses": [
    {
      "verse": "1",
      "text": "Then the LORD told Noah, “Yo, you’re the real one in this whole generation. Slide into the ark — you and your whole fam.”"
    },
    {
      "verse": "2",
      "text": "“Bring seven pairs of every clean animal (male and female), and one pair of every not-so-clean animal.”"
    },
    {
      "verse": "3",
      "text": "“Also, seven pairs of every bird, so the species keep going when this is all over.”"
    },
    {
      "verse": "4",
      "text": "“In just seven days, I’m dropping rain for forty days and forty nights. Everything that’s breathing on earth — gone. For real.”"
    },
    {
      "verse": "5",
      "text": "Noah did everything God told him — no skipping, no tweaking."
    },
    {
      "verse": "6",
      "text": "He was six-hundred years old when the flood hit (ancient but still obedient)."
    },
    {
      "verse": "7",
      "text": "Noah, his sons, his wife, and his sons’ wives entered the ark to dodge the flood."
    },
    {
      "verse": "8",
      "text": "Clean animals, unclean animals, birds, and all land creatures came along."
    },
    {
      "verse": "9",
      "text": "Two by two they pulled up to Noah in the ark — exactly like God planned."
    },
    {
      "verse": "10",
      "text": "Seven days later, boom — the floodwaters dropped from the sky."
    },
    {
      "verse": "11",
      "text": "In the six-hundredth year of Noah’s life, second month, seventeenth day — total chaos. The underground waters burst open, and the skies opened their floodgates."
    },
    {
      "verse": "12",
      "text": "Rain fell for forty straight days and nights — zero breaks."
    },
    {
      "verse": "13",
      "text": "On that very day, Noah and his whole fam walked into the ark — Shem, Ham, Japheth, their wives — the whole crew."
    },
    {
      "verse": "14",
      "text": "Every wild animal, livestock, crawler, and bird came too."
    },
    {
      "verse": "15",
      "text": "Every breathing creature rolled up to Noah."
    },
    {
      "verse": "16",
      "text": "Two by two of every living thing entered, just like God told him. Then the LORD Himself locked the door — sealed deal."
    },
    {
      "verse": "17",
      "text": "For forty days, rain went full send on the earth. The waters rose and lifted the ark higher and higher, so it floated above everything."
    },
    {
      "verse": "18",
      "text": "The flood kept rising — no land in sight — and the ark cruised along like a boat on an endless ocean."
    },
    {
      "verse": "19",
      "text": "Water covered all the high mountains under the whole sky."
    },
    {
      "verse": "20",
      "text": "The water stacked up about twenty-two feet above the peaks — that’s crazy deep."
    },
    {
      "verse": "21",
      "text": "Everything that breathed on land died — birds, animals, humans, all of it."
    },
    {
      "verse": "22",
      "text": "Every living thing that had breath in its nose was gone."
    },
    {
      "verse": "23",
      "text": "God cleared out every creature from the earth — people, animals, crawlers, birds — all wiped. Only Noah and those in the ark stayed alive."
    },
    {
      "verse": "24",
      "text": "And the waters ruled the earth for a hundred and fifty days straight."
    }]},
{
  "chapter": "8",
  "verses": [
    {
      "verse": "1",
      "text": "Then God remembered Noah and everyone with him on the ark. He sent a big wind across the earth, and the floodwaters started to chill out."
    },
    {
      "verse": "2",
      "text": "The underground springs and sky leaks got turned off. The rain that had been pouring for days finally said, “I’m out.”"
    },
    {
      "verse": "3",
      "text": "The water started pulling back bit by bit, and after 150 days, the flood was done doing the most."
    },
    {
      "verse": "4",
      "text": "The ark came to rest on the mountains of Ararat — like, it finally parked."
    },
    {
      "verse": "5",
      "text": "As time went on, the water kept dropping until the mountaintops started peeking through."
    },
    {
      "verse": "6",
      "text": "After forty more days, Noah opened a window on the ark — the first fresh-air moment in forever."
    },
    {
      "verse": "7",
      "text": "He sent out a raven, and it just kept flying around until the earth was dry again."
    },
    {
      "verse": "8",
      "text": "Then Noah tried again, this time with a dove, to see if the flood had finally stopped gatekeeping land."
    },
    {
      "verse": "9",
      "text": "The dove came back because it couldn’t find a chill place to land — too much water still everywhere. So Noah pulled it back in, like, “not yet, lil buddy.”"
    },
    {
      "verse": "10",
      "text": "He waited seven more days and sent the dove again."
    },
    {
      "verse": "11",
      "text": "That evening, the dove came back with a fresh olive leaf — major W. Noah knew the earth was finally starting to recover."
    },
    {
      "verse": "12",
      "text": "He waited another seven days and sent the dove again, but this time it didn’t come back — like, it found its own spot now."
    },
    {
      "verse": "13",
      "text": "By the first day of the first month of Noah’s six-hundred-and-first year (yeah, he’s ancient but still thriving), the water was gone from the land. Noah lifted the cover of the ark and saw dry ground — finally!"
    },
    {
      "verse": "14",
      "text": "By the second month, the 27th day, the land was fully dry."
    },
    {
      "verse": "15",
      "text": "Then God said to Noah,"
    },
    {
      "verse": "16",
      "text": "“Aight, time to step out — you, your fam, and every living thing with you.”"
    },
    {
      "verse": "17",
      "text": "“Let the animals go out too, so they can repopulate and vibe across the earth again.”"
    },
    {
      "verse": "18",
      "text": "So Noah stepped out with his wife, his sons, and their wives."
    },
    {
      "verse": "19",
      "text": "All the animals, birds, and creatures bounced out of the ark too — like a massive post-flood roll call."
    },
    {
      "verse": "20",
      "text": "Then Noah built an altar for God and offered some of the clean animals and birds as a thank-offering."
    },
    {
      "verse": "21",
      "text": "God smelled the offering and said in His heart, “Never again will I curse the ground because of humans, even though they keep doing wild stuff. I won’t wipe out everything like that again.”"
    },
    {
      "verse": "22",
      "text": "And God said, “As long as the earth keeps spinning — there’ll be planting and harvest, cold and heat, summer and winter, day and night — they’re not going anywhere.”"
    }]},
  {
  "chapter": "9",
  "verses": [
    {
      "verse": "1",
      "text": "God blessed Noah and his sons, saying, “Go off, have a ton of kids, and fill the whole Earth with your vibe."
    },
    {
      "verse": "2",
      "text": "Every animal, bird, and creature out there—they’re all gonna respect you. You’re in charge now."
    },
    {
      "verse": "3",
      "text": "Everything that moves and lives is yours to eat—just like I gave you plants, now you get the whole menu."
    },
    {
      "verse": "4",
      "text": "But don’t eat meat with the blood still in it—that’s where the life is. Keep it sacred."
    },
    {
      "verse": "5",
      "text": "And if someone takes a human life—whether by human or animal—they’re gonna answer for it."
    },
    {
      "verse": "6",
      "text": "Whoever takes a life, their life is on the line—because humans are made in God’s image. That’s how serious this is."
    },
    {
      "verse": "7",
      "text": "Now go, have big families, spread out, and fill the Earth with your legacy."
    },
    {
      "verse": "8",
      "text": "Then God said to Noah and his sons,"
    },
    {
      "verse": "9",
      "text": "“I’m making a permanent promise with you and your future generations—"
    },
    {
      "verse": "10",
      "text": "and with every living thing that came out of the ark with you: birds, animals, everything."
    },
    {
      "verse": "11",
      "text": "I’m locking this in: never again will a flood wipe out all life or destroy the whole Earth.”"
    },
    {
      "verse": "12",
      "text": "And God said, “This is the sign of the promise I’m making with you and every living creature, forever:"
    },
    {
      "verse": "13",
      "text": "I’m putting my rainbow in the clouds. It’s the receipt of my covenant with the Earth."
    },
    {
      "verse": "14",
      "text": "Whenever I bring clouds and the rainbow appears,"
    },
    {
      "verse": "15",
      "text": "I’ll remember my promise: never again a flood to destroy all life."
    },
    {
      "verse": "16",
      "text": "When that rainbow shows up, I see it and remember the forever deal between me and every living thing on Earth.”"
    },
    {
      "verse": "17",
      "text": "God told Noah, “That rainbow is the sign of the covenant I’ve made with every living creature on the planet.”"
    },
    {
      "verse": "18",
      "text": "The sons of Noah who came out of the ark were Shem, Ham, and Japheth. (Ham was the father of Canaan.)"
    },
    {
      "verse": "19",
      "text": "These three sons of Noah spread out and populated the whole Earth."
    },
    {
      "verse": "20",
      "text": "Noah started farming and planted a vineyard."
    },
    {
      "verse": "21",
      "text": "He drank some of the wine, got totally out of it, and ended up passed out and exposed in his tent."
    },
    {
      "verse": "22",
      "text": "Ham, Canaan’s father, saw his dad like that and went and told his brothers outside."
    },
    {
      "verse": "23",
      "text": "But Shem and Japheth took a cloak, put it over their shoulders, walked in backwards, and covered their dad without looking at him."
    },
    {
      "verse": "24",
      "text": "When Noah woke up and realized what his youngest son had done,"
    },
    {
      "verse": "25",
      "text": "he said, “Cursed be Canaan! He’ll serve his brothers forever.”"
    },
    {
      "verse": "26",
      "text": "He also said, “Praise the Lord, the God of Shem! May Canaan serve Shem.”"
    },
    {
      "verse": "27",
      "text": "“May God expand Japheth’s territory; let him live in Shem’s space, and may Canaan serve him.”"
    },
    {
      "verse": "28",
      "text": "After the flood, Noah lived 350 more years."
    },
    {
      "verse": "29",
      "text": "Noah lived a total of 950 years, and then he passed away."
    }]},
{
  "chapter": "10",
  "verses": [
    {
      "verse": "1",
      "text": "This right here is the fam tree of Noah’s sons — Shem, Ham, and Japheth. After the flood, their kids started repopulating the whole earth."
    },
    {
      "verse": "2",
      "text": "Japheth’s squad: Gomer, Magog, Madai, Javan, Tubal, Meshek, and Tiras."
    },
    {
      "verse": "3",
      "text": "Gomer’s kids: Ashkenaz, Riphath, and Togarmah."
    },
    {
      "verse": "4",
      "text": "Javan’s kids: Elishah, Tarshish, Kittim, and Dodanim."
    },
    {
      "verse": "5",
      "text": "From them came all the coastland nations — people spreading out by clans, languages, and lands."
    },
    {
      "verse": "6",
      "text": "Ham’s squad: Cush, Egypt, Put, and Canaan."
    },
    {
      "verse": "7",
      "text": "Cush’s kids: Seba, Havilah, Sabtah, Raamah, and Sabteka. Raamah’s kids: Sheba and Dedan."
    },
    {
      "verse": "8",
      "text": "Cush had Nimrod — this guy was the first real empire builder, a mighty warrior on earth."
    },
    {
      "verse": "9",
      "text": "People even said, “Like Nimrod, the strong hunter under the Lord’s eyes.”"
    },
    {
      "verse": "10",
      "text": "His kingdom started with Babel, Erech, Akkad, and Calneh — all in Shinar."
    },
    {
      "verse": "11",
      "text": "From there, he rolled out and built Nineveh, Rehoboth Ir, Calah,"
    },
    {
      "verse": "12",
      "text": "and Resen — that’s between Nineveh and Calah. Dude was a born city-builder."
    },
    {
      "verse": "13",
      "text": "Egypt’s descendants: the Ludites, Anamites, Lehabites, Naphtuhites,"
    },
    {
      "verse": "14",
      "text": "Pathrusites, Casluhites (where the Philistines came from), and the Caphtorites."
    },
    {
      "verse": "15",
      "text": "Canaan’s descendants: Sidon (his firstborn), then Heth,"
    },
    {
      "verse": "16",
      "text": "plus the Jebusites, Amorites, Girgashites,"
    },
    {
      "verse": "17",
      "text": "Hivites, Arkites, Sinites,"
    },
    {
      "verse": "18",
      "text": "Arvadites, Zemarites, and Hamathites. Later, the Canaanite tribes spread out everywhere."
    },
    {
      "verse": "19",
      "text": "The Canaanite territory ran from Sidon toward Gerar and Gaza, then east to Sodom, Gomorrah, Admah, and Zeboyim, reaching as far as Lasha."
    },
    {
      "verse": "20",
      "text": "That’s the Ham fam — grouped by clans, languages, lands, and nations."
    },
    {
      "verse": "21",
      "text": "Shem’s squad: He’s the ancestor of all the sons of Eber — that’s where “Hebrews” come from — and Japheth’s older brother."
    },
    {
      "verse": "22",
      "text": "Shem’s kids: Elam, Asshur, Arphaxad, Lud, and Aram."
    },
    {
      "verse": "23",
      "text": "Aram’s kids: Uz, Hul, Gether, and Mash."
    },
    {
      "verse": "24",
      "text": "Arphaxad had Shelah, and Shelah had Eber."
    },
    {
      "verse": "25",
      "text": "Eber had two sons: Peleg (named ‘cause during his time, the world got split up) and Joktan."
    },
    {
      "verse": "26",
      "text": "Joktan’s kids: Almodad, Sheleph, Hazarmaveth, Jerah,"
    },
    {
      "verse": "27",
      "text": "Hadoram, Uzal, Diklah,"
    },
    {
      "verse": "28",
      "text": "Obal, Abimael, Sheba,"
    },
    {
      "verse": "29",
      "text": "Ophir, Havilah, and Jobab — all of them were Joktan’s line."
    },
    {
      "verse": "30",
      "text": "Their zone ran from Mesha toward Sephar, in the eastern mountains."
    },
    {
      "verse": "31",
      "text": "That’s Shem’s fam — grouped by clans, languages, territories, and nations."
    },
    {
      "verse": "32",
      "text": "All these were Noah’s descendants, spreading out after the flood — nations forming, languages evolving, and the world going global again."
    }]},
{
  "chapter": "11",
  "verses": [
    {
      "verse": "1",
      "text": "Back then, the whole world spoke the same language. Everyone was literally on one wavelength."
    },
    {
      "verse": "2",
      "text": "As people moved east, they found a plain in a place called Shinar and said, “Yeah, this’ll do.”"
    },
    {
      "verse": "3",
      "text": "They said to each other, “Let’s make bricks and bake them solid.” They used bricks instead of stone and tar instead of mortar."
    },
    {
      "verse": "4",
      "text": "Then someone said, “Let’s build a city with a tower that reaches the sky so we can make a name for ourselves and not get scattered everywhere.”"
    },
    {
      "verse": "5",
      "text": "But the Lord came down to check out the city and that skyscraper they were building."
    },
    {
      "verse": "6",
      "text": "God said, “These people are one, and they all speak the same language. If this is what they can pull off together, nothing will be impossible for them.”"
    },
    {
      "verse": "7",
      "text": "“Let’s go down and mix up their language so they can’t understand each other anymore.”"
    },
    {
      "verse": "8",
      "text": "So the Lord scattered them all over the world, and the building project got scrapped real quick."
    },
    {
      "verse": "9",
      "text": "That’s why it’s called Babel — ‘cause there the Lord confused their language and scattered them across the earth."
    },
    {
      "verse": "10",
      "text": "Here’s the family line from Shem to Abram — the legacy rollout."
    },
    {
      "verse": "11",
      "text": "Two years after the flood, when Shem was 100, he had a son named Arphaxad."
    },
    {
      "verse": "12",
      "text": "After that, he lived 500 more years and had more kids."
    },
    {
      "verse": "13",
      "text": "Arphaxad was 35 when he had Shelah."
    },
    {
      "verse": "14",
      "text": "Then he lived 403 more years with more kids."
    },
    {
      "verse": "15",
      "text": "Shelah was 30 when he had Eber."
    },
    {
      "verse": "16",
      "text": "Then lived 403 more years with more kids."
    },
    {
      "verse": "17",
      "text": "Eber was 34 when he had Peleg."
    },
    {
      "verse": "18",
      "text": "Then lived 430 more years with more kids."
    },
    {
      "verse": "19",
      "text": "Peleg was 30 when he had Reu."
    },
    {
      "verse": "20",
      "text": "Then lived 209 more years with more kids."
    },
    {
      "verse": "21",
      "text": "Reu was 32 when he had Serug."
    },
    {
      "verse": "22",
      "text": "Then lived 207 more years with more kids."
    },
    {
      "verse": "23",
      "text": "Serug was 30 when he had Nahor."
    },
    {
      "verse": "24",
      "text": "Then lived 200 more years with more kids."
    },
    {
      "verse": "25",
      "text": "Nahor was 29 when he had Terah."
    },
    {
      "verse": "26",
      "text": "Then lived 119 more years with more kids."
    },
    {
      "verse": "27",
      "text": "Terah was 70 when he had Abram, Nahor, and Haran — the triple launch."
    },
    {
      "verse": "28",
      "text": "Haran had a son named Lot. But Haran died in his hometown, Ur of the Chaldeans, while his dad Terah was still alive."
    },
    {
      "verse": "29",
      "text": "Abram and Nahor both got married — Abram married Sarai, and Nahor married Milcah, Haran’s daughter."
    },
    {
      "verse": "30",
      "text": "But Sarai couldn’t have kids — womb on lock."
    },
    {
      "verse": "31",
      "text": "Terah took Abram, Sarai, and Lot and set out from Ur heading toward Canaan. But they stopped in Haran and stayed there."
    },
    {
      "verse": "32",
      "text": "Terah lived 205 years, then died in Haran."
    }]},
  {
  "chapter": "12",
  "verses": [
    {
      "verse": "1",
      "text": "Then the Lord told Abram, “Pack up. Leave your country, your fam, and your dad’s house. I’m taking you to a whole new land I’ll show you.”"
    },
    {
      "verse": "2",
      "text": "“I’m gonna make you into a big nation. I’ll bless you, make your name hit legendary status, and you’ll be a walking blessing.”"
    },
    {
      "verse": "3",
      "text": "“I’ll bless whoever blesses you and come for whoever comes for you. Through you, every nation on earth’s gonna get blessed.”"
    },
    {
      "verse": "4",
      "text": "So Abram dipped — no hesitation, no excuses — just did what God said. Lot rolled with him too. Abram was 75 when he left Haran."
    },
    {
      "verse": "5",
      "text": "He took Sarai, Lot, all their stuff, and the people they’d gathered, then set out for Canaan. And when they got there — boom, mission start."
    },
    {
      "verse": "6",
      "text": "Abram passed through the land, reaching the big tree spot at Shechem. The Canaanites were still living there."
    },
    {
      "verse": "7",
      "text": "Then God appeared to Abram and said, “I’m giving this land to your descendants.” Abram immediately built an altar — gratitude mode on."
    },
    {
      "verse": "8",
      "text": "From there, he moved to the hills east of Bethel, pitched his tent, Bethel on the west, Ai on the east. Built another altar there and called on God’s name — bro stayed prayed up."
    },
    {
      "verse": "9",
      "text": "Then he kept it moving, heading south through the land."
    },
    {
      "verse": "10",
      "text": "But a famine hit — food situation was bad — so Abram went down to Egypt to chill there for a bit till it passed."
    },
    {
      "verse": "11",
      "text": "As they got close to Egypt, Abram told Sarai, “Look, you’re crazy beautiful. Like, they’ll see you and—”"
    },
    {
      "verse": "12",
      "text": "“—they’ll off me just to take you. That’s how fine you are.”"
    },
    {
      "verse": "13",
      "text": "“So please say you’re my sister. That way, they’ll treat me well ‘cause of you, and I’ll stay alive.”"
    },
    {
      "verse": "14",
      "text": "And yeah, when they rolled into Egypt, the Egyptians saw Sarai and confirmed — she was indeed stunning."
    },
    {
      "verse": "15",
      "text": "Pharaoh’s officials hyped her up to the king, and she got taken into Pharaoh’s palace."
    },
    {
      "verse": "16",
      "text": "Pharaoh treated Abram real nice for her sake — gave him sheep, cattle, donkeys, servants, and camels."
    },
    {
      "verse": "17",
      "text": "But God wasn’t having it — He struck Pharaoh’s whole household with plagues ‘cause of Sarai, Abram’s wife."
    },
    {
      "verse": "18",
      "text": "Pharaoh called Abram like, “Bruh, what’d you do to me? Why didn’t you tell me she’s your wife?”"
    },
    {
      "verse": "19",
      "text": "“Why’d you say, ‘She’s my sister’? I could’ve married her! Take your wife and dip, bro.”"
    },
    {
      "verse": "20",
      "text": "Then Pharaoh’s guys escorted Abram, Sarai, and all their stuff out of Egypt — no harm, no drama, just divine exit."
    }]},
 {
  "chapter": "13",
  "verses": [
    {
      "verse": "1",
      "text": "Abram packed his stuff and dipped from Egypt, taking Sarai and all he owned, plus his nephew Lot tagging along."
    },
    {
      "verse": "2",
      "text": "The guy was loaded — silver, gold, livestock — basically ancient billionaire vibes."
    },
    {
      "verse": "3",
      "text": "He traveled from the south back up to Bethel, stopping at the same spot where he first pitched his tent between Bethel and Ai."
    },
    {
      "verse": "4",
      "text": "That’s where he’d built an altar earlier, and there he called on the Lord again — same God, same fire."
    },
    {
      "verse": "5",
      "text": "But Lot, who was rolling with him, also had flocks, herds, and tents."
    },
    {
      "verse": "6",
      "text": "The land couldn’t handle both of them — too much wealth, too many animals, way too crowded."
    },
    {
      "verse": "7",
      "text": "So fights started breaking out between Abram’s crew and Lot’s herders. Meanwhile, the Canaanites and Perizzites were also living in that area."
    },
    {
      "verse": "8",
      "text": "Abram stepped up like, “Yo, no beef between us. We family — your squad and mine shouldn’t be clashing.”"
    },
    {
      "verse": "9",
      "text": "“Look around — the whole land’s in front of us. Let’s split up. You pick a direction; I’ll take the opposite side.”"
    },
    {
      "verse": "10",
      "text": "Lot looked around and saw the Jordan Valley was straight-up paradise — lush like the garden of God, like Egypt before Sodom and Gomorrah got smoked."
    },
    {
      "verse": "11",
      "text": "So Lot chose the whole Jordan Valley and moved east. The cousins went separate ways."
    },
    {
      "verse": "12",
      "text": "Abram stayed in Canaan, but Lot set up near the cities of the valley, pitching his tent close to Sodom."
    },
    {
      "verse": "13",
      "text": "But Sodom’s people? Wild. Evil. Straight-up disrespectful toward God."
    },
    {
      "verse": "14",
      "text": "After Lot bounced, God told Abram, “Look around you — north, south, east, west — all of it.”"
    },
    {
      "verse": "15",
      "text": "“Every land you see, I’m giving it to you and your descendants forever.”"
    },
    {
      "verse": "16",
      "text": "“Your offspring will be like dust — uncountable. If someone can count dust particles, then maybe they can count your descendants.”"
    },
    {
      "verse": "17",
      "text": "“Now move. Walk the land — explore it, it’s yours.”"
    },
    {
      "verse": "18",
      "text": "Abram packed up, moved his tent, and settled near the oaks of Mamre in Hebron. There, he built another altar to the Lord — man was always locking in spiritually."
    }
]},
  {
  "chapter": "14",
  "verses": [
    {
      "verse": "1",
      "text": "So back in the day, there was this wild royal squad-up: King Amraphel of Shinar, King Arioch of Ellasar, King Kedorlaomer of Elam, and King Tidal of nations."
    },
    {
      "verse": "2",
      "text": "They pulled up to beef with King Bera of Sodom, King Birsha of Gomorrah, King Shinab of Admah, King Shemeber of Zeboyim, and the king of Bela (aka Zoar)."
    },
    {
      "verse": "3",
      "text": "All those local kings formed a little alliance and camped out in the Valley of Siddim, right near the Dead Sea."
    },
    {
      "verse": "4",
      "text": "They’d been under Kedorlaomer’s rule for twelve years straight, but in year thirteen they said, “Nah, we done.”"
    },
    {
      "verse": "5",
      "text": "In year fourteen, Kedorlaomer and his crew spun back like, “Y’all forgot who runs this,” and started wrecking everyone from Rephaims in Ashteroth to Horites in the mountains."
    },
    {
      "verse": "6",
      "text": "They basically cleared the whole zone down to El-paran near the desert."
    },
    {
      "verse": "7",
      "text": "Then they turned back, hit En-mishpat (that’s Kadesh), and clapped the Amalekites and Amorites chillin’ in Hazazon-tamar."
    },
    {
      "verse": "8",
      "text": "Then the kings of Sodom, Gomorrah, Admah, Zeboyim, and Bela rolled up for battle in the Valley of Siddim."
    },
    {
      "verse": "9",
      "text": "It was four kings versus five—Kedorlaomer and his squad versus the local crew."
    },
    {
      "verse": "10",
      "text": "The valley was full of tar pits, and when the kings of Sodom and Gomorrah tried to dip, they fell in. The rest of their troops ran for the hills."
    },
    {
      "verse": "11",
      "text": "The invading kings snatched all the goods and food from Sodom and Gomorrah and bounced."
    },
    {
      "verse": "12",
      "text": "They even took Lot—Abram’s nephew—plus all his stuff, since Lot had been living in Sodom."
    },
    {
      "verse": "13",
      "text": "But one dude escaped and told Abram the Hebrew what went down. Abram was chilling near Mamre the Amorite—bro was allies with Eshcol and Aner."
    },
    {
      "verse": "14",
      "text": "When Abram heard Lot got taken, he rallied his 318 trained men—homegrown warriors—and went full rescue mode."
    },
    {
      "verse": "15",
      "text": "He split his team, hit them at night, and wiped them out, chasing them all the way to Hobah, north of Damascus."
    },
    {
      "verse": "16",
      "text": "Abram got everything back—Lot, the people, and all the loot. No one left behind."
    },
    {
      "verse": "17",
      "text": "When Abram came back from smacking Kedorlaomer and his crew, the king of Sodom came out to meet him in the Valley of Shaveh (aka the King’s Valley)."
    },
    {
      "verse": "18",
      "text": "Then this mysterious dude, Melchizedek—king of Salem and priest of God Most High—pulled up with bread and wine."
    },
    {
      "verse": "19",
      "text": "He blessed Abram, saying, “Blessed be Abram by God Most High, who made heaven and earth.”"
    },
    {
      "verse": "20",
      "text": "“And blessed be God Most High, who handed your enemies to you.” Abram then gave Melchizedek a tenth of everything—straight tithe vibes."
    },
    {
      "verse": "21",
      "text": "The king of Sodom said, “Just give me the people, keep the stuff for yourself.”"
    },
    {
      "verse": "22",
      "text": "But Abram said, “Nah, I swore to the Lord, God Most High—maker of heaven and earth—”"
    },
    {
      "verse": "23",
      "text": "“That I won’t take even a thread or a sandal strap from you, so you can’t flex like, ‘I made Abram rich.’”"
    },
    {
      "verse": "24",
      "text": "“Only my guys—Aner, Eshcol, and Mamre—can take their fair share of what they earned.”"
    }]},
  {
  "chapter": "15",
  "verses": [
    {
      "verse": "1",
      "text": "Later on, God pulled up in a vision to Abram and said, “Don’t freak out, Abram. I got you. I’m your shield and your reward’s gonna hit different.”"
    },
    {
      "verse": "2",
      "text": "But Abram said, “Lord God, what’s the point of blessings if I don’t even have a kid? My only heir’s this dude Eliezer from Damascus.”"
    },
    {
      "verse": "3",
      "text": "He continued, “You haven’t given me any kids, so some random house-born guy’s gonna get it all.”"
    },
    {
      "verse": "4",
      "text": "Then God said, “Nah, not him. You’ll have your own son who’ll inherit everything.”"
    },
    {
      "verse": "5",
      "text": "God took Abram outside and said, “Look up at the sky. Count the stars—if you even can. That’s how many descendants you’ll have.”"
    },
    {
      "verse": "6",
      "text": "Abram believed God, and boom—God marked him as righteous for it."
    },
    {
      "verse": "7",
      "text": "Then God said, “I’m the same Lord who brought you outta Ur to hand you this land as your zone.”"
    },
    {
      "verse": "8",
      "text": "Abram said, “Lord God, how can I be sure I’ll actually own it?”"
    },
    {
      "verse": "9",
      "text": "God said, “Bring me a three-year-old cow, a three-year-old goat, a three-year-old ram, a dove, and a young pigeon.”"
    },
    {
      "verse": "10",
      "text": "Abram brought them all, cut them in half, and set the halves opposite each other—but didn’t split the birds."
    },
    {
      "verse": "11",
      "text": "Birds of prey tried to swoop in on the carcasses, but Abram scared them off like, “Not today.”"
    },
    {
      "verse": "12",
      "text": "As the sun dipped, Abram fell into a deep sleep, and a heavy, scary darkness came over him."
    },
    {
      "verse": "13",
      "text": "Then God said, “Know this: your descendants will live as strangers in a land that’s not theirs. They’ll be slaves and get mistreated for 400 years.”"
    },
    {
      "verse": "14",
      "text": "“But I’ll deal with the nation that enslaves them, and your people will walk out loaded with blessings.”"
    },
    {
      "verse": "15",
      "text": "“You’ll die in peace though—old and satisfied.”"
    },
    {
      "verse": "16",
      "text": "“After four generations, your people will come back here, ‘cause the current folks’ sin ain’t maxed out yet.”"
    },
    {
      "verse": "17",
      "text": "When the sun went down, Abram saw a smoking pot and a blazing torch pass between the animal halves."
    },
    {
      "verse": "18",
      "text": "That day, the Lord made a deal with Abram, saying, “I’m giving your descendants this land—from the border of Egypt to the Euphrates River.”"
    },
    {
      "verse": "19",
      "text": "“That’s the land of the Kenites, Kenizzites, Kadmonites,”"
    },
    {
      "verse": "20",
      "text": "“Hittites, Perizzites, Rephaites,”"
    },
    {
      "verse": "21",
      "text": "“Amorites, Canaanites, Girgashites, and Jebusites.”"
    }]},
  {
  "chapter": "16",
  "verses": [
    {
      "verse": "1",
      "text": "So Sarai, Abram’s wifey, was still on zero kids. But she had this Egyptian girl, Hagar, working for her."
    },
    {
      "verse": "2",
      "text": "One day Sarai was like, “Okay, maybe God’s holding me back from having babies. But hey, take Hagar—maybe I’ll finally get a kid through her.” Abram just nodded like, “Bet.”"
    },
    {
      "verse": "3",
      "text": "After ten years chilling in Canaan, Sarai officially handed Hagar to Abram as a second wife."
    },
    {
      "verse": "4",
      "text": "Abram and Hagar linked up, and boom—she got pregnant. The moment she realized she was carrying a baby, she started giving Sarai the side-eye like she was better than her."
    },
    {
      "verse": "5",
      "text": "Sarai got heated and told Abram, “This drama’s on you. I gave you my servant, and now she’s out here acting like I don’t exist. God’s gonna settle this mess between us.”"
    },
    {
      "verse": "6",
      "text": "Abram was like, “She’s your servant, do whatever you think’s right.” So Sarai started coming at Hagar heavy, and Hagar dipped—ran away into the wild."
    },
    {
      "verse": "7",
      "text": "Then the angel of the Lord found Hagar chilling by a spring in the desert, the one along the road to Shur."
    },
    {
      "verse": "8",
      "text": "The angel asked, “Hagar, Sarai’s servant—where you coming from and where you heading?” She said, “I’m running from my boss Sarai.”"
    },
    {
      "verse": "9",
      "text": "The angel told her, “Go back to her and chill. Stay humble under her authority.”"
    },
    {
      "verse": "10",
      "text": "Then the angel added, “You’re gonna have so many descendants, it’ll be uncountable—like trying to count sand at the beach.”"
    },
    {
      "verse": "11",
      "text": "The angel also said, “You’re pregnant with a son, and you’ll name him Ishmael, ‘cause the Lord heard your pain.”"
    },
    {
      "verse": "12",
      "text": "“Your son’s gonna be a wild one—living free, doing his own thing, always clashing but standing his ground.”"
    },
    {
      "verse": "13",
      "text": "Hagar called the Lord who spoke to her ‘El Roi’—meaning “the God who sees me.” She was like, “I actually saw the One who sees me.”"
    },
    {
      "verse": "14",
      "text": "That’s why that well’s called Beer Lahai Roi—it’s between Kadesh and Bered."
    },
    {
      "verse": "15",
      "text": "So Hagar gave birth to Abram’s son, and Abram named him Ishmael."
    },
    {
      "verse": "16",
      "text": "Abram was eighty-six when Hagar had Ishmael."
    }]},
  {
  "chapter": "17",
  "verses": [
    {
      "verse": "1",
      "text": "When Abram was ninety-nine (yeah, almost a hundred, no cap), the Lord pulled up and said, “I’m God Almighty. Walk before Me and stay loyal—100% real, no fake energy.”"
    },
    {
      "verse": "2",
      "text": "“I’ll make My covenant with you and multiply you like crazy.”"
    },
    {
      "verse": "3",
      "text": "Abram instantly dropped to the ground, face down. God continued:"
    },
    {
      "verse": "4",
      "text": "“Listen, this is My deal with you: you’re gonna be the father of many nations.”"
    },
    {
      "verse": "5",
      "text": "“No more ‘Abram.’ From now on, your name’s Abraham, ‘cause I’ve made you father of nations.”"
    },
    {
      "verse": "6",
      "text": "“I’ll make you crazy fruitful. Nations and even kings will come outta your line.”"
    },
    {
      "verse": "7",
      "text": "“This covenant’s forever—between Me, you, and your kids after you—for generations. I’ll be your God and their God.”"
    },
    {
      "verse": "8",
      "text": "“I’m giving you and your descendants all this land—Canaan—and I’ll be their God forever.”"
    },
    {
      "verse": "9",
      "text": "Then God said, “Now, Abraham, you and your descendants gotta keep this covenant too.”"
    },
    {
      "verse": "10",
      "text": "“Here’s the sign of the deal between Me and you: every male among you has to be circumcised.”"
    },
    {
      "verse": "11",
      "text": "“That’s the physical proof of the covenant between us.”"
    },
    {
      "verse": "12",
      "text": "“Do it to every male baby when he’s eight days old. Doesn’t matter if he’s your son or someone born in your house or bought as a servant.”"
    },
    {
      "verse": "13",
      "text": "“Everyone under your roof gets marked—this covenant is permanent.”"
    },
    {
      "verse": "14",
      "text": "“Any male who refuses? He’s out. That’s breaking the covenant.”"
    },
    {
      "verse": "15",
      "text": "God also said, “As for Sarai, your wife—don’t call her Sarai anymore. Her name’s Sarah.”"
    },
    {
      "verse": "16",
      "text": "“I’ll bless her and give you a son through her. I’ll bless her so much that nations and kings will come from her line.”"
    },
    {
      "verse": "17",
      "text": "Abraham fell on his face laughing. Like, “Wait… I’m almost 100, she’s 90—how we having a baby??”"
    },
    {
      "verse": "18",
      "text": "Then he said, “God, can’t Ishmael just be the one? He’s already here!”"
    },
    {
      "verse": "19",
      "text": "God said, “Nah. Sarah’s the one. She’s having your son, and you’ll name him Isaac. I’ll establish My everlasting covenant through him.”"
    },
    {
      "verse": "20",
      "text": "“But don’t worry, I’ve heard you about Ishmael—I’ll bless him too. He’ll have twelve princes and become a great nation.”"
    },
    {
      "verse": "21",
      "text": "“But My main covenant? That’s staying with Isaac, whom Sarah will have by this time next year.”"
    },
    {
      "verse": "22",
      "text": "Then God dipped—conversation over, covenant locked in."
    },
    {
      "verse": "23",
      "text": "That very day, Abraham took Ishmael and every male in his household—born there or bought—and circumcised them, just like God said."
    },
    {
      "verse": "24",
      "text": "Abraham was ninety-nine when he did it."
    },
    {
      "verse": "25",
      "text": "Ishmael was thirteen when it went down."
    },
    {
      "verse": "26",
      "text": "They were both circumcised on the same day."
    },
    {
      "verse": "27",
      "text": "Every male under Abraham’s roof got the mark too. Covenant secured, promise sealed."
    }]},
{
  "chapter": "18",
  "verses": [
    {
      "verse": "1",
      "text": "One day, the Lord showed up to Abraham near the oak trees at Mamre. It was hot outside, man was just chillin’ at his tent entrance like, “vibes.”"
    },
    {
      "verse": "2",
      "text": "He looked up and—boom—three men just standing there. He dipped from the tent, ran to greet them, and bowed low, full humble mode."
    },
    {
      "verse": "3",
      "text": "“My lords,” he said, “if I’ve found favor, don’t just pass by your boy.”"
    },
    {
      "verse": "4",
      "text": "“Let me bring some water, y’all wash your feet, rest under this tree.”"
    },
    {
      "verse": "5",
      "text": "“I’ll grab y’all a snack; you can chill before you head out.” They said, “Aight, do your thing.”"
    },
    {
      "verse": "6",
      "text": "Abraham rushed back inside like, “Sarah, quick—make some fresh bread, no cap, the good kind.”"
    },
    {
      "verse": "7",
      "text": "Then he ran to the herd, picked a tender calf, told a servant, “Cook this up fast, like now.”"
    },
    {
      "verse": "8",
      "text": "He brought them the food—meat, yogurt, milk—and stood nearby while they ate under the tree like a true host."
    },
    {
      "verse": "9",
      "text": "They asked him, “Yo, where’s Sarah, your wife?” He said, “She’s right inside the tent.”"
    },
    {
      "verse": "10",
      "text": "One of them said, “I’ll come back next year around this time, and Sarah will have a son.” Sarah was eavesdropping from the tent door 👀"
    },
    {
      "verse": "11",
      "text": "Abraham and Sarah were old—like, senior discount level old. Sarah’s baby factory was way past closing hours."
    },
    {
      "verse": "12",
      "text": "So she laughed to herself like, “Really? After all this time? Me and my man finna have pleasure now?”"
    },
    {
      "verse": "13",
      "text": "Then the Lord said to Abraham, “Why did Sarah laugh? She said, ‘Can I really have a kid when I’m old?’”"
    },
    {
      "verse": "14",
      "text": "“Is anything too hard for the Lord? I’ll be back next year, and she’ll have that baby.”"
    },
    {
      "verse": "15",
      "text": "Sarah got scared and tried to lie: “I didn’t laugh.” But God hit back, “Yes you did.” 💀"
    },
    {
      "verse": "16",
      "text": "When the men got up to leave, they looked toward Sodom, and Abraham walked with them a bit to see them off."
    },
    {
      "verse": "17",
      "text": "Then the Lord said, “Should I hide what I’m about to do from Abraham?”"
    },
    {
      "verse": "18",
      "text": "“He’s gonna be a great and powerful nation, and all nations on earth will be blessed through him.”"
    },
    {
      "verse": "19",
      "text": "“I’ve chosen him so he’ll teach his kids and his house to keep My ways—doing what’s right and just—so I can fulfill My promises to him.”"
    },
    {
      "verse": "20",
      "text": "Then the Lord said, “The cry against Sodom and Gomorrah is loud loud. Their sin is massive.”"
    },
    {
      "verse": "21",
      "text": "“I’m going down there to see if it’s as bad as I’ve heard. If not, we move.”"
    },
    {
      "verse": "22",
      "text": "The men turned and headed toward Sodom, but Abraham stayed talking with the Lord."
    },
    {
      "verse": "23",
      "text": "Abraham said, “Lord, are You really gonna wipe out the good people with the bad?”"
    },
    {
      "verse": "24",
      "text": "“What if there’s fifty righteous people in the city? Will You still destroy it and not spare it for their sake?”"
    },
    {
      "verse": "25",
      "text": "“Far be it from You to kill the righteous with the wicked. You’re the Judge of all the earth—You gotta do right.”"
    },
    {
      "verse": "26",
      "text": "The Lord said, “If I find fifty righteous people in Sodom, I’ll spare the whole city for them.”"
    },
    {
      "verse": "27",
      "text": "Abraham said, “Alright Lord, I know I’m just dust and ashes, but lemme speak again…”"
    },
    {
      "verse": "28",
      "text": "“What if the number’s five short of fifty? Would You destroy the city for lack of five?” The Lord said, “If I find forty-five, I’ll spare it.”"
    },
    {
      "verse": "29",
      "text": "Abraham said, “What about forty?” God said, “I won’t destroy it for forty.”"
    },
    {
      "verse": "30",
      "text": "Abraham said, “Lord, please don’t get mad, lemme talk again—what about thirty?” God said, “If I find thirty, I’ll spare it.”"
    },
    {
      "verse": "31",
      "text": "Abraham said, “Okay, how about twenty?” God said, “I won’t destroy it if there are twenty.”"
    },
    {
      "verse": "32",
      "text": "Then Abraham said, “Last one, Lord—what if there’s just ten?” God said, “If I find ten righteous people there, I’ll spare it.”"
    },
    {
      "verse": "33",
      "text": "When they finished talking, the Lord dipped, and Abraham went back home."
    }]},
  {
  "chapter": "19",
  "verses": [
    {
      "verse": "1",
      "text": "Two angels rolled up to Sodom that evening. Lot was chilling by the city gate, saw them coming, and instantly got up to greet them, bowing like “respect, my guys.”"
    },
    {
      "verse": "2",
      "text": "He said, “Yo my lords, come crash at my spot tonight. You can wash your feet, sleep well, and head out early tomorrow.” But they said, “Nah, we’ll stay out here in the streets tonight.”"
    },
    {
      "verse": "3",
      "text": "Lot wasn’t having that. Man insisted hard until they agreed. So they came over, and he cooked a whole meal — flatbread and all — and they ate."
    },
    {
      "verse": "4",
      "text": "Before they could even knock out, the men of Sodom — literally all ages, young and old — surrounded Lot’s house. Whole city pulled up, wildin’."
    },
    {
      "verse": "5",
      "text": "They shouted, “Yo Lot! Where the men at who came to you tonight? Bring ‘em out, we tryna know them.”"
    },
    {
      "verse": "6",
      "text": "Lot stepped outside, shut the door behind him, and said,"
    },
    {
      "verse": "7",
      "text": "“Guys, please don’t do this wicked stuff.”"
    },
    {
      "verse": "8",
      "text": "“Look, I got two daughters who’ve never been with a man. I’ll bring them out to you instead, just don’t do anything to these men — they’re under my protection.”"
    },
    {
      "verse": "9",
      "text": "They yelled, “Move out the way! This foreigner came to live here and now he wanna judge us? We’ll do worse to you than to them!” Then they rushed Lot hard, almost broke down the door."
    },
    {
      "verse": "10",
      "text": "But the two men yanked Lot back inside and slammed the door shut."
    },
    {
      "verse": "11",
      "text": "Then they struck all the men outside with blindness — young, old, all of them — so they couldn’t even find the door anymore."
    },
    {
      "verse": "12",
      "text": "The angels told Lot, “Yo, do you got anyone else here — sons-in-law, sons, daughters, anyone in the city? Get them outta here.”"
    },
    {
      "verse": "13",
      "text": "“This place is done. The outcry against it hit God’s throne hard, and He sent us to wipe it out.”"
    },
    {
      "verse": "14",
      "text": "So Lot ran to his sons-in-law — the ones engaged to his daughters — and said, “We gotta dip now! The Lord’s about to destroy this place!” But they thought he was trolling."
    },
    {
      "verse": "15",
      "text": "Early next morning, the angels told Lot, “Hurry up! Take your wife and daughters who are here or you’ll get caught up when the city’s judged.”"
    },
    {
      "verse": "16",
      "text": "But bro hesitated. So the angels literally grabbed him, his wife, and daughters by the hand — because God had mercy — and dragged them out of the city."
    },
    {
      "verse": "17",
      "text": "When they were safely out, one angel said, “Run for your life! Don’t look back or stop anywhere in the valley. Head for the mountains or you’ll be wiped out.”"
    },
    {
      "verse": "18",
      "text": "Lot said, “Please, my lord, listen —”"
    },
    {
      "verse": "19",
      "text": "“You’ve shown me crazy favor and saved my life, but I can’t make it to the mountains; something bad might happen, and I’ll die.”"
    },
    {
      "verse": "20",
      "text": "“There’s a small town nearby. Let me escape there. It’s tiny, please — let me go there and live.”"
    },
    {
      "verse": "21",
      "text": "The angel said, “Aight, fine. I won’t destroy that town. You got the greenlight.”"
    },
    {
      "verse": "22",
      "text": "“But hurry up — I can’t do anything until you reach it.” That’s why the town’s name got called Zoar (meaning “small”)."
    },
    {
      "verse": "23",
      "text": "Just as Lot reached Zoar, the sun was rising."
    },
    {
      "verse": "24",
      "text": "Then the Lord dropped fire and burning sulfur from heaven on Sodom and Gomorrah."
    },
    {
      "verse": "25",
      "text": "He wiped out the whole region — cities, people, plants, everything."
    },
    {
      "verse": "26",
      "text": "But Lot’s wife looked back… and she froze into a pillar of salt."
    },
    {
      "verse": "27",
      "text": "Next morning, Abraham went to the place he had stood before the Lord."
    },
    {
      "verse": "28",
      "text": "He looked toward Sodom and Gomorrah — and saw smoke rising from the land like a massive furnace."
    },
    {
      "verse": "29",
      "text": "When God destroyed the cities of the valley, He remembered Abraham and rescued Lot out of the disaster that took down those cities."
    },
    {
      "verse": "30",
      "text": "Later, Lot and his two daughters left Zoar and moved into a cave in the mountains, ‘cause he was scared to stay in town."
    },
    {
      "verse": "31",
      "text": "The older daughter said to the younger, “There’s no man left around to marry us like normal. Our dad’s old.”"
    },
    {
      "verse": "32",
      "text": "“Let’s get him drunk and sleep with him so we can keep the family line going.”"
    },
    {
      "verse": "33",
      "text": "That night, they gave their dad wine. The older one went in and slept with him — Lot had no clue what was happening."
    },
    {
      "verse": "34",
      "text": "The next day, the older said, “Last night I was with Dad. Let’s get him drunk again, and you do the same, so we can keep the line alive.”"
    },
    {
      "verse": "35",
      "text": "They did it again the next night — Lot didn’t notice a thing."
    },
    {
      "verse": "36",
      "text": "Both daughters got pregnant by their dad."
    },
    {
      "verse": "37",
      "text": "The older one had a son and named him Moab — he became the ancestor of the Moabites."
    },
    {
      "verse": "38",
      "text": "The younger one also had a son and named him Ben-Ammi — he became the ancestor of the Ammonites."
    }]},
{
  "chapter": "20",
  "verses": [
    {
      "verse": "1",
      "text": "Abraham dipped from where he was and moved to the south zone, settling between Kadesh and Shur, then set up camp in Gerar."
    },
    {
      "verse": "2",
      "text": "There, he said Sarah was his “sister” (bro’s still doing that move 😭). So King Abimelech of Gerar pulled up and took Sarah."
    },
    {
      "verse": "3",
      "text": "But that night, God showed up in Abimelech’s dream like, “Yo, you’re done for if you touch her—she’s a married woman.”"
    },
    {
      "verse": "4",
      "text": "Abimelech was like, “Hold up, I didn’t even go near her!” He said, “Lord, will You cancel a whole nation over something I didn’t even do?”"
    },
    {
      "verse": "5",
      "text": "“He told me she was his sister, and she said the same thing! I acted with pure intentions; my hands are clean fr.”"
    },
    {
      "verse": "6",
      "text": "God replied in the dream, “Yeah, I know you kept it clean—that’s why I stopped you from sinning against Me. I didn’t let you touch her.”"
    },
    {
      "verse": "7",
      "text": "“Now return the man’s wife. He’s a prophet, he’ll pray for you so you don’t get wrecked. But if you don’t return her, you’re cooked—you and everyone around you.”"
    },
    {
      "verse": "8",
      "text": "Abimelech woke up early, gathered his squad, and spilled everything that went down. The men were terrified."
    },
    {
      "verse": "9",
      "text": "Then he dragged Abraham over like, “Dude, what did you do to me? Did I offend you somehow that you’d drop this curse-level trouble on me and my people?”"
    },
    {
      "verse": "10",
      "text": "“Why’d you even pull that move, bro? What was your thought process?”"
    },
    {
      "verse": "11",
      "text": "Abraham said, “Tbh, I thought y’all didn’t fear God here, and I figured y’all might kill me just to get Sarah.”"
    },
    {
      "verse": "12",
      "text": "“And technically... she is my sister. Same dad, different mom—but yeah, she became my wife.”"
    },
    {
      "verse": "13",
      "text": "“When God had me out here traveling, I told her, ‘Everywhere we go, say I’m your brother.’”"
    },
    {
      "verse": "14",
      "text": "Then Abimelech gave Abraham sheep, cattle, servants, and returned Sarah to him."
    },
    {
      "verse": "15",
      "text": "Abimelech said, “My whole land’s open, pick wherever you wanna stay.”"
    },
    {
      "verse": "16",
      "text": "He told Sarah, “Look, I gave your bro a thousand silver coins. That clears your name in front of everyone—you’re good.”"
    },
    {
      "verse": "17",
      "text": "Abraham prayed for Abimelech, and God healed him, his wife, and his female servants so they could have kids again."
    },
    {
      "verse": "18",
      "text": "‘Cause earlier, the Lord had locked every womb in Abimelech’s house because of what happened with Sarah."
    }]},
  {
  "chapter": "21",
  "verses": [
    { "verse": "1", "text": "God came through for Sarah, exactly like He said He would. Promise kept, no delay." },
    { "verse": "2", "text": "She got pregnant and had a son for Abraham in his old age, right on God’s timing." },
    { "verse": "3", "text": "Abraham named his son — the one Sarah gave birth to — Isaac." },
    { "verse": "4", "text": "When Isaac turned eight days old, Abraham circumcised him, just like God commanded." },
    { "verse": "5", "text": "Abraham was one hundred years old when Isaac was born. Talk about a late start." },
    { "verse": "6", "text": "Sarah said, “God made me laugh, and everyone who hears this will laugh with me too.”" },
    { "verse": "7", "text": "She added, “Who would’ve said I’d be nursing a baby at this age? But here I am, giving Abraham a son.”" },
    { "verse": "8", "text": "Isaac grew up, got weaned, and Abraham threw a whole celebration for him." },
    { "verse": "9", "text": "But Sarah saw Hagar’s son, Ishmael, mocking Isaac, and she wasn’t having it." },
    { "verse": "10", "text": "She told Abraham, “Send that slave woman and her son away. That boy isn’t sharing inheritance with mine.”" },
    { "verse": "11", "text": "Abraham was really upset, because Ishmael was still his son too." },
    { "verse": "12", "text": "But God said, “Don’t stress about the boy or the maid. Listen to Sarah. Isaac’s the one your legacy will run through.”" },
    { "verse": "13", "text": "“But don’t worry, I’ll also make a nation from Ishmael since he’s your son.”" },
    { "verse": "14", "text": "Early the next morning, Abraham packed food and water, gave them to Hagar, and sent her off with the boy. They wandered into the desert of Beersheba." },
    { "verse": "15", "text": "When the water ran out, Hagar put the boy under a bush." },
    { "verse": "16", "text": "She walked off a distance and said, “I can’t watch my son die.” Then she broke down crying." },
    { "verse": "17", "text": "God heard the boy crying, and the angel of God called out to Hagar from heaven, “What’s wrong? Don’t be afraid. God’s heard the boy loud and clear.”" },
    { "verse": "18", "text": "“Get up, help him out. He’s going to be a great nation.”" },
    { "verse": "19", "text": "Then God opened her eyes, and she saw a well. She filled her bottle and gave the boy water." },
    { "verse": "20", "text": "God stayed with the boy as he grew up. He became an archer, living the wilderness life." },
    { "verse": "21", "text": "He settled in the Desert of Paran, and his mom got him a wife from Egypt." },
    { "verse": "22", "text": "Around that time, Abimelek and his army commander Phicol told Abraham, “God’s clearly with you in everything you do.”" },
    { "verse": "23", "text": "“So swear before God that you won’t lie to me or my people. Be fair with me like I’ve been fair with you.”" },
    { "verse": "24", "text": "Abraham said, “Deal. I swear.”" },
    { "verse": "25", "text": "But Abraham also told Abimelek, “Your guys took one of my wells.”" },
    { "verse": "26", "text": "Abimelek said, “I had no clue. Nobody told me till now.”" },
    { "verse": "27", "text": "So Abraham brought out sheep and cattle, and they made a peace deal." },
    { "verse": "28", "text": "Then Abraham set aside seven young lambs." },
    { "verse": "29", "text": "Abimelek asked, “What’s with these seven?”" },
    { "verse": "30", "text": "Abraham said, “They’re proof that I dug this well myself.”" },
    { "verse": "31", "text": "So the place was called Beersheba, meaning “Well of the Oath,” because both of them swore there." },
    { "verse": "32", "text": "After the deal, Abimelek and Phicol headed back to Philistine territory." },
    { "verse": "33", "text": "Abraham planted a tamarisk tree at Beersheba and prayed there, calling on the name of the LORD, the Eternal God." },
    { "verse": "34", "text": "Abraham lived in the land of the Philistines for a long time." }]},
  {
  "chapter": "22",
  "verses": [
    { "verse": "1", "text": "Some time later, God tested Abraham. He called out, “Abraham!” And Abe said, “Here I am.”" },
    { "verse": "2", "text": "God said, “Take your son—your only one, Isaac, the one you love—and go to the land of Moriah. Sacrifice him there as a burnt offering on one of the mountains I’ll point out.”" },
    { "verse": "3", "text": "Early next morning, Abraham got up, saddled his donkey, took two servants and Isaac with him, chopped some wood for the offering, and headed out to the place God mentioned." },
    { "verse": "4", "text": "On the third day, Abraham looked up and saw the spot from a distance." },
    { "verse": "5", "text": "He told his servants, “Y’all stay here with the donkey. Me and the boy are going over there to worship, then we’ll come back.”" },
    { "verse": "6", "text": "Abraham took the wood for the offering and made Isaac carry it. He himself carried the fire and the knife. Father and son walking together — quiet but deep moment." },
    { "verse": "7", "text": "Then Isaac said, “Uh, Dad?” Abraham said, “Yeah, son?” Isaac said, “So we got fire and wood… but where’s the lamb for the sacrifice?”" },
    { "verse": "8", "text": "Abraham replied, “God Himself will provide the lamb, my son.” And they kept walking together." },
    { "verse": "9", "text": "When they reached the spot God told him about, Abraham built an altar, stacked the wood, tied up Isaac, and laid him on top." },
    { "verse": "10", "text": "Then he picked up the knife to kill his son." },
    { "verse": "11", "text": "But the angel of the LORD shouted from heaven, “Abraham! Abraham!” He said, “Here I am!”" },
    { "verse": "12", "text": "The angel said, “Stop! Don’t touch the boy. Now I know you fear God, ‘cause you didn’t hold back your only son.”" },
    { "verse": "13", "text": "Abraham looked up and saw a ram caught by its horns in a bush. So he took the ram and sacrificed it instead of his son." },
    { "verse": "14", "text": "Abraham named that place “The LORD Will Provide” — and that’s still what people say: “On the LORD’s mountain, it’ll be provided.”" },
    { "verse": "15", "text": "Then the angel of the LORD called out to Abraham a second time," },
    { "verse": "16", "text": "and said, “This is what the LORD says: Because you did this and didn’t hold back your son—your only one—”" },
    { "verse": "17", "text": "I’m gonna bless you big time. Your kids and grandkids will multiply like the stars in the sky and the sand on the beach. They’ll conquer their enemies’ gates.”" },
    { "verse": "18", "text": "“And through your descendants, all nations on earth will be blessed—because you obeyed Me.”" },
    { "verse": "19", "text": "Then Abraham went back to his servants, and they all headed home to Beersheba, where he stayed." },
    { "verse": "20", "text": "Later, word came to Abraham: “Hey, Milcah also had sons for your brother Nahor.”" },
    { "verse": "21", "text": "Uz (firstborn), Buz (his brother), Kemuel (dad of Aram)," },
    { "verse": "22", "text": "Kesed, Hazo, Pildash, Jidlaph, and Bethuel." },
    { "verse": "23", "text": "Bethuel became the father of Rebekah. So yeah—Milcah had those eight sons for Nahor, Abraham’s brother." },
    { "verse": "24", "text": "And Nahor’s side chick, Reumah, had four more: Tebah, Gaham, Tahash, and Maakah." }
  ]
},
{
  "chapter": "23",
  "verses": [
    { "verse": "1", "text": "Sarah lived to be 127 years old—yeah, she was that seasoned." },
    { "verse": "2", "text": "She died in Kiriath Arba (that’s Hebron in Canaan), and Abraham cried hard. Like, man was in full mourning mode for her." },
    { "verse": "3", "text": "After grieving, Abraham stood up from beside her body and went to talk to the Hittites." },
    { "verse": "4", "text": "He said, “Yo, I’m just a traveler living among y’all. Please let me buy some land so I can bury my wife properly.”" },
    { "verse": "5", "text": "The Hittites replied," },
    { "verse": "6", "text": "“Big respect, boss. You’re a mighty prince among us. Pick any of our tombs—none of us will stop you from burying your wife in the best one.”" },
    { "verse": "7", "text": "Abraham stood up, bowed before the Hittites—real humble energy—" },
    { "verse": "8", "text": "and said, “If y’all really down to let me bury my wife, talk to Ephron son of Zohar for me.”" },
    { "verse": "9", "text": "“Ask him to sell me that cave of Machpelah he owns at the edge of his field. I’ll pay full price for it so it’s officially mine as a burial spot.”" },
    { "verse": "10", "text": "Ephron was sitting there among the Hittites, and he answered Abraham right in front of everyone." },
    { "verse": "11", "text": "“Nah, my lord,” Ephron said, “listen, I’ll give you the field and the cave. In front of all these witnesses—take it. Go bury your wife.”" },
    { "verse": "12", "text": "Abraham bowed again before the people." },
    { "verse": "13", "text": "He said to Ephron, “Please, fam, let me pay for it. I want to buy it fair and square so I can bury my wife there.”" },
    { "verse": "14", "text": "Ephron replied, “Alright, listen up—" },
    { "verse": "15", "text": "the land’s worth, like, four hundred shekels of silver. But between me and you, what’s that? Just go bury your wife.”" },
    { "verse": "16", "text": "Abraham agreed and weighed out the exact 400 shekels of silver, legit weighed according to the standard rate back then." },
    { "verse": "17", "text": "So the field of Ephron at Machpelah near Mamre—with the cave and all the trees on it—" },
    { "verse": "18", "text": "got officially transferred to Abraham in front of everyone. Paperwork vibes complete." },
    { "verse": "19", "text": "Then Abraham buried Sarah there, in the cave at Machpelah, near Mamre (that’s Hebron in Canaan)." },
    { "verse": "20", "text": "So the field and the cave were legally Abraham’s—fully owned as his family burial spot." }]},
{
  "chapter": "24",
  "verses": [
    { "verse": "1", "text": "Abraham was getting old, like senior-citizen-level old, and God had blessed him in everything." },
    { "verse": "2", "text": "So he told his top servant—the OG in charge of his whole house—“Yo, put your hand under my thigh real quick.”" },
    { "verse": "3", "text": "“Swear by the LORD, the God of heaven and earth, that you won’t pick a wife for my son from these local Canaanite girls.”" },
    { "verse": "4", "text": "“Instead, go to my hometown and find him a wife from my fam.”" },
    { "verse": "5", "text": "The servant was like, “Uh… what if the girl refuses to come with me back here? Should I take Isaac there instead?”" },
    { "verse": "6", "text": "Abraham said, “Nah fam, don’t you dare take my son there.”" },
    { "verse": "7", "text": "“The LORD, God of heaven, who took me from my dad’s house and promised me all this land—He’ll send His angel ahead of you so you can find my son’s wife.”" },
    { "verse": "8", "text": "“But if she doesn’t vibe with coming back, you’re off the hook. Just don’t take my son there, okay?”" },
    { "verse": "9", "text": "So the servant made the promise to Abraham and did the whole hand-under-thigh ritual thing." },
    { "verse": "10", "text": "Then he took ten camels loaded with Abraham’s best stuff and dipped—heading for the land of Nahor in Mesopotamia." },
    { "verse": "11", "text": "When he got there, he parked the camels near a well outside town at evening time—the hour when the ladies came out for water." },
    { "verse": "12", "text": "Then he prayed, “Lord, God of my master Abraham, please make this mission a W today. Show kindness to my master.”" },
    { "verse": "13", "text": "“I’m posted up by this well, and the girls of the town are about to pull up for water.”" },
    { "verse": "14", "text": "“Here’s the sign: the girl I ask for water—if she says, ‘Sure, and I’ll water your camels too,’ that’s the one You chose for Isaac.”" },
    { "verse": "15", "text": "Before he even finished the prayer, Rebekah came out—born to Bethuel (son of Milcah, wife of Nahor, Abraham’s bro)—rocking her water jar." },
    { "verse": "16", "text": "She was mad beautiful, never been with a man. She went down to the well, filled her jar, and came up." },
    { "verse": "17", "text": "The servant ran up and said, “Please, can I sip some water from your jar?”" },
    { "verse": "18", "text": "She said, “Drink, sir,” and lowered the jar for him." },
    { "verse": "19", "text": "After he drank, she said, “I’ll get some for your camels too till they’re done drinking.”" },
    { "verse": "20", "text": "She quickly emptied her jar into the trough, ran back to refill it, and kept at it till all the camels were hydrated." },
    { "verse": "21", "text": "The guy was just watching silently, trying to see if God had really made his trip successful." },
    { "verse": "22", "text": "When the camels were done, the servant pulled out a gold nose ring and two gold bracelets." },
    { "verse": "23", "text": "He asked, “Whose daughter are you? And is there room at your house for me to crash?”" },
    { "verse": "24", "text": "She said, “I’m the daughter of Bethuel, son of Milcah and Nahor.”" },
    { "verse": "25", "text": "Then she added, “We got plenty of straw and food for your camels, and a place to stay.”" },
    { "verse": "26", "text": "The man instantly bowed and worshiped the LORD." },
    { "verse": "27", "text": "“Praise the LORD, God of my master Abraham,” he said. “He didn’t ghost my master but led me straight to his fam!”" },
    { "verse": "28", "text": "Rebekah ran home to tell her fam what went down." },
    { "verse": "29", "text": "She had a brother named Laban, who ran out to the man at the well." },
    { "verse": "30", "text": "When Laban saw the nose ring and bracelets on his sis, and heard what she said, he ran up to the guy who was still standing by his camels." },
    { "verse": "31", "text": "“Come on in, blessed of the LORD!” Laban said. “Why you still outside? I got the house and a spot for your camels ready.”" },
    { "verse": "32", "text": "So the man came in. Laban unloaded the camels, gave them straw and water, and offered water for the guy to wash up." },
    { "verse": "33", "text": "Then they served him food, but he said, “I’m not eating till I explain my mission.” Laban said, “Aight, talk.”" },
    { "verse": "34", "text": "“I’m Abraham’s servant,” he began." },
    { "verse": "35", "text": "“The LORD blessed my master big time—he’s rich in flocks, silver, gold, servants, camels, and donkeys.”" },
    { "verse": "36", "text": "“Sarah, my master’s wife, had a son in her old age, and everything’s gonna be that son’s.”" },
    { "verse": "37", "text": "“My master made me swear not to get his son a wife from Canaan.”" },
    { "verse": "38", "text": "“He said, ‘Go to my fam, to my own people, and find him a wife.’”" },
    { "verse": "39", "text": "“I asked, ‘What if she doesn’t come with me?’”" },
    { "verse": "40", "text": "“He said, ‘The LORD will send His angel before you and make it work. You’ll find a wife for my son from my fam.’”" },
    { "verse": "41", "text": "“If they don’t give her to you, you’re free from the oath.”" },
    { "verse": "42", "text": "“So today, when I got to the well, I prayed: ‘Lord, God of Abraham, please make this mission work.’”" },
    { "verse": "43", "text": "“‘Here’s my sign: the girl who offers water for me and my camels—she’s the one You picked.’”" },
    { "verse": "44", "text": "“Before I finished praying, Rebekah showed up, doing exactly that.”" },
    { "verse": "45", "text": "“I asked her whose daughter she was; she said, ‘Bethuel’s, son of Nahor and Milcah.’ Then I put the ring on her nose and bracelets on her arms.”" },
    { "verse": "46", "text": "“Then I bowed and thanked the LORD, God of Abraham, for leading me straight to my master’s fam.”" },
    { "verse": "47", "text": "“Now, tell me straight—are y’all down to let her come with me or not? Don’t waste time.”" },
    { "verse": "48", "text": "Laban and Bethuel answered, “This thing’s clearly from the LORD; we can’t say no or yes against it.”" },
    { "verse": "49", "text": "“Here’s Rebekah—take her. Let her go be Isaac’s wife, just as the LORD said.”" },
    { "verse": "50", "text": "When Abraham’s servant heard that, he bowed again before God." },
    { "verse": "51", "text": "Then he dropped gifts—gold, silver, clothes—for Rebekah, and gave her brother and mom precious things too." },
    { "verse": "52", "text": "They all ate and drank, and he and his crew stayed the night." },
    { "verse": "53", "text": "The next morning, he said, “Send me back to my master.”" },
    { "verse": "54", "text": "Her brother and mom said, “Let her stay ten more days, then she’ll go.”" },
    { "verse": "55", "text": "He said, “Please don’t delay me; the LORD made this trip a success. Let me go now.”" },
    { "verse": "56", "text": "They said, “Let’s ask Rebekah.”" },
    { "verse": "57", "text": "They called her and asked, “You down to go with this man?”" },
    { "verse": "58", "text": "She said, “Yeah, I’m down.”" },
    { "verse": "59", "text": "So they sent Rebekah and her nurse off with Abraham’s servant and his men." },
    { "verse": "60", "text": "They blessed her, saying, “Sis, may you become the mom of millions. May your kids dominate their enemies’ gates.”" },
    { "verse": "61", "text": "Rebekah and her maids hopped on camels and followed the servant, and he bounced back with them." },
    { "verse": "62", "text": "Meanwhile, Isaac was chilling in the Negev area after coming from Beer Lahai Roi." },
    { "verse": "63", "text": "One evening, he was out for a walk, meditating in the field, and looked up—boom, camels coming!" },
    { "verse": "64", "text": "Rebekah looked up, saw Isaac, and hopped off her camel." },
    { "verse": "65", "text": "She asked the servant, “Who’s that man walking toward us?” He said, “That’s my master.” She covered her face with her veil." },
    { "verse": "66", "text": "The servant told Isaac everything that happened." },
    { "verse": "67", "text": "Then Isaac brought Rebekah into his mother Sarah’s tent, married her, and she became his wife. He loved her deeply, and she comforted him after his mom’s death." }]},
{
"chapter": "25",
"verses": [
{
"verse": "1",
"text": "Abraham decided to level up and married another wife named Keturah—big main character energy."
},
{
"verse": "2",
"text": "She gave him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah—the squad was officially assembled."
},
{
"verse": "3",
"text": "Jokshan was father to Sheba and Dedan. Dedan's descendants were the Ashurites, Letushites, and Leummites—spreading the family brand."
},
{
"verse": "4",
"text": "Midian's sons were Ephah, Epher, Hanoch, Abida, and Eldaah—all of these were Keturah's legacy."
},
{
"verse": "5",
"text": "Abraham gave everything he had to Isaac—the ultimate inheritance W."
},
{
"verse": "6",
"text": "But he gave gifts to his side quest sons and sent them away from Isaac—keeping the main plot clear."
},
{
"verse": "7",
"text": "Abraham lived 175 years—an absolute legend."
},
{
"verse": "8",
"text": "Then Abraham breathed his last, dying at a ripe old age, full of years, and was gathered to his people—the final rest."
},
{
"verse": "9",
"text": "His sons Isaac and Ishmael buried him in the cave of Machpelah—family reunion vibes."
},
{
"verse": "10",
"text": "In the field Ephron son of Zohar the Hittite owned, the same place where Abraham buried Sarah—keeping the legacy location."
},
{
"verse": "11",
"text": "After Abraham's death, God blessed his son Isaac, who settled near Beer Lahai Roi—the blessings kept coming."
},
{
"verse": "12",
"text": "This is the genealogy of Ishmael, Abraham's son, whom Hagar the Egyptian, Sarah's servant, bore—the origin story."
},
{
"verse": "13",
"text": "These are the names of Ishmael's sons, in order: Nebaioth, Kedar, Adbeel, Mibsam—the roster."
},
{
"verse": "14",
"text": "Mishma, Dumah, Massa,"
},
{
"verse": "15",
"text": "Hadad, Tema, Jetur, Naphish, and Kedemah—the whole crew."
},
{
"verse": "16",
"text": "These were Ishmael's sons, and these are their names by their settlements and camps—twelve tribal bosses."
},
{
"verse": "17",
"text": "Ishmael lived 137 years, then breathed his last and was gathered to his people—legend status achieved."
},
{
"verse": "18",
"text": "His descendants settled from Havilah to Shur, near the border of Egypt as you go toward Ashur—they really occupied the space."
},
{
"verse": "19",
"text": "This is the account of Abraham's son Isaac—the main storyline continues."
},
{
"verse": "20",
"text": "Isaac was 40 years old when he married Rebekah, daughter of Bethuel the Aramean from Paddan Aram—locked it down."
},
{
"verse": "21",
"text": "Isaac prayed to the LORD for his wife because she was childless. The LORD answered his prayer—manifestation worked."
},
{
"verse": "22",
"text": "The babies inside her struggled, and she said, 'Why is this happening to me?' So she went to inquire of the LORD—seeking answers."
},
{
"verse": "23",
"text": "The LORD told her: 'Two nations are in your womb, two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger—the plot twist."
},
{
"verse": "24",
"text": "When the time came for her to give birth, there were twin boys in her womb—the duo arrived."
},
{
"verse": "25",
"text": "The first one came out red, and his whole body was like a hairy garment; so they named him Esau—distinct vibe."
},
{
"verse": "26",
"text": "After this, his brother came out, with his hand grasping Esau's heel; so he was named Jacob. Isaac was sixty years old when Rebekah gave birth to them—the grip was real."
},
{
"verse": "27",
"text": "The boys grew up. Esau became a skilled hunter, an outdoor main. Jacob on the other hand was a quiet king, staying among the tents—different energies."
},
{
"verse": "28",
"text": "Isaac, who had a taste for wild game, loved Esau, but Rebekah loved Jacob—parental favoritism hitting different."
},
{
"verse": "29",
"text": "Once when Jacob was cooking some stew, Esau came in from the open country, feeling depleted—major hunger vibes."
},
{
"verse": "30",
"text": "He said to Jacob, 'Quick, let me have some of that red stew! I'm exhausted!' (That's why he was also called Edom)—the nickname origin."
},
{
"verse": "31",
"text": "Jacob replied, 'First, sell me your birthright—the ultimate negotiation."
},
{
"verse": "32",
"text": "Esau said, 'Look, I am about to die of hunger. What good is the birthright to me?'—priorities were questionable."
},
{
"verse": "33",
"text": "But Jacob said, 'Swear to me first.' So he swore an oath, selling his birthright to Jacob—the deal was sealed."
},
{
"verse": "34",
"text": "Then Jacob gave Esau some bread and some lentil stew. He ate and drank, then got up and left. So Esau showed how little he valued his birthright—the biggest L of all time."}]},
  {
  "chapter": "26",
  "verses": [
    {
      "verse": "1",
      "text": "There was a major food shortage in the land—like, the vibes were all wrong."
    },
    {
      "verse": "2",
      "text": "So God popped up and was like, 'Yo, Isaac, don't even think about going to Egypt. Just stay in this spot I'm telling you about.'"
    },
    {
      "verse": "3",
      "text": "Hang here in this land, and I'll have your back and bless you. I'm giving all these areas to you and your future squad, keeping the promise I gave your dad Abraham."
    },
    {
      "verse": "4",
      "text": "I'm gonna make your descendants pop off like the stars in the sky, and I'll bless them all. Through your seed, every nation on earth will get the W."
    },
    {
      "verse": "5",
      "text": "All because Abraham listened to my voice and kept my requirements, my commands, my statutes, and my whole vibe."
    },
    {
      "verse": "6",
      "text": "So Isaac stayed in Gerar."
    },
    {
      "verse": "7",
      "text": "When the locals asked about his wife, he was like, 'She's my sister.' He was too scared to say 'my wife,' thinking, 'These dudes might cancel me over Rebekah, 'cause she's a whole snack.'"
    },
    {
      "verse": "8",
      "text": "After he'd been there a minute, Abimelech, king of the Philistines, looked out his window and saw Isaac and Rebekah being all cute."
    },
    {
      "verse": "9",
      "text": "So Abimelech called Isaac and was like, 'Bro, she's obviously your wife. Why you trying to say she's your sister?' Isaac told him, 'I thought I might get ghosted because of her.'"
    },
    {
      "verse": "10",
      "text": "And Abimelech said, 'What is this you've done to us? One of the people might have linked up with your wife, and you would have brought major drama on us.'"
    },
    {
      "verse": "11",
      "text": "Then Abimelech gave everyone the 411, saying, 'Whoever touches this man or his wife is getting cancelled, no cap.'"
    },
    {
      "verse": "12",
      "text": "Isaac planted crops in that land and same year repped a hundredfold return, because the LORD blessed him."
    },
    {
      "verse": "13",
      "text": "The man leveled up, getting more and more stacked until he was a whole vibe."
    },
    {
      "verse": "14",
      "text": "He had flocks, herds, and a whole server of servants, so the Philistines were giving major side-eye."
    },
    {
      "verse": "15",
      "text": "So the Philistines took all the wells his dad's servants had dug and filled them with dirt."
    },
    {
      "verse": "16",
      "text": "And Abimelech said to Isaac, 'You need to leave us, 'cause you've become too powerful for our squad.'"
    },
    {
      "verse": "17",
      "text": "So Isaac bounced from there and camped in the Gerar valley, setting up his base there."
    },
    {
      "verse": "18",
      "text": "Isaac re-dug the wells that were dug in his father Abraham's time, which the Philistines had capped after Abraham's time, and he gave them the same names his father had given them."
    },
    {
      "verse": "19",
      "text": "Isaac's servants dug in the valley and found a fresh well there."
    },
    {
      "verse": "20",
      "text": "But the Gerar herders started drama with Isaac's herders, saying, 'That water's ours.' So he named the well Esek, because they pressed him."
    },
    {
      "verse": "21",
      "text": "Then they dug another well, and they argued over that one too, so he named it Sitnah."
    },
    {
      "verse": "22",
      "text": "He moved on from there and dug another well, and no one argued over it. He named it Rehoboth, saying, 'Now the LORD has given us space and we will thrive in the land.'"
    },
    {
      "verse": "23",
      "text": "From there he went up to Beersheba."
    },
    {
      "verse": "24",
      "text": "That night the LORD appeared to him and said, 'I am the God of your father Abraham. Do not fear, for I am with you. I will bless you and multiply your descendants for my guy Abraham's sake.'"
    },
    {
      "verse": "25",
      "text": "So he built an altar there and called on the name of the LORD. He pitched his tent there, and Isaac's servants dug a well."
    },
    {
      "verse": "26",
      "text": "Then Abimelech came to him from Gerar with Ahuzzath his advisor and Phicol the commander of his forces."
    },
    {
      "verse": "27",
      "text": "Isaac said to them, 'Why have you come to me, since you literally hate me and sent me away from your whole situation?'"
    },
    {
      "verse": "28",
      "text": "They said, 'We see clearly that the LORD is with you, so we're thinking, let there be an oath between us, between you and us, and let us make a covenant with you.'"
    },
    {
      "verse": "29",
      "text": "Promise you won't do us dirty, just as we haven't touched you, and have only done you good and sent you away in peace. You are now blessed by the LORD."
    },
    {
      "verse": "30",
      "text": "So he made them a feast, and they ate and drank."
    },
    {
      "verse": "31",
      "text": "They got up early in the morning and swore oaths to each other. Then Isaac sent them on their way, and they left in peace."
    },
    {
      "verse": "32",
      "text": "That same day Isaac's servants came and told him about the well they had dug. They said to him, 'We found water!'"
    },
    {
      "verse": "33",
      "text": "He called it Shibah; therefore the name of the city is Beersheba to this day."
    },
    {
      "verse": "34",
      "text": "When Esau was 40 years old, he married Judith daughter of Beeri the Hittite, and also Basemath daughter of Elon the Hittite."
    },
    {
      "verse": "35",
      "text": "And they were a source of major stress to Isaac and Rebekah."
    }]},
  {
  "chapter": "27",
  "verses": [
    {
      "verse": "1",
      "text": "Isaac was old AF (as fudge) and his vision was giving grandpa-core, so he called his son Esau and was like 'Bruh?' and Esau said 'Bet.'"
    },
    {
      "verse": "2",
      "text": "He said 'No cap, I'm old and might unalive any minute.'"
    },
    {
      "verse": "3",
      "text": "So grab your main character gear—your bow and arrows—go touch grass, and secure the bag. Get some game, king."
    },
    {
      "verse": "4",
      "text": "Then slay that meal for me, the one I'm obsessed with, so I can eat and bless you with my final rizz before I get yeeted.'"
    },
    {
      "verse": "5",
      "text": "But Rebekah overheard the whole tea. When Esau left to hunt, she immediately put Jacob on blast."
    },
    {
      "verse": "6",
      "text": "She told Jacob, 'I just heard your dad giving your brother the 411."
    },
    {
      "verse": "7",
      "text": "He said 'Bring me the goods, cook it, let me eat, and I'll drop the final blessing in the Lord's DMs before I ghost.'"
    },
    {
      "verse": "8",
      "text": "So listen up, bestie, and do exactly what I'm telling you.'"
    },
    {
      "verse": "9",
      "text": "Go to the flock and snag two young goats. I'm gonna cook them so fire, your dad will think it's from his fave food truck."
    },
    {
      "verse": "10",
      "text": "Then you serve it to him so he can eat and bless you before he passes the vibe check.'"
    },
    {
      "verse": "11",
      "text": "Jacob clapped back, 'But my brother Esau is built different—he's a whole yeti, and I'm giving smooth skinned king.'"
    },
    {
      "verse": "12",
      "text": "What if my dad gives me a hands-on inspection? He'll know I'm capping and I'll get cancelled instead of blessed.'"
    },
    {
      "verse": "13",
      "text": "His mother said, 'Let the curse be on me, periodt. Just go get the goats, my guy.'"
    },
    {
      "verse": "14",
      "text": "So he went and got them and brought them to his mom, and she cooked the meal just how his dad liked it."
    },
    {
      "verse": "15",
      "text": "Then Rebekah took Esau's main character fit—the premium drip she had in the house—and put it on her younger son Jacob."
    },
    {
      "verse": "16",
      "text": "She put the goat skins on his hands and the smooth part of his neck."
    },
    {
      "verse": "17",
      "text": "Then she handed Jacob the meal and the bread she had baked."
    },
    {
      "verse": "18",
      "text": "He went to his father and said, 'My father.' And he said, 'I'm here. Who you is, my son?'"
    },
    {
      "verse": "19",
      "text": "Jacob said to his father, 'It's me, Esau, your firstborn. I did the thing. Sit up and eat my slay so you can bless me.'"
    },
    {
      "verse": "20",
      "text": "Isaac asked, 'How'd you secure the bag so fast, son?' He replied, 'Because the LORD your God made it happen for me.'"
    },
    {
      "verse": "21",
      "text": "Then Isaac said to Jacob, 'Come closer, my son, so I can touch you and see if you're for real or just bussing my cap.'"
    },
    {
      "verse": "22",
      "text": "So Jacob moved closer, and Isaac touched him and said, 'The voice is giving Jacob, but the hands are giving Esau.'"
    },
    {
      "verse": "23",
      "text": "He didn't recognize him because his hands were hairy like his brother Esau's hands, so he blessed him."
    },
    {
      "verse": "24",
      "text": "He asked, 'Are you really my son Esau?' And he said, 'I am.'"
    },
    {
      "verse": "25",
      "text": "He said, 'Serve me, son, so I can eat your game and bless you.' So he served him, and he ate. He also brought him wine, and he drank."
    },
    {
      "verse": "26",
      "text": "Then his father Isaac said, 'Come here and give me some sugar, my son.'"
    },
    {
      "verse": "27",
      "text": "So he went and kissed him. When Isaac smelled his clothes, he blessed him, 'OMG, the scent of my son is like a field the LORD has blessed.'"
    },
    {
      "verse": "28",
      "text": "May God give you heaven's drip and earth's main character energy—plenty of grain and new wine."
    },
    {
      "verse": "29",
      "text": "Let nations serve you and people bow down. Be the main character over your brothers, and may your mother's sons bow to you. Those who curse you are cancelled; those who bless you are so valid.'"
    },
    {
      "verse": "30",
      "text": "After Isaac finished blessing Jacob and Jacob had just left, his brother Esau came back from his hunt."
    },
    {
      "verse": "31",
      "text": "He also cooked a meal and brought it to his father. He said, 'Let my father get up and eat his son's game so you can bless me.'"
    },
    {
      "verse": "32",
      "text": "His father Isaac asked him, 'Who are you?' He answered, 'I am your son, your firstborn, Esau.'"
    },
    {
      "verse": "33",
      "text": "Isaac started trembling violently and was so shook. 'Who was it then,' he asked, 'that bagged the game and brought it to me? I ate it just before you came and blessed him—and he's blessed, for real.'"
    },
    {
      "verse": "34",
      "text": "When Esau heard his father's words, he let out a loud, bitter cry and said to his father, 'Bless me—me too, my father!'"
    },
    {
      "verse": "35",
      "text": "But he said, 'Your brother came with the ultimate rizz and took your blessing.'"
    },
    {
      "verse": "36",
      "text": "Esau said, 'Isn't he rightly named Jacob? He's finessed me twice now: He took my birthright, and now he's taken my blessing!' Then he asked, 'Haven't you saved any W for me?'"
    },
    {
      "verse": "37",
      "text": "Isaac answered Esau, 'I have made him the main character over you and made all his family his squad; I've secured his bag with grain and new wine. So what can I even do for you, my son?'"
    },
    {
      "verse": "38",
      "text": "Esau said to his father, 'Do you only have one blessing, dad? Bless me too, my father!' And Esau wept."
    },
    {
      "verse": "39",
      "text": "His father Isaac answered, 'Your home will be away from the earth's main character energy, away from the dew of heaven above.'"
    },
    {
      "verse": "40",
      "text": "You will live by the sword and serve your brother. But when you can't even, you will throw his yoke off your neck.'"
    },
    {
      "verse": "41",
      "text": "Esau was so salty at Jacob because of the blessing. He said to himself, 'The days of mourning for my father are coming; then I'm gonna end my brother Jacob.'"
    },
    {
      "verse": "42",
      "text": "When Rebekah got the tea about her older son Esau's plot, she sent for Jacob and said, 'Your brother Esau is planning to end your whole career.'"
    },
    {
      "verse": "43",
      "text": "So now, son, listen to me: Flee to my brother Laban in Harran, ASAP."
    },
    {
      "verse": "44",
      "text": "Stay with him for a bit until your brother's main character energy chills out."
    },
    {
      "verse": "45",
      "text": "When your brother isn't so pressed and forgets what you did, I'll send for you. Why should I lose both of you in one day?'"
    },
    {"verse": "46","text": "Then Rebekah said to Isaac, 'I'm so over my life because of these Hittite women. If Jacob also marries a local girl, I'm gonna lose it.'"}]},
{
  "chapter": "28",
  "verses": [
    { "verse": "1", "text": "So Isaac called Jacob, blessed him, and gave him the ultimate directive: 'Don't wife up any of the locals.'" },
    { "verse": "2", "text": "'Go to Paddan Aram, to the fam compound. Get yourself a wife from there, one of your uncle's daughters.'" },
    { "verse": "3", "text": "'And may God Almighty bless you with the ultimate glow-up—make you a whole nation.'" },
    { "verse": "4", "text": "'He gave Abraham that W, now it's your turn. This land is yours.'" },
    {  "verse": "5",  "text": "And so Jacob pulled up from Beersheba and started the journey to Paddan Aram to stay with his uncle Laban." },
  {  "verse": "6",  "text": "Esau saw that Isaac blessed Jacob and sent him off to find a wife, and that he was given the strict order not to marry locals." },
  {  "verse": "7", "text": "He also noted that Jacob obeyed his parents' directive." },
  {  "verse": "8", "text": "Esau realized his Canaanite wives were a major ick to his parents, which was his L."  },
  {  "verse": "9",  "text": "So Esau went to Ishmael and married Mahalath, Ishmael's daughter, in addition to the wives he already had." },
    { "verse": "10", "text": "Then he had this dream: A massive staircase was set up on the earth, reaching all the way to the heavens, and God's angels were going up and down it." },
    { "verse": "11", "text": "And there was GOD, standing right beside him, and He said: 'I am the LORD, the God of your father Abraham and the God of Isaac.'" },
    { "verse": "12", "text": "'The land you're sleeping on? I'm giving it to you and your descendants.'" },
    { "verse": "13", "text": "'Your offspring will be like the dust of the earth—you're gonna spread everywhere.'" },
    { "verse": "14", "text": "'And get this: Everyone on earth will get blessed through you and your seed. It's a universal W.'" },
    { "verse": "15", "text": "'Look, I am with you. I've got your back on this whole journey. I will never leave you on read. I'm gonna see this through.'" },
    { "verse": "16", "text": "Then Jacob woke up from his nap and was like, 'Yo, God is literally in this place and I totally slept through it.'" },
    { "verse": "17", "text": "He was low-key shook. 'This is not a regular spot,' he said. 'This is God's front door. This is the main gateway to heaven.'" },
    { "verse": "18", "text": "Jacob got up early, took the stone he used as a pillow, set it up as a sacred pillar, and anointed it with oil." },
    { "verse": "19", "text": "He named that place Bethel, though the town's original name was Luz." },
    { "verse": "20", "text": "Then Jacob made a vow: 'If God really has my back on this trip, gives me food to eat and clothes to wear,'" },
    { "verse": "21", "text": "'and I make it back to my father's house in one piece, then the LORD will be my God.'" },
    { "verse": "22", "text": "'And this stone I set up will be God's spot. And I'm giving you a full ten percent of everything you bless me with. No cap.'" }]},
  {
  "chapter": "29",
  "verses": [
    { "verse": "1", "text": "Then Jacob kept it pushing to the land of the eastern folks." },
    { "verse": "2", "text": "He saw a field with a well and three flocks of sheep posted up nearby." },
    { "verse": "3", "text": "They used to roll the stone off the well's mouth when all the flocks were gathered, then put it back after watering." },
    { "verse": "4", "text": "Jacob asked them, 'Y'all from around here?' They said, 'We're from Haran.'" },
    { "verse": "5", "text": "He asked, 'You know Laban?' They said, 'We know him.'" },
    { "verse": "6", "text": "He asked, 'Is he good?' They said, 'He's good. Actually, that's his daughter Rachel coming with the sheep now.'" },
    { "verse": "7", "text": "Jacob said, 'It's still broad daylight, not even flock-gathering time. Why not water the sheep and let them graze?'" },
    { "verse": "8", "text": "They said, 'We can't until all the flocks are gathered and the stone gets rolled off the well.'" },
    { "verse": "9", "text": "While he was still talking with them, Rachel arrived with her father's sheep." },
    { "verse": "10", "text": "When Jacob saw Rachel with Laban's sheep, he went full main character energy and single-handedly rolled the stone off the well." },
    { "verse": "11", "text": "Then he kissed Rachel and cried real tears." },
    { "verse": "12", "text": "He told her, 'I'm your dad's relative, Rebekah's son.' She ran and told her father." },
    { "verse": "13", "text": "When Laban heard about Jacob his sister's son, he ran to meet him, hugged him, and brought him home." },
    { "verse": "14", "text": "After Jacob had been there a whole month," },
    { "verse": "15", "text": "Laban said, 'Just because you're my relative doesn't mean you work for free. What's your price?'" },
    { "verse": "16", "text": "Now Laban had two daughters: Leah (the oldest) and Rachel (the youngest)." },
    { "verse": "17", "text": "Leah had a soft look, but Rachel was absolutely stunning." },
    { "verse": "18", "text": "Jacob was in love with Rachel, so he said, 'I'll work for you seven years for Rachel.'" },
    { "verse": "19", "text": "Laban said, 'Better you than some random guy. Stay with me.'" },
    { "verse": "20", "text": "So Jacob worked seven years for Rachel, but it felt like nothing because he was so in love." },
    { "verse": "21", "text": "Then Jacob said to Laban, 'My time's up. Let me marry Rachel.'" },
    { "verse": "22", "text": "So Laban threw a big wedding feast." },
    { "verse": "23", "text": "But that evening, he brought Leah to Jacob instead, and Jacob was with her." },
    { "verse": "24", "text": "Laban gave his servant Zilpah to Leah as her maid." },
    { "verse": "25", "text": "Morning came, and Jacob saw it was Leah. He confronted Laban: 'What did you do? I worked for Rachel! Why did you play me?'" },
    { "verse": "26", "text": "Laban said, 'Around here, we don't let the younger sister marry before the oldest.'" },
    { "verse": "27", "text": "Finish this wedding week with Leah, then I'll give you Rachel too—for another seven years of work.'" },
    { "verse": "28", "text": "Jacob agreed. After the week with Leah, Laban gave him Rachel." },
    { "verse": "29", "text": "Laban gave his servant Bilhah to Rachel as her maid." },
    { "verse": "30", "text": "So Jacob was with Rachel too, and he loved Rachel more than Leah. He worked another seven years for Laban." },
    { "verse": "31", "text": "When the LORD saw Leah was unloved, he opened her womb, but Rachel was barren." },
    { "verse": "32", "text": "Leah got pregnant and had a son named Reuben, saying, 'The LORD saw my pain.'" },
    { "verse": "33", "text": "She got pregnant again with Simeon, saying, 'The LORD heard I'm unloved.'" },
    { "verse": "34", "text": "She got pregnant again with Levi, saying, 'Now my husband will be attached to me.'" },
    { "verse": "35", "text": "She got pregnant again with Judah, saying, 'This time I'll praise the LORD.' Then she stopped having children." }
  ]},
  {
  "chapter": "30",
  "verses": [
    { "verse": "1", "text": "Rachel was straight-up sad—no kids yet. She told Jacob, ‘If I don’t get children, I’m done. Dead serious.’" },
    { "verse": "2", "text": "Jacob got frustrated and said, ‘Am I God? Chill, Rachel.’" },
    { "verse": "3", "text": "Rachel said, ‘Here, take my servant Bilhah. She’ll have kids for me.’ Jacob agreed." },
    { "verse": "4", "text": "Bilhah had a son, and Rachel said, ‘God heard me!’ She named him Dan." },
    { "verse": "5", "text": "Bilhah had another son. Rachel named him Naphtali." },
    { "verse": "6", "text": "Leah saw she was losing attention, so she gave Jacob her servant Zilpah." },
    { "verse": "7", "text": "Zilpah had a son. Leah said, ‘Gad!’ flexing on Rachel." },
    { "verse": "8", "text": "Then Zilpah had another son, Asher." },
    { "verse": "9", "text": "Leah had Issachar and felt God noticed her struggle." },
    { "verse": "10", "text": "Then she had Zebulun." },
    { "verse": "11", "text": "Leah had another daughter, Dinah." },
    { "verse": "12", "text": "Reuben, her firstborn, had found some mandrakes in the field and gave them to Leah." },
    { "verse": "13", "text": "Rachel said, ‘Trade me some mandrakes or I get no bed tonight.’ Leah agreed—‘Fine, share the bed and take them.’" },
    { "verse": "14", "text": "Leah had more kids: Issachar and Zebulun (if following exact verse flow, counting Dinah separately)." },
    { "verse": "15", "text": "God remembered Rachel. She finally had Joseph and said, ‘God has heard me!’" },
    { "verse": "16", "text": "Jacob asked to leave Laban and return to his land." },
    { "verse": "17", "text": "Laban said, ‘Not yet, we need to agree on the flocks first.’" },
    { "verse": "18", "text": "Jacob suggested that he take all the spotted, speckled, and dark sheep for himself, leaving the plain ones for Laban." },
    { "verse": "19", "text": "Laban agreed but tried to cheat by removing all streaked or spotted animals from the flock, keeping only solid ones." },
    { "verse": "20", "text": "Jacob used clever breeding: he peeled off branches from poplar, almond, and plane trees, exposing them in the watering troughs." },
    { "verse": "21", "text": "Whenever the stronger sheep came to mate, they saw the streaked branches and bore spotted or streaked offspring." },
    { "verse": "22", "text": "Jacob separated these offspring for himself, stacking his flock, while Laban got only the plain ones." },
    { "verse": "23", "text": "The LORD blessed Jacob’s flocks, so they multiplied like crazy." },
    { "verse": "24", "text": "Rachel named her son Joseph, saying, ‘May the LORD add another son to me!’" },
    { "verse": "25", "text": "Jacob became extremely prosperous, with huge flocks, servants, and wealth." },
    { "verse": "26", "text": "Laban saw Jacob’s success and realized God was blessing him, not him." },
    { "verse": "27", "text": "Jacob’s clever branch strategy kept working—he stayed ahead of Laban." },
    { "verse": "28", "text": "Jacob’s flocks thrived—strong, healthy, and multiplied beyond measure." },
    { "verse": "29", "text": "The LORD blessed Jacob for the work he had done." },
    { "verse": "30", "text": "Jacob’s reputation as a skilled and blessed herdsman grew." },
    { "verse": "31", "text": "Even when Laban tried to outsmart him, Jacob kept winning." },
    { "verse": "32", "text": "Jacob’s wealth and flocks expanded, life on God-level glow-up." },
    { "verse": "33", "text": "Jacob kept separating strong flocks from weak ones, using God’s guidance." },
    { "verse": "34", "text": "Jacob’s strategy with the streaked branches worked every season." },
    { "verse": "35", "text": "God kept blessing him, multiplying the flocks more than Laban could manage." },
    { "verse": "36", "text": "Laban noticed he couldn’t outsmart Jacob." },
    { "verse": "37", "text": "Jacob’s wealth kept growing—cows, sheep, servants, everything stacked." },
    { "verse": "38", "text": "The LORD’s favor was on him in every way he worked." },
    { "verse": "39", "text": "Jacob’s life and family thrived, a clear God-blessed victory." },
    { "verse": "40", "text": "He became a legend among herdsmen and families alike." },
    { "verse": "41", "text": "The LORD continued blessing Jacob beyond expectation." },
    { "verse": "42", "text": "Jacob left Laban fully blessed, victorious in every plan." },
    { "verse": "43", "text": "The chapter ends with Jacob’s life stacked, his family, flocks, and God’s favor all confirmed." }
  ]
},
      {
  "chapter": "31",
  "verses": [
    { "verse": "1", "text": "Jacob heard Laban’s sons saying, ‘Yo, Jacob stole everything Dad built—man’s taken the whole bag!’" },
    { "verse": "2", "text": "He noticed Laban’s vibe had switched up—no more friendly energy like before." },
    { "verse": "3", "text": "Then the LORD said, ‘Time to dip. Head back home to your land and fam. I got you.’" },
    { "verse": "4", "text": "So Jacob called Rachel and Leah to the field where his flocks were chillin’." },
    { "verse": "5", "text": "He said, ‘Y’all can see your dad’s mood. He ain’t rockin’ with me no more, but God’s been with me heavy.’" },
    { "verse": "6", "text": "‘Y’all know I’ve been putting in work for your pops—straight loyalty.’" },
    { "verse": "7", "text": "‘But dude keeps changing my paycheck every time he breathes. Still, God never let him L me.’" },
    { "verse": "8", "text": "‘Whenever he said, “Speckled ones are your pay,” boom—those flocks blew up speckled. When he said, “Striped ones,” same thing. God flipped it.’" },
    { "verse": "9", "text": "‘Basically, God took his animals and transferred them to me. Divine crypto drop.’" },
    { "verse": "10", "text": "‘One time during breeding season, I had this dream—rams jumpin’ on the flock were all striped, speckled, and spotted.’" },
    { "verse": "11", "text": "‘Then God’s angel pulled up in the dream like, “Jacob!” I said, “I’m here.”’" },
    { "verse": "12", "text": "‘He said, “Look—every ram is striped, speckled, and spotted. I saw how Laban’s been scamming you.”’" },
    { "verse": "13", "text": "‘“I’m the God of Bethel—where you poured oil on that stone and made your vow. Get up, dip from here, and go back home.”’" },
    { "verse": "14", "text": "Rachel and Leah said, ‘Do we even have any inheritance left in Dad’s house?’" },
    { "verse": "15", "text": "‘He treated us like strangers—sold us off and spent our bride price like it was pocket change.’" },
    { "verse": "16", "text": "‘Whatever God took from our dad basically belongs to us and our kids. So do what God told you.’" },
    { "verse": "17", "text": "So Jacob packed up, got his wives and kids ready, and mounted the camels." },
    { "verse": "18", "text": "He rounded up all his livestock and property—everything he’d earned in Paddan-Aram—and headed to Canaan to his dad Isaac." },
    { "verse": "19", "text": "While Laban was off shearing sheep, Rachel swiped her dad’s household idols. 👀" },
    { "verse": "20", "text": "Jacob ghosted Laban the Aramean—didn’t tell him he was dipping." },
    { "verse": "21", "text": "He grabbed all his stuff, crossed the Euphrates, and started heading for Gilead." },
    { "verse": "22", "text": "Three days later, Laban got word that Jacob had gone ghost." },
    { "verse": "23", "text": "He took his crew—his relatives—and chased him for seven days straight. Caught up with him in the hills of Gilead." },
    { "verse": "24", "text": "But God pulled up in Laban’s dream like, ‘Don’t say anything wild to Jacob—good or bad.’" },
    { "verse": "25", "text": "Laban finally caught Jacob. Jacob had already set up camp in the hills; Laban camped nearby with his squad." },
    { "verse": "26", "text": "Laban said, ‘Bro, what’s this? You ran off like a thief, kidnapped my daughters, and dipped on me?’" },
    { "verse": "27", "text": "‘Why’d you sneak off? You could’ve at least said bye—we’d have thrown a send-off with music, tambourines, and harps!’" },
    { "verse": "28", "text": "‘You didn’t even let me kiss my grandkids or daughters bye. That’s foul.’" },
    { "verse": "29", "text": "‘I could hurt you, but God showed up last night like, “Don’t mess with Jacob.”’" },
    { "verse": "30", "text": "‘I get you missed home, but why you steal my gods?’" },
    { "verse": "31", "text": "Jacob said, ‘Honestly, I was scared. I thought you’d take your daughters from me by force.’" },
    { "verse": "32", "text": "‘Whoever’s got your gods, they’re dead meat. Search anywhere—if you find them, they’re yours.’ He didn’t know Rachel had them though." },
    { "verse": "33", "text": "Laban searched Jacob’s tent, Leah’s, the servants’ tents, and Rachel’s too." },
    { "verse": "34", "text": "Rachel had put the idols inside a camel saddle and sat on it. Laban checked everywhere but not under her." },
    { "verse": "35", "text": "She said, ‘Sorry Dad, I can’t get up—I’m on my monthly time.’ So he missed the idols completely." },
    { "verse": "36", "text": "Jacob got mad and started venting to Laban: ‘What’s my crime? What sin did I commit for you to chase me down?’" },
    { "verse": "37", "text": "‘You’ve searched all my stuff—find one thing of yours here. Put it out front so everyone can judge between us.’" },
    { "verse": "38", "text": "‘I’ve worked for you twenty years—your sheep and goats never miscarried, and I never ate a single ram of yours.’" },
    { "verse": "39", "text": "‘If an animal got attacked, I covered the loss myself. You always made me pay—day or night.’" },
    { "verse": "40", "text": "‘Out there I froze at night, burned in the day—sleep was rare, bro.’" },
    { "verse": "41", "text": "‘Twenty years in your house: fourteen for your daughters, six for your flocks. You changed my pay ten times!’" },
    { "verse": "42", "text": "‘If the God of my dad, the God of Abraham and Fear of Isaac, wasn’t with me, you’d’ve sent me off broke. But God saw my grind and came through last night.’" },
    { "verse": "43", "text": "Laban answered, ‘The daughters are mine, the kids are mine, the flocks are mine—everything you see is mine. But what can I do now? They’re your family.’" },
    { "verse": "44", "text": "‘Let’s make a peace pact—you and me—and let God be the witness.’" },
    { "verse": "45", "text": "So Jacob grabbed a stone and set it up as a memorial pillar." },
    { "verse": "46", "text": "He told his relatives, ‘Pick up stones.’ They made a pile and ate beside it to seal the deal." },
    { "verse": "47", "text": "Laban called it Jegar Sahadutha; Jacob called it Galeed. Both mean ‘witness heap.’" },
    { "verse": "48", "text": "Laban said, ‘This pile stands as witness between us today.’ So they named it Galeed," },
    { "verse": "49", "text": "and Mizpah, saying, ‘May the LORD watch between us when we’re apart.’" },
    { "verse": "50", "text": "‘If you mistreat my daughters or marry others, even if I’m not around, God’s watching.’" },
    { "verse": "51", "text": "‘Here’s the stone pile and pillar I’ve set between us.’" },
    { "verse": "52", "text": "‘This pile is a witness—I won’t cross to harm you, you won’t cross to harm me.’" },
    { "verse": "53", "text": "‘May the God of Abraham and Nahor judge between us.’ Jacob swore by the Fear of Isaac." },
    { "verse": "54", "text": "Jacob sacrificed on the mountain and invited everyone to eat. They all ate and chilled the night there." },
    { "verse": "55", "text": "Early next morning, Laban kissed his kids and daughters goodbye, blessed them, and went back home." }
  ]},
    {
  "chapter": "32",
  "verses": [
    {
      "verse": "1",
      "text": "Jacob kept it moving, and boom — angels of God pulled up on him on the road."
    },
    {
      "verse": "2",
      "text": "When he saw them, he was like, ‘Ayo this spot lowkey God’s squad zone,’ and he named the place Mahanaim."
    },
    {
      "verse": "3",
      "text": "Then Jacob sent messengers ahead to Esau, his brother, who was chilling in Seir, in the land of Edom."
    },
    {
      "verse": "4",
      "text": "He told them, ‘Tell my lord Esau, your servant Jacob says: I’ve been vibing with Laban this whole time till now.’"
    },
    {
      "verse": "5",
      "text": "‘I got oxen, donkeys, sheep, servants, all that — I’m just tryna pull up humble so you can chill with me in peace.’"
    },
    {
      "verse": "6",
      "text": "The messengers came back saying, ‘Esau’s on his way to meet you — and bro’s rolling with 400 men.’"
    },
    {
      "verse": "7",
      "text": "Jacob instantly panicked — fear levels maxed out. He split the people, livestock, and all his stuff into two squads."
    },
    {
      "verse": "8",
      "text": "He said, ‘If Esau pulls up and smokes one group, at least the other might dip and survive.’"
    },
    {
      "verse": "9",
      "text": "Then Jacob prayed, ‘God of my granddad Abraham and my pops Isaac, You told me to go back home and You’d hook me up.’"
    },
    {
      "verse": "10",
      "text": "‘I’m not even worthy of all the love and mercy You’ve thrown my way. When I crossed this river I had nothing but a stick — now look at me, two whole camps.’"
    },
    {
      "verse": "11",
      "text": "‘Save me, please, from my brother Esau. I’m scared he’ll roll up and destroy everyone — me, the moms, and the kids.’"
    },
    {
      "verse": "12",
      "text": "‘But You said You’d bless me and make my descendants pop off like the sand on the beach — uncountable.’"
    },
    {
      "verse": "13",
      "text": "So Jacob camped there that night and picked out gifts for Esau to calm things down."
    },
    {
      "verse": "14",
      "text": "He packed 200 female goats, 20 male goats, 200 ewes, 20 rams,"
    },
    {
      "verse": "15",
      "text": "30 female camels with their babies, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys."
    },
    {
      "verse": "16",
      "text": "He handed them to his servants, one herd per servant, and told them, ‘Go ahead of me and keep some space between each herd.’"
    },
    {
      "verse": "17",
      "text": "He told the first guy, ‘If Esau asks, “Who do you belong to? Where you going? Who owns these animals?”"
    },
    {
      "verse": "18",
      "text": "say, “They belong to your servant Jacob. He’s sending these gifts ahead for my lord Esau. He’s right behind us.”’"
    },
    {
      "verse": "19",
      "text": "He told the second and third and all the others the same script — ‘Say this when you see Esau.’"
    },
    {
      "verse": "20",
      "text": "He thought, ‘Maybe if I soften him up with gifts first, by the time he sees me, he won’t be mad.’"
    },
    {
      "verse": "21",
      "text": "So the gifts went ahead while Jacob spent the night in the camp."
    },
    {
      "verse": "22",
      "text": "That night Jacob got up, took his two wives, two servants, and his eleven kids, and crossed the Jabbok River."
    },
    {
      "verse": "23",
      "text": "After helping them cross, he sent over everything he owned."
    },
    {
      "verse": "24",
      "text": "So Jacob was alone. Then — outta nowhere — a man started wrestling him till dawn."
    },
    {
      "verse": "25",
      "text": "When the man saw he couldn’t beat Jacob, he hit his hip socket, and Jacob’s hip went outta place while they wrestled."
    },
    {
      "verse": "26",
      "text": "The man said, ‘Let me go, the sun’s coming up.’ But Jacob said, ‘Nah, not until you bless me.’"
    },
    {
      "verse": "27",
      "text": "The man asked, ‘What’s your name?’ He said, ‘Jacob.’"
    },
    {
      "verse": "28",
      "text": "The man said, ‘Not anymore. You’re Israel now — because you fought with God and humans and came out on top.’"
    },
    {
      "verse": "29",
      "text": "Then Jacob said, ‘Tell me your name.’ But he said, ‘Why you asking my name?’ and blessed him there."
    },
    {
      "verse": "30",
      "text": "Jacob named the place Peniel, saying, ‘I saw God face-to-face, and I’m still alive.’"
    },
    {
      "verse": "31",
      "text": "The sun came up as he passed Peniel, and he was limping from his hip."
    },
    {
      "verse": "32",
      "text": "That’s why even today, Israelites don’t eat the hip tendon — ‘cause that’s where God touched Jacob’s hip."
    }] },
{
  "chapter": "33",
  "verses": [
    {
      "verse": "1",
      "text": "Jacob looked up and saw Esau coming with 400 men deep — bro had a whole squad rolling with him 💀."
    },
    {
      "verse": "2",
      "text": "Jacob split the fam into groups — the servants with their kids first, then Leah and hers, and finally Rachel and Joseph in the back."
    },
    {
      "verse": "3",
      "text": "Then Jacob walked ahead, bowing seven times as he approached Esau — pure humility vibes 🫡."
    },
    {
      "verse": "4",
      "text": "But Esau ran up, hugged him tight, and started crying. Bros actually reconciled. 😭🤝"
    },
    {
      "verse": "5",
      "text": "Esau looked around and said, ‘Yo, who all these people?’ Jacob said, ‘They’re the fam God blessed me with.’"
    },
    {
      "verse": "6",
      "text": "Then the servant wives came forward with their kids and bowed."
    },
    {
      "verse": "7",
      "text": "Leah and her kids came up next and bowed, then Rachel and Joseph followed suit."
    },
    {
      "verse": "8",
      "text": "Esau asked, ‘What’s with all those animals I saw earlier?’ Jacob said, ‘A lil gift for you, bro — peace offering.’ 🎁"
    },
    {
      "verse": "9",
      "text": "Esau said, ‘Bro, I got plenty. Keep your stuff.’"
    },
    {
      "verse": "10",
      "text": "Jacob replied, ‘Please take it. Seeing your face again feels like seeing the favor of God Himself.’ 🙏"
    },
    {
      "verse": "11",
      "text": "‘Accept this blessing from me — God’s been good, and I’ve got enough too.’ So Esau accepted it."
    },
    {
      "verse": "12",
      "text": "Esau said, ‘Let’s roll together. I’ll walk with you.’"
    },
    {
      "verse": "13",
      "text": "But Jacob said, ‘Bro, the kids and animals move slow. If I push too hard, they’ll collapse.’"
    },
    {
      "verse": "14",
      "text": "‘You go ahead — I’ll catch up at a chill pace to Seir.’"
    },
    {
      "verse": "15",
      "text": "Esau said, ‘At least lemme leave some of my guys with you.’ Jacob said, ‘Nah bro, it’s cool. Just your kindness is enough.’"
    },
    {
      "verse": "16",
      "text": "So Esau dipped back to Seir that same day."
    },
    {
      "verse": "17",
      "text": "Jacob, though, went to Succoth, built himself a crib, and made shelters for his animals. That’s why the place was called Succoth (‘Shelters’)."
    },
    {
      "verse": "18",
      "text": "Later, Jacob rolled safely into Shechem in Canaan and set up camp near the city."
    },
    {
      "verse": "19",
      "text": "He bought a piece of land from the sons of Hamor (Shechem’s dad) for 100 silver coins. 💰"
    },
    {
      "verse": "20",
      "text": "Then he built an altar there and called it *El-Elohe-Israel* — ‘God, the God of Israel.’ 🙌"
    }]},
{
  "chapter": "34",
  "verses": [
    {
      "verse": "1",
      "text": "One day, Dinah — Jacob and Leah’s daughter — went out to vibe with the local girls in the area."
    },
    {
      "verse": "2",
      "text": "But Shechem, the prince of that region, saw her, took her, and did her dirty. Not it, chief. ❌"
    },
    {
      "verse": "3",
      "text": "After that, dude started acting like he ‘loved’ her and wanted her as his wife. Confused energy tbh."
    },
    {
      "verse": "4",
      "text": "He told his dad Hamor, ‘Bro, get me that girl as my wife.’"
    },
    {
      "verse": "5",
      "text": "Jacob heard about what happened but stayed silent until his sons came home from the fields. He was waiting to move wisely."
    },
    {
      "verse": "6",
      "text": "Then Hamor, Shechem’s dad, pulled up to talk with Jacob."
    },
    {
      "verse": "7",
      "text": "When Jacob’s sons came home and found out, they were *heated*. What Shechem did was evil and a full violation of Israel’s honor."
    },
    {
      "verse": "8",
      "text": "Hamor tried to talk peace: ‘My son’s heart is attached to your daughter. Please let him marry her.’"
    },
    {
      "verse": "9",
      "text": "‘Let’s intermarry! You give us your daughters, we’ll give you ours — let’s be one big fam.’"
    },
    {
      "verse": "10",
      "text": "‘You can live anywhere among us, trade freely, own land — all good vibes.’"
    },
    {
      "verse": "11",
      "text": "Shechem even begged her family, ‘Whatever bride price you want, I’ll pay double — just let her be mine.’"
    },
    {
      "verse": "12",
      "text": "‘Ask for any gift, any price. I’ll drop the bag.’ 💰"
    },
    {
      "verse": "13",
      "text": "Jacob’s sons answered him deceitfully ‘cause of what he did to Dinah."
    },
    {
      "verse": "14",
      "text": "They said, ‘We can’t give our sister to someone uncircumcised. That’s against our code.’"
    },
    {
      "verse": "15",
      "text": "‘But if every man among you gets circumcised, we’ll talk.’"
    },
    {
      "verse": "16",
      "text": "‘Then we can intermarry and live together as one people.’"
    },
    {
      "verse": "17",
      "text": "‘But if you don’t, we’re out — Dinah’s coming home with us.’"
    },
    {
      "verse": "18",
      "text": "Hamor and Shechem liked that proposal — they were too in their feelings to think straight."
    },
    {
      "verse": "19",
      "text": "Shechem didn’t waste time — he got circumcised that same day because he really wanted Dinah. 💀"
    },
    {
      "verse": "20",
      "text": "Then Hamor and Shechem called a town meeting with all the men."
    },
    {
      "verse": "21",
      "text": "They said, ‘These guys are peaceful — let’s let them live here and trade with us. The land’s big enough for all of us.’"
    },
    {
      "verse": "22",
      "text": "‘Only catch — every man here has to get circumcised like they are. Then their stuff, cattle, and property will be ours too.’"
    },
    {
      "verse": "23",
      "text": "‘So let’s do it — it’s a win-win.’"
    },
    {
      "verse": "24",
      "text": "Every man in the city agreed and got circumcised. No hesitation. 😬"
    },
    {
      "verse": "25",
      "text": "Three days later, when they were all sore and weak, Simeon and Levi — Dinah’s brothers — rolled up with swords and wiped out every male in the city. ⚔️"
    },
    {
      "verse": "26",
      "text": "They killed Hamor and Shechem, rescued Dinah, and bounced."
    },
    {
      "verse": "27",
      "text": "Then Jacob’s other sons came in and looted the city — payback for what was done to their sister."
    },
    {
      "verse": "28",
      "text": "They took flocks, herds, donkeys, whatever was in town and in the fields."
    },
    {
      "verse": "29",
      "text": "They grabbed everything — wealth, wives, kids, all of it. Nothing left behind."
    },
    {
      "verse": "30",
      "text": "Then Jacob said to Simeon and Levi, ‘Y’all just brought trouble on me! The Canaanites and Perizzites are gonna come for us. We’re few in number — they’ll wipe us out!’"
    },
    {
      "verse": "31",
      "text": "But the brothers said, ‘Should we have just let him treat our sister like trash? Nah.’"
    }]},
    {
  "chapter": "35",
  "verses": [
    {
      "verse": "1",
      "text": "God told Jacob, 'Go back to Bethel, settle there, and build Me an altar — the same spot where I showed up when you were running from Esau.'"
    },
    {
      "verse": "2",
      "text": "Jacob said to his squad, 'Yo, ditch every idol and fake charm y’all got. Clean yourselves up and switch your fits.'"
    },
    {
      "verse": "3",
      "text": "‘We’re heading to Bethel so I can build an altar for the God who actually pulled through when I was in crisis mode.’"
    },
    {
      "verse": "4",
      "text": "So everyone handed Jacob their idols and earrings — he buried them under an oak tree near Shechem. No turning back. ⛏️"
    },
    {
      "verse": "5",
      "text": "As they traveled, God dropped fear on every nearby town — nobody dared to mess with them. Divine security system on. 🔒"
    },
    {
      "verse": "6",
      "text": "Jacob and crew reached Luz (aka Bethel) in Canaan."
    },
    {
      "verse": "7",
      "text": "He built an altar there and called it *El-Bethel*, ‘cause that’s where God revealed Himself when Jacob was on the run."
    },
    {
      "verse": "8",
      "text": "Deborah, Rebekah’s nurse, passed away there and was buried under an oak below Bethel. Jacob named it *Allon Bakuth* (Oak of Tears)."
    },
    {
      "verse": "9",
      "text": "God appeared again to Jacob after he came back from Paddan-Aram and blessed him big time."
    },
    {
      "verse": "10",
      "text": "God said, 'Your name’s Jacob, but not anymore. You’re now Israel — new name, new legacy.' ✨"
    },
    {
      "verse": "11",
      "text": "Then God said, 'I am Almighty God — be fruitful, multiply. Nations and kings will come from you.' 👑"
    },
    {
      "verse": "12",
      "text": "‘The land I gave Abraham and Isaac, I’m handing to you and your descendants.’"
    },
    {
      "verse": "13",
      "text": "After that convo, God ascended from the spot where He talked with Jacob."
    },
    {
      "verse": "14",
      "text": "Jacob set up a stone pillar there — poured wine and oil on it as a sacred marker."
    },
    {
      "verse": "15",
      "text": "He named the place *Bethel* (House of God), ‘cause that’s where the chat with God went down."
    },
    {
      "verse": "16",
      "text": "They left Bethel, and while still a bit away from Ephrath, Rachel went into hard labor — like serious pain."
    },
    {
      "verse": "17",
      "text": "As she struggled, the midwife told her, 'Don’t stress — you’ve got another son!'"
    },
    {
      "verse": "18",
      "text": "But as Rachel was taking her last breaths, she named him *Ben-Oni* (Son of My Sorrow). Jacob renamed him *Benjamin* (Son of My Right Hand). 🕊️"
    },
    {
      "verse": "19",
      "text": "Rachel died and was buried on the road to Ephrath (aka Bethlehem)."
    },
    {
      "verse": "20",
      "text": "Jacob set a stone monument over her grave — it’s still known as Rachel’s tomb to this day."
    },
    {
      "verse": "21",
      "text": "Israel moved on and set up camp past Migdal Eder."
    },
    {
      "verse": "22",
      "text": "While they were living there, Reuben messed up and slept with Bilhah, his father’s concubine. Jacob found out — and yeah, it was bad. 💀"
    },
    {
      "verse": "23",
      "text": "Jacob’s sons: Leah’s kids — Reuben (firstborn), Simeon, Levi, Judah, Issachar, and Zebulun."
    },
    {
      "verse": "24",
      "text": "Rachel’s sons — Joseph and Benjamin."
    },
    {
      "verse": "25",
      "text": "Bilhah (Rachel’s maid) had Dan and Naphtali."
    },
    {
      "verse": "26",
      "text": "Zilpah (Leah’s maid) had Gad and Asher. All these were Jacob’s sons born in Paddan-Aram."
    },
    {
      "verse": "27",
      "text": "Jacob finally reached his dad Isaac in Mamre, near Hebron — where Abraham and Isaac had both lived."
    },
    {
      "verse": "28",
      "text": "Isaac lived to 180 years — old, full of days, and content."
    },
    {
      "verse": "29",
      "text": "Then he passed away, and his sons Esau and Jacob buried him together. Family reunion, but in grief. 🕊️"
    }]},
  {
  "chapter": "36",
  "verses": [
    {
      "verse": "1",
      "text": "Here’s the family tree of Esau (aka Edom)."
    },
    {
      "verse": "2",
      "text": "Esau had wives from the Canaanite squad: Adah (daughter of Elon the Hittite), Oholibamah (daughter of Anah and granddaughter of Zibeon the Hivite),"
    },
    {
      "verse": "3",
      "text": "and Basemath, daughter of Ishmael, who was Nebaioth’s sister."
    },
    {
      "verse": "4",
      "text": "Adah gave Esau a son named Eliphaz. Basemath dropped Reuel."
    },
    {
      "verse": "5",
      "text": "Oholibamah had Jeush, Jalam, and Korah. All these kids were born in Canaan."
    },
    {
      "verse": "6",
      "text": "Esau packed up his wives, kids, servants, animals, and wealth he got in Canaan, and dipped from Jacob’s zone."
    },
    {
      "verse": "7",
      "text": "‘Cause the land couldn’t handle both their massive herds — too many flexes in one spot. 🌾🐑"
    },
    {
      "verse": "8",
      "text": "So Esau (aka Edom) moved to the hill country of Seir."
    },
    {
      "verse": "9",
      "text": "This is the fam history of Esau, the OG of the Edomites living in Seir."
    },
    {
      "verse": "10",
      "text": "Esau’s sons: Eliphaz (by Adah) and Reuel (by Basemath)."
    },
    {
      "verse": "11",
      "text": "Eliphaz’s squad: Teman, Omar, Zepho, Gatam, and Kenaz."
    },
    {
      "verse": "12",
      "text": "Eliphaz also had a side kid with his concubine Timna—she birthed Amalek. That’s Esau’s grandson line."
    },
    {
      "verse": "13",
      "text": "Reuel’s sons: Nahath, Zerah, Shammah, and Mizzah — all from Basemath, Esau’s wife."
    },
    {
      "verse": "14",
      "text": "Oholibamah (Anah’s daughter) had Jeush, Jalam, and Korah. Those were Esau’s kids born from her."
    },
    {
      "verse": "15",
      "text": "These are the chiefs from Esau’s sons: Eliphaz (Adah’s son) had chiefs Teman, Omar, Zepho, Kenaz,"
    },
    {
      "verse": "16",
      "text": "Korah, Gatam, and Amalek. Those were Eliphaz’s crew in Edom. Big boss energy."
    },
    {
      "verse": "17",
      "text": "Reuel (Basemath’s son) had chiefs Nahath, Zerah, Shammah, and Mizzah. Each leading their squad."
    },
    {
      "verse": "18",
      "text": "Oholibamah’s sons—Jeush, Jalam, and Korah—each became chiefs too. Esau’s bloodline had leaders everywhere."
    },
    {
      "verse": "19",
      "text": "That’s Esau (Edom) and his chiefs’ lineup. Legacy secured. 💪"
    },
    {
      "verse": "20",
      "text": "Now, the original people in Seir were the Horites. Their leaders: Lotan, Shobal, Zibeon, Anah,"
    },
    {
      "verse": "21",
      "text": "Dishon, Ezer, and Dishan. OG chiefs from Seir’s land."
    },
    {
      "verse": "22",
      "text": "Lotan’s sons: Hori and Hemam. Lotan’s sis was Timna."
    },
    {
      "verse": "23",
      "text": "Shobal’s sons: Alvan, Manahath, Ebal, Shepho, and Onam."
    },
    {
      "verse": "24",
      "text": "Zibeon had two sons: Aiah and Anah — the same Anah who found hot springs in the desert while herding donkeys. 🐪🔥"
    },
    {
      "verse": "25",
      "text": "Anah’s kids: Dishon and a daughter named Oholibamah."
    },
    {
      "verse": "26",
      "text": "Dishon’s sons: Hemdan, Eshban, Ithran, and Keran."
    },
    {
      "verse": "27",
      "text": "Ezer’s sons: Bilhan, Zaavan, and Akan."
    },
    {
      "verse": "28",
      "text": "Dishan’s sons: Uz and Aran."
    },
    {
      "verse": "29",
      "text": "These Horite chiefs: Lotan, Shobal, Zibeon, Anah,"
    },
    {
      "verse": "30",
      "text": "Dishon, Ezer, and Dishan — each running their own turf in Seir."
    },
    {
      "verse": "31",
      "text": "Before Israel ever had kings, these are the kings who ruled in Edom:"
    },
    {
      "verse": "32",
      "text": "Bela son of Beor ruled from Dinhabah."
    },
    {
      "verse": "33",
      "text": "Bela died, Jobab son of Zerah from Bozrah took over."
    },
    {
      "verse": "34",
      "text": "Jobab died, Husham from the land of the Temanites became king."
    },
    {
      "verse": "35",
      "text": "Husham died, Hadad son of Bedad (who clapped the Midianites in Moab’s field) reigned after him. City: Avith."
    },
    {
      "verse": "36",
      "text": "Hadad died, Samlah from Masrekah reigned."
    },
    {
      "verse": "37",
      "text": "Samlah died, Shaul from Rehoboth on the River took the throne."
    },
    {
      "verse": "38",
      "text": "Shaul died, Baal-hanan son of Achbor became king."
    },
    {
      "verse": "39",
      "text": "Baal-hanan died, Hadar ruled next. His city was Pau, and his wife was Mehetabel (daughter of Matred, granddaughter of Mezahab)."
    },
    {
      "verse": "40",
      "text": "These were Esau’s chiefs by fam lines, places, and names: Timna, Alvah, Jetheth,"
    },
    {
      "verse": "41",
      "text": "Oholibamah, Elah, Pinon,"
    },
    {
      "verse": "42",
      "text": "Kenaz, Teman, Mibzar,"
    },
    {
      "verse": "43",
      "text": "Magdiel, and Iram. Those were the Edomite chiefs living in their zones. Esau = the OG Edom."
    }]},
{
  "chapter": "37",
  "verses": [
    {
      "verse": "1",
      "text": "So Jacob was living in Canaan — the same zone where his dad Isaac used to stay."
    },
    {
      "verse": "2",
      "text": "Here’s the tea on Jacob’s fam: Joseph was 17, working the field with his brothers, the sons of Bilhah and Zilpah. But bro kept snitching — always bringing their bad reports to dad 💀."
    },
    {
      "verse": "3",
      "text": "Jacob loved Joseph way more than all the others — ‘cause he was the kid from his old-age era. He even made him a custom colorful coat — straight designer vibes 👕✨."
    },
    {
      "verse": "4",
      "text": "When the brothers saw their dad loved Joseph more, they couldn’t stand him. No greetings, no peace — just pure beef energy."
    },
    {
      "verse": "5",
      "text": "One night, Joseph had a dream and, as usual, decided to share it — and that just leveled up the hate 😭."
    },
    {
      "verse": "6",
      "text": "He said, ‘Yo, listen to this dream I had.’"
    },
    {
      "verse": "7",
      "text": "‘We were all tying up bundles of grain in the field, and suddenly my bundle stood up — and yours all bowed to it.’"
    },
    {
      "verse": "8",
      "text": "His brothers were like, ‘So you tryna say you gon’ rule over us? King Joseph now?’ And the hate just evolved to boss-level 😤."
    },
    {
      "verse": "9",
      "text": "Then man had another dream. Bro really said, ‘Part 2 coming soon.’ This time the sun, moon, and eleven stars were bowing to him 🌞🌙✨."
    },
    {
      "verse": "10",
      "text": "He told his dad and brothers, and Jacob was like, ‘Bruh, so me, your mom, and your brothers gon’ bow to you now?’"
    },
    {
      "verse": "11",
      "text": "The brothers were salty, but Jacob lowkey kept that dream in mind like, ‘Hmm… maybe there’s somethin’ there.’"
    },
    {
      "verse": "12",
      "text": "One day, the brothers went out to graze their father’s flocks near Shechem."
    },
    {
      "verse": "13",
      "text": "Jacob told Joseph, ‘Hey, your bros are in Shechem with the flocks. Go check up on them for me.’ Joseph said, ‘Bet, I’m on it.’"
    },
    {
      "verse": "14",
      "text": "Jacob said, ‘Go see how they and the flocks are doing, then bring me word.’ So Joseph left from the Valley of Hebron to Shechem."
    },
    {
      "verse": "15",
      "text": "A random man found him wandering around, lost like, ‘Bro, what you lookin’ for?’"
    },
    {
      "verse": "16",
      "text": "Joseph said, ‘I’m lookin’ for my brothers. You know where they’re grazin’?’"
    },
    {
      "verse": "17",
      "text": "The man said, ‘Yeah, I overheard them say they’re headin’ to Dothan.’ So Joseph went after them and found them there."
    },
    {
      "verse": "18",
      "text": "They saw him from a distance — that colorful coat was loud — and before he even got close, they plotted, ‘Let’s delete this dreamer.’"
    },
    {
      "verse": "19",
      "text": "They said, ‘Here comes Mr. Dream-to-Reality.’"
    },
    {
      "verse": "20",
      "text": "‘Let’s take him out and toss him into some pit. Then we’ll say a wild animal got him. Let’s see what becomes of his dreams now.’"
    },
    {
      "verse": "21",
      "text": "But Reuben stepped up like, ‘Nah chill, don’t kill him.’ He was secretly tryna rescue Joseph later."
    },
    {
      "verse": "22",
      "text": "Reuben said, ‘Just throw him into this pit, no hands-on violence.’ He said that hoping he could come back and save him later."
    },
    {
      "verse": "23",
      "text": "So when Joseph finally arrived, they ripped off that colorful designer coat 💀."
    },
    {
      "verse": "24",
      "text": "Then they grabbed him and threw him into an empty pit — no water, no mercy."
    },
    {
      "verse": "25",
      "text": "Then they sat down to eat 💀💀💀. While eating, they saw a caravan of Ishmaelite traders heading to Egypt with all kinds of goods."
    },
    {
      "verse": "26",
      "text": "Judah said, ‘Yo, what’s the gain if we just off him and cover it up?’"
    },
    {
      "verse": "27",
      "text": "‘Let’s sell him instead. He’s our brother, our own flesh — we can at least profit off this L.’ And the brothers agreed 💸."
    },
    {
      "verse": "28",
      "text": "So when the Midianite traders passed by, they pulled Joseph out and sold him for twenty silver coins. The traders took him to Egypt."
    },
    {
      "verse": "29",
      "text": "Reuben came back later, saw Joseph gone, and tore his clothes like, ‘Nahhhh 😭.’"
    },
    {
      "verse": "30",
      "text": "He ran to his brothers yelling, ‘The boy’s gone! What am I gonna tell Dad?!’"
    },
    {
      "verse": "31",
      "text": "They took Joseph’s coat, dipped it in goat blood, and started crafting their story."
    },
    {
      "verse": "32",
      "text": "They sent the coat to Jacob and said, ‘Yo, check this. Does this look like your son’s fit?’"
    },
    {
      "verse": "33",
      "text": "Jacob recognized it instantly and said, ‘It’s my son’s coat! A wild animal must’ve devoured him!’"
    },
    {
      "verse": "34",
      "text": "He tore his clothes, put on mourning fits, and wept for days."
    },
    {
      "verse": "35",
      "text": "Everyone tried to comfort him, but Jacob refused. ‘I’ll mourn for my son till the grave,’ he said, crying nonstop."
    },
    {
      "verse": "36",
      "text": "Meanwhile in Egypt, the traders sold Joseph to Potiphar, one of Pharaoh’s top officers — the captain of the royal guard."
    }]},
{
  "chapter": "38",
  "verses": [
    {
      "verse": "1",
      "text": "Around that time, Judah dipped from his brothers and started vibing with a guy named Hirah from Adullam."
    },
    {
      "verse": "2",
      "text": "Judah saw a Canaanite baddie named Shua’s daughter, married her, and they had a whole thing going."
    },
    {
      "verse": "3",
      "text": "She gave birth to a son, and Judah named him Er."
    },
    {
      "verse": "4",
      "text": "Then she had another—named him Onan."
    },
    {
      "verse": "5",
      "text": "Then a third one—Shelah. She was at Kezib when he was born."
    },
    {
      "verse": "6",
      "text": "Judah found a wife for his first son Er. Her name was Tamar."
    },
    {
      "verse": "7",
      "text": "But Er was wildin’ out and doing evil in God’s eyes, so God said, ‘You’re done,’ and took him out."
    },
    {
      "verse": "8",
      "text": "Then Judah told Onan, ‘Go marry your brother’s widow and give your brother a kid, that’s the culture.’"
    },
    {
      "verse": "9",
      "text": "But Onan didn’t want to. He knew the child wouldn’t be counted as his, so he kept dodging that duty whenever they linked 😬."
    },
    {
      "verse": "10",
      "text": "God saw what he was doing and was not having it—so boom, gone. Onan out too."
    },
    {
      "verse": "11",
      "text": "Then Judah told Tamar, ‘Stay a widow till my son Shelah’s old enough,’ lowkey thinking, ‘I ain’t losing another son over this girl.’"
    },
    {
      "verse": "12",
      "text": "After some time, Judah’s wife died. Once he finished mourning, he went to Timnah with his bro Hirah to check on the sheep squad."
    },
    {
      "verse": "13",
      "text": "Tamar heard that her father-in-law was heading to Timnah for the sheep shearing season."
    },
    {
      "verse": "14",
      "text": "She ditched her widow outfit, covered up with a veil, and posted up at Enaim—right by the road to Timnah—‘cause she saw Shelah was grown and Judah never followed through."
    },
    {
      "verse": "15",
      "text": "Judah saw her and thought she was just some random girl for hire ‘cause of the veil. Didn’t realize it was Tamar."
    },
    {
      "verse": "16",
      "text": "He pulled up like, ‘Ayo lemme spend some time with you,’ not knowing it was his own daughter-in-law 😭."
    },
    {
      "verse": "17",
      "text": "She said, ‘Okay, but what you paying?’ Judah said, ‘I’ll send a young goat from my flock.’"
    },
    {
      "verse": "18",
      "text": "She said, ‘Cool, but give me a security deposit till then—your seal, cord, and walking stick.’ Man agreed and gave them to her."
    },
    {
      "verse": "19",
      "text": "Then she bounced, took off the veil, and put her widow clothes back on like nothing happened."
    },
    {
      "verse": "20",
      "text": "Judah sent his friend Hirah with the goat to get his stuff back from the woman, but she was gone—poof 💨."
    },
    {
      "verse": "21",
      "text": "Hirah asked around, ‘Yo, where’s that girl that was by the road at Enaim?’ Locals said, ‘Ain’t no one like that here.’"
    },
    {
      "verse": "22",
      "text": "So he went back like, ‘Bro, I couldn’t find her. The townspeople said she never existed.’"
    },
    {
      "verse": "23",
      "text": "Judah was like, ‘Aight, let her keep the stuff. I ain’t tryna be clown material over this.’"
    },
    {
      "verse": "24",
      "text": "About three months later, people told Judah, ‘Yo, Tamar’s out here wildin’—she’s pregnant.’ Judah snapped, ‘What?! Burn her!’"
    },
    {
      "verse": "25",
      "text": "As they were dragging her out, she sent word to Judah: ‘Whoever owns this seal, cord, and stick—that’s the baby’s dad.’"
    },
    {
      "verse": "26",
      "text": "Judah saw them and froze. ‘She’s more righteous than me,’ he said, ‘‘cause I didn’t give her to my son Shelah.’ He didn’t go near her again after that."
    },
    {
      "verse": "27",
      "text": "When it was time for her to give birth, turns out—she had twins on deck."
    },
    {
      "verse": "28",
      "text": "During delivery, one baby stretched out a hand, and the midwife tied a red thread on it, saying, ‘This one came out first!’"
    },
    {
      "verse": "29",
      "text": "But he pulled his hand back, and his brother popped out instead 💀. She said, ‘You really broke through!’ So they named him Perez."
    },
    {
      "verse": "30",
      "text": "Then his twin, the one with the red thread, came out, and they named him Zerah."
    }]},
{
  "chapter": "39",
  "verses": [
    {
      "verse": "1",
      "text": "Joseph got dragged to Egypt, and this Egyptian big boss named Potiphar—one of Pharaoh’s ops—bought him from the Ishmaelite traders who brought him there."
    },
    {
      "verse": "2",
      "text": "But God was vibin’ heavy with Joseph. Bro started winning even while being a slave in Potiphar’s house."
    },
    {
      "verse": "3",
      "text": "Potiphar peeped the glow—like, ‘everything this man touches turns to gold.’ He knew the LORD was backing Joseph."
    },
    {
      "verse": "4",
      "text": "So Joseph found mad favor with him, became his right-hand man, and got full management access to the whole mansion."
    },
    {
      "verse": "5",
      "text": "From the second Joseph clocked in, God blessed the whole setup—house, fields, staff, even the bread smelled richer 💀."
    },
    {
      "verse": "6",
      "text": "Potiphar just ate and chilled; Joseph handled everything. Also, bro was fine fine—like ‘scroll-stopping handsome.’"
    },
    {
      "verse": "7",
      "text": "Then Mrs. Potiphar caught feelings and was like, ‘Ayo Joseph 👀, slide in my DMs—lie with me.’"
    },
    {
      "verse": "8",
      "text": "Joseph said, ‘Nah fam. My boss trusts me with everything. I ain’t betraying that.’"
    },
    {
      "verse": "9",
      "text": "‘He’s held back nothing from me except you, ‘cause you’re his wife. So how can I do such evil and sin against God?’"
    },
    {
      "verse": "10",
      "text": "Sis kept bugging Joseph day after day, but he was dodging like Neo in the Matrix—refusing to fold."
    },
    {
      "verse": "11",
      "text": "One day Joseph went in for work, no coworkers around, bad timing fr 😭."
    },
    {
      "verse": "12",
      "text": "She grabbed his hoodie like, ‘Come here boy.’ Bro dipped so fast he left the hoodie in her hands—sprinted like he saw a ghost 👟💨."
    },
    {
      "verse": "13",
      "text": "She looked down, holding his hoodie, like, ‘Bet. Time to flip the script.’"
    },
    {
      "verse": "14",
      "text": "She called the house staff and screamed, ‘Look! That Hebrew guy came to mock me!’"
    },
    {
      "verse": "15",
      "text": "‘When I screamed, he ran out and left his hoodie beside me!’"
    },
    {
      "verse": "16",
      "text": "She kept the hoodie on standby till hubby came home—like evidence Exhibit A 😭."
    },
    {
      "verse": "17",
      "text": "Then she told Potiphar, ‘That Hebrew slave you brought tried to mess with me!’"
    },
    {
      "verse": "18",
      "text": "‘When I yelled, he dipped out leaving his hoodie.’"
    },
    {
      "verse": "19",
      "text": "When Potiphar heard the story his wife told—he was *heated.*"
    },
    {
      "verse": "20",
      "text": "So he threw Joseph into the king’s prison—basically Pharaoh’s Alcatraz—but even there, God was with him."
    },
    {
      "verse": "21",
      "text": "God gave Joseph favor again—like, man couldn’t lose. The warden started trusting him too."
    },
    {
      "verse": "22",
      "text": "Before long, Joseph was running the whole prison. Every inmate, every task—under his command. Bro was HIM even in jail 💪."
    },
    {
      "verse": "23",
      "text": "And the warden didn’t stress about anything, ‘cause God had Joseph covered. Everything he did prospered. Period."
    }]},
 {
  "chapter": "40",
  "verses": [
    {
      "verse": "1",
      "text": "Some time later, Pharaoh’s cupbearer and baker messed up big time against their king."
    },
    {
      "verse": "2",
      "text": "Pharaoh got heated at both of them — his top cup guy and his top baker."
    },
    {
      "verse": "3",
      "text": "He tossed them into the same prison Joseph was locked up in, the one run by the captain of the guard."
    },
    {
      "verse": "4",
      "text": "The captain assigned Joseph to take care of them, and they stayed there for a while — kinda like a mini-prison squad."
    },
    {
      "verse": "5",
      "text": "One night, both the cupbearer and the baker had dreams — each dream had its own strange meaning."
    },
    {
      "verse": "6",
      "text": "When Joseph checked in on them the next morning, they looked super down bad — faces on ‘life is pain’ mode."
    },
    {
      "verse": "7",
      "text": "He asked, 'Ayo, what’s wrong? Why y’all lookin’ so drained today?'"
    },
    {
      "verse": "8",
      "text": "They said, 'We had dreams, but no one can explain 'em.' Joseph was like, 'Aren’t interpretations God’s thing? Spill the dreams — maybe God will drop the answer.'"
    },
    {
      "verse": "9",
      "text": "The cupbearer went first: 'In my dream, I saw a vine in front of me.'"
    },
    {
      "verse": "10",
      "text": "It had three branches. It budded, bloomed, and its clusters ripened with grapes — like fast-forward farming."
    },
    {
      "verse": "11",
      "text": "Pharaoh’s cup was in my hand, and I squeezed the grapes into it, then handed the cup to him.'"
    },
    {
      "verse": "12",
      "text": "Joseph said, 'Okay bet — here’s the meaning: the three branches are three days.'"
    },
    {
      "verse": "13",
      "text": "In three days, Pharaoh’s gonna lift you back up — literally — and put you back in your job as his cupbearer."
    },
    {
      "verse": "14",
      "text": "But hey, when it happens, remember me. Show some kindness — mention me to Pharaoh so I can get outta this place."
    },
    {
      "verse": "15",
      "text": "I was kidnapped from my home country, and even here I got thrown into prison for no reason. I don’t belong here, bro.'"
    },
    {
      "verse": "16",
      "text": "When the baker saw Joseph gave a good interpretation, he was like, 'Aight my turn.' So he said, 'I dreamed I had three baskets of bread on my head.'"
    },
    {
      "verse": "17",
      "text": "In the top basket were all kinds of baked goods for Pharaoh, but birds came and ate 'em right off my head.'"
    },
    {
      "verse": "18",
      "text": "Joseph said, 'This one ain’t good, bro. The three baskets are three days too.'"
    },
    {
      "verse": "19",
      "text": "In three days, Pharaoh will lift off your head — literally — and the birds will eat your body.'"
    },
    {
      "verse": "20",
      "text": "Three days later, it was Pharaoh’s birthday, and he threw a big feast for all his staff. He brought the cupbearer and baker out in front of everyone."
    },
    {
      "verse": "21",
      "text": "He restored the cupbearer to his position, so he could hand Pharaoh his cup again."
    },
    {
      "verse": "22",
      "text": "But the baker? Pharaoh executed him, just like Joseph said."
    },
    {
      "verse": "23",
      "text": "But the cupbearer forgot all about Joseph — like bro didn’t even exist. Man got ghosted hard."}]},
 {
  "chapter": "41",
  "verses": [
    {
      "verse": "1",
      "text": "Two years later, Pharaoh caught this wild dream — he was chillin’ by the Nile."
    },
    {
      "verse": "2",
      "text": "Outta nowhere, seven thick cows came up from the river, munching on grass like life was good."
    },
    {
      "verse": "3",
      "text": "Then seven ugly, skinny cows pulled up right after — they looked like they hadn’t touched food in forever."
    },
    {
      "verse": "4",
      "text": "And these crusty skinny cows started eating the thick healthy ones — and Pharaoh woke up like, 'Bro what was THAT?!'"
    },
    {
      "verse": "5",
      "text": "He fell back asleep and boom — round two. This time he dreamed about seven healthy heads of grain, thick and fresh."
    },
    {
      "verse": "6",
      "text": "Then seven dry, crusty, wind-blasted heads popped up and bullied the good ones."
    },
    {
      "verse": "7",
      "text": "The weak grains swallowed the good ones, and Pharaoh woke up again like, 'Ayo nah… this gotta mean somethin.’"
    },
    {
      "verse": "8",
      "text": "Next morning he was lowkey stressed. So he summoned all the magicians and smart guys in Egypt — told 'em the dreams, but no one could decode it."
    },
    {
      "verse": "9",
      "text": "Then the cupbearer was like, 'Oh snap, I totally forgot about Joseph — my bad, king!'"
    },
    {
      "verse": "10",
      "text": "He explained how Pharaoh once locked him and the baker up — y’know, back when Pharaoh got mad."
    },
    {
      "verse": "11",
      "text": "We both had dreams that same night, and this Hebrew dude, Joseph, told us exactly what they meant."
    },
    {
      "verse": "12",
      "text": "And guess what — everything he said happened word-for-word. You restored me, and the baker? Yeah… rip."
    },
    {
      "verse": "13",
      "text": "So Pharaoh was like, 'Say less. Bring that man here!'"
    },
    {
      "verse": "14",
      "text": "They rushed Joseph out of the dungeon — he cleaned up, shaved, got fresh, and pulled up before Pharaoh."
    },
    {
      "verse": "15",
      "text": "Pharaoh told him, 'I had dreams. No one can explain 'em. But I heard you can decode dreams like it’s nothing.'"
    },
    {
      "verse": "16",
      "text": "Joseph replied, 'It’s not me, bro — God’s the One who drops the answers you need.'"
    },
    {
      "verse": "17",
      "text": "Pharaoh started explaining the dream again — cows, Nile, grass, all that déjà vu stuff."
    },
    {
      "verse": "18",
      "text": "He said, 'Seven healthy cows came out, vibing, then seven zombie-looking ones came up and straight-up ate them.'"
    },
    {
      "verse": "19",
      "text": "They were so ugly I’ve never seen anything like that in Egypt, bro."
    },
    {
      "verse": "20",
      "text": "The thin cows devoured the fat ones, but you couldn’t even tell — they still looked starved. That’s when I woke up confused."
    },
    {
      "verse": "21",
      "text": "Then came the grain dream — seven good heads, seven bad ones, bad ones ate the good ones."
    },
    {
      "verse": "22",
      "text": "Told my magicians, but yeah, no one got it right."
    },
    {
      "verse": "23",
      "text": "Joseph said, 'Pharaoh, both dreams are actually one message — God’s tryna tell you what’s coming next.'"
    },
    {
      "verse": "24",
      "text": "The seven good cows and the seven good grains? That’s seven years of abundance — pure blessing vibes."
    },
    {
      "verse": "25",
      "text": "But the seven skinny cows and crusty grains? Seven years of famine, and it’s gonna hit hard."
    },
    {
      "verse": "26",
      "text": "God’s showing you twice 'cause He’s dead serious about it — it’s locked in."
    },
    {
      "verse": "27",
      "text": "So Pharaoh, here’s the move: find a wise man, real smart, and make him in charge of the whole land."
    },
    {
      "verse": "28",
      "text": "Put people in charge under him, collect one-fifth of all crops during the good years."
    },
    {
      "verse": "29",
      "text": "Store it all up for when the bad years come — that way Egypt won’t starve."
    },
    {
      "verse": "30",
      "text": "Pharaoh and his squad were like, 'Yo… this man got wisdom straight from heaven.'"
    },
    {
      "verse": "31",
      "text": "Pharaoh said, 'Can we even find someone else who got the Spirit of God like this dude?'"
    },
    {
      "verse": "32",
      "text": "Then he told Joseph, 'Since God’s the one who revealed this to you, clearly no one’s on your level.'"
    },
    {
      "verse": "33",
      "text": "You’re in charge now. Only throne-wise, I’m higher. You got control over Egypt, big man status.'"
    },
    {
      "verse": "34",
      "text": "Pharaoh gave him his signet ring, dripped him out in royal clothes, and put a gold chain on his neck — man upgraded overnight!"
    },
    {
      "verse": "35",
      "text": "He gave Joseph his second chariot and everyone yelled 'Bow down!' as he rode through the streets."
    },
    {
      "verse": "36",
      "text": "That’s how Joseph got placed over all of Egypt — from prisoner to prime minister. God don’t play."
    },
    {
      "verse": "37",
      "text": "Pharaoh gave him a new name — Zaphenath-paneah — and even hooked him up with a wife, Asenath, daughter of a priest."
    },
    {
      "verse": "38",
      "text": "Joseph was 30 when he took that position, and he toured all around Egypt managing things."
    },
    {
      "verse": "39",
      "text": "During the seven years of plenty, crops were overflowing — Egypt was eating good fr."
    },
    {
      "verse": "40",
      "text": "Joseph collected all that surplus food and stored it in the cities, stacking up grain like it was endless."
    },
    {
      "verse": "41",
      "text": "He stored so much grain it was basically uncountable — dude had data limits on blessings 💀."
    },
    {
      "verse": "42",
      "text": "Before the famine hit, Joseph had two sons with Asenath."
    },
    {
      "verse": "43",
      "text": "First one he named Manasseh, saying, 'God helped me forget my pain and my old fam drama.'"
    },
    {
      "verse": "44",
      "text": "Second one he named Ephraim, saying, 'God made me thrive in a land where I once suffered.'"
    },
    {
      "verse": "45",
      "text": "Then the seven years of blessing wrapped up, and here came the famine — just as Joseph predicted."
    },
    {
      "verse": "46",
      "text": "Every other nation was starving, but Egypt was stocked 'cause Joseph’s plan was elite."
    },
    {
      "verse": "47",
      "text": "Pharaoh told the people, 'Go see Joseph — do whatever he says.'"
    },
    {
      "verse": "48",
      "text": "So when the famine hit every country, Egypt became the plug for the whole world."
    },
    {
      "verse": "49",
      "text": "People from everywhere pulled up to Egypt just to get grain from Joseph — 'cause the famine was global, no cap."
    },
    {
      "verse": "50",
      "text": "Before the famine years came, Joseph had two sons born to him by Asenath, daughter of Potiphera, priest of On."
    },
    {
      "verse": "51",
      "text": "Joseph named his first son Manasseh, saying, 'God made me forget all my hard times and my father’s house.'"
    },
    {
      "verse": "52",
      "text": "The second son he named Ephraim, saying, 'God made me fruitful in the land where I was once hurting.'"
    },
    {
      "verse": "53",
      "text": "Then the seven years of abundance in Egypt wrapped up clean — the party era was over."
    },
    {
      "verse": "54",
      "text": "The seven years of famine started, just as Joseph said. Every other land was suffering, but Egypt had food stacked high."
    },
    {
      "verse": "55",
      "text": "When Egypt started running low, the people cried to Pharaoh for food. He said, 'Go to Joseph — do what he says.'"
    },
    {
      "verse": "56",
      "text": "When the famine hit everywhere, Joseph opened up all the storehouses and sold grain to the Egyptians, 'cause the famine was mad severe."
    },
    {
      "verse": "57",
      "text": "All the nations came through to Egypt to buy grain from Joseph — the whole world was starving, and Egypt was the only one with the plug."
    }]},

    {
  "chapter": "42",
  "verses": [
    {
      "verse": "1",
      "text": "Jacob saw the food situation in Egypt was bussin' and told his sons: 'Stop side-eyeing each other and go get the goods!'"
    },
    {
      "verse": "2",
      "text": "'I heard Egypt's the plug right now. Go cop some grain before we all become hunger games contestants.'"
    },
    {
      "verse": "3",
      "text": "So Joseph's ten brothers went to Egypt for the ultimate grocery run."
    },
    {
      "verse": "4",
      "text": "But Jacob kept Benjamin home thinking: 'I can't lose my last favorite son – the trauma's still too real.'"
    },
    {
      "verse": "5",
      "text": "Israel's sons joined the Egypt food line because Canaan was going through it too."
    },
    {
      "verse": "6",
      "text": "Joseph was literally the CEO of Egypt – the main supplier. When his brothers showed up, they bowed down like 'yes sir' – his childhood dreams were manifesting in real time."
    },
    {
      "verse": "7",
      "text": "Joseph recognized them immediately but played it cool and came at them aggressive: 'Where you clowns from?' They said: 'Canaan, just here for the food drop.'"
    },
    {
      "verse": "8",
      "text": "Joseph knew exactly who they were but they didn't recognize him – the glow-up was astronomical."
    },
    {
      "verse": "9",
      "text": "Then he remembered his dreams and said: 'Y'all are definitely feds! You're here to scope out our weak points.'"
    },
    {
      "verse": "10",
      "text": "They said: 'No cap, we're just trying to buy food for our family.'"
    },
    {
      "verse": "11",
      "text": "'We're all from one dad! We're legit – zero spy activity here.'"
    },
    {
      "verse": "12",
      "text": "Joseph said: 'Nah, you're definitely here for intel.'"
    },
    {
      "verse": "13",
      "text": "They said: 'Your servants were twelve brothers – one dad in Canaan. Youngest is with dad now, and one... well, he's not in the group chat anymore.'"
    },
    {
      "verse": "14",
      "text": "Joseph said: 'Exactly what a spy would say! I'm calling it.'"
    },
    {
      "verse": "15",
      "text": "'Here's the test: As sure as Pharaoh's alive, you're not leaving until your little brother shows up.'"
    },
    {
      "verse": "16",
      "text": "'Send one guy to get him while the rest of you wait in timeout. We'll see if you're for real or just capping.'"
    },
    {
      "verse": "17",
      "text": "And he put them all in the group detention for three days."
    },
    {
      "verse": "18",
      "text": "On day three Joseph said: 'Do this and you'll live – and I'm only being chill because I respect God.'"
    },
    {
      "verse": "19",
      "text": "'If you're legit, one brother stays locked up while the rest grab food for your hungry families.'"
    },
    {
      "verse": "20",
      "text": "'But bring your youngest brother so I know you're not lying. Then you won't catch these hands.' They agreed."
    },
    {
      "verse": "21",
      "text": "They started whispering: 'We're so guilty about Joseph. We saw him begging but left him on read. That's why this karma's hitting different.'"
    },
    {
      "verse": "22",
      "text": "Reuben said: 'I told y'all not to do him dirty! But you didn't listen! Now we're paying for our villain arc.'"
    },
    {
      "verse": "23",
      "text": "They didn't know Joseph understood everything – he'd been using a translator for the ultimate plot twist."
    },
    {
      "verse": "24",
      "text": "He turned away and cried his eyes out. Came back, took Simeon and had him cuffed right in front of them."
    },
    {
      "verse": "25",
      "text": "Joseph told his team: 'Fill their bags with food, put their money back in their sacks, and give them snacks for the road.'"
    },
    {
      "verse": "26",
      "text": "They loaded their donkeys and dipped."
    },
    {
      "verse": "27",
      "text": "At their first stop, one brother opened his sack to feed his donkey and saw his money staring back at him."
    },
    {
      "verse": "28",
      "text": "He yelled: 'My money's back! It's right here!' They all started shaking and said: 'What is God doing to us right now?'"
    },
    {
      "verse": "29",
      "text": "When they got back to Jacob in Canaan, they told him the whole tea."
    },
    {
      "verse": "30",
      "text": "'The main guy in Egypt came at us aggressive – said we were government spies.'"
    },
    {
      "verse": "31",
      "text": "'But we told him: We're legit, just trying to eat.'"
    },
    {
      "verse": "32",
      "text": "'We're twelve brothers from one dad. One's gone, youngest is with dad in Canaan.'"
    },
    {
      "verse": "33",
      "text": "'Then the boss man said: Leave one brother here, take food for your families, but come back with your little brother so I know you're not capping.'"
    },
    {
      "verse": "34",
      "text": "'Bring him and I'll free your brother, and you can keep doing business.'"
    },
    {
      "verse": "35",
      "text": "As they emptied their bags, EVERYONE found their money pouches! They and their dad were absolutely shook."
    },
    {
      "verse": "36",
      "text": "Jacob went off: 'Y'all keep taking my kids from me! Joseph's gone, Simeon's gone, now you want Benjamin? Everything's falling apart!'"
    },
    {
      "verse": "37",
      "text": "Reuben said: 'You can cancel my whole bloodline if I don't bring him back. Trust me, I got this.'"
    },
    {
      "verse": "38",
      "text": "But Jacob said: 'My son's not going! His brother's dead and he's all I have left. If anything happens to him, I'll literally die from sadness.'"
    }]},
{
  "chapter": "43",
  "verses": [
    {
      "verse": "1",
      "text": "The famine in the land was still hitting different – no relief in sight."
    },
    {
      "verse": "2",
      "text": "When they finished eating all the grain they brought from Egypt, their dad Jacob said: 'Go back and get us a little more food.'"
    },
    {
      "verse": "3",
      "text": "But Judah said: 'That man literally warned us, no cap: You won't see my face again unless your brother is with you.'"
    },
    {
      "verse": "4",
      "text": "'If you send our brother with us, we'll go down and get you food.'"
    },
    {
      "verse": "5",
      "text": "'But if you won't send him, we're not going – because that man said no brother, no service.'"
    },
    {
      "verse": "6",
      "text": "Israel said: 'Why did you have to tell him you had another brother? Y'all did me dirty with that overshare.'"
    },
    {
      "verse": "7",
      "text": "They said: 'The man was grilling us about our family – like is your dad still alive? You got another brother? We just answered honestly. How were we supposed to know he'd say bring your brother here?'"
    },
    {
      "verse": "8",
      "text": "Then Judah said to his father Israel: 'Send the boy with me and we'll get up and go so we don't all starve – you, us, and the whole family.'"
    },
    {
      "verse": "9",
      "text": "'I'll personally vouch for him – if I don't bring him back to you safe, I'll take the blame forever.'"
    },
    {
      "verse": "10",
      "text": "'If we hadn't played around so long we could've already made two trips by now.'"
    },
    {
      "verse": "11",
      "text": "Their father Israel finally said: 'If it has to be like this, then do this: Pack some of the best local products in your bags – some balm, a little honey, spices and myrrh, some pistachios and almonds.'"
    },
    {
      "verse": "12",
      "text": "'Take double the money with you – you gotta return the money that was put back in your sacks last time, maybe it was a mistake.'"
    },
    {
      "verse": "13",
      "text": "'Take your brother too, get up and go back to the man.'"
    },
    {
      "verse": "14",
      "text": "'And may God Almighty grant you mercy before the man so that he will send back your other brother and Benjamin. As for me, if I am bereaved, I am bereaved.' – Jacob was in his feels."
    },
    {
      "verse": "15",
      "text": "So the men took the gifts, double the money, and Benjamin, and went to Egypt and stood before Joseph."
    },
    {
      "verse": "16",
      "text": "When Joseph saw Benjamin with them, he said to his steward: 'Take these men to my house, slaughter an animal and prepare it – they're eating with me at noon.'"
    },
    {
      "verse": "17",
      "text": "The man did as Joseph told him and took them to Joseph's house."
    },
    {
      "verse": "18",
      "text": "The brothers were low-key terrified, saying: 'We're being brought in because of the money that ended up in our sacks last time. They're about to come for us, enslave us, and take our donkeys – this is a setup.'"
    },
    {
      "verse": "19",
      "text": "So they went up to Joseph's steward and spoke to him at the entrance to the house."
    },
    {
      "verse": "20",
      "text": "'Sir, we came down here the first time just to buy food.'"
    },
    {
      "verse": "21",
      "text": "'But when we arrived at our stop and opened our sacks, each man's money was right there in his sack – full amount. So we've brought it back with us.'"
    },
    {
      "verse": "22",
      "text": "'We've also brought more money to buy food. We don't know who put our money back in our sacks.'"
    },
    {
      "verse": "23",
      "text": "The steward said: 'Peace, don't stress. Your God, the God of your father, must have put treasure in your sacks. I received your payment.' Then he brought Simeon out to them."
    },
    {
      "verse": "24",
      "text": "The steward took the men into Joseph's house, gave them water to wash their feet and provided fodder for their donkeys."
    },
    {
      "verse": "25",
      "text": "They prepared their gifts for Joseph's arrival at noon, because they had heard they were going to eat there."
    },
    {
      "verse": "26",
      "text": "When Joseph came home, they presented him with the gifts they had brought into the house, and they bowed down before him to the ground."
    },
    {
      "verse": "27",
      "text": "He asked them how they were, and then he said: 'How is your aged father you told me about? Is he still alive?'"
    },
    {
      "verse": "28",
      "text": "They replied: 'Your servant our father is still alive and well.' And they bowed down, showing respect."
    },
    {
      "verse": "29",
      "text": "As Joseph looked around and saw his brother Benjamin, his own mother's son, he asked: 'Is this your youngest brother, the one you told me about?' And he said: 'God be gracious to you, my son.'"
    },
    {
      "verse": "30",
      "text": "Joseph hurried out because he was suddenly in his feels for his brother – he was about to cry. He went into his private room and wept there."
    },
    {
      "verse": "31",
      "text": "After he had washed his face, he came out and, controlling himself, said: 'Serve the food.'"
    },
    {
      "verse": "32",
      "text": "They served Joseph by himself, the brothers by themselves, and the Egyptians who ate with him by themselves – because Egyptians couldn't eat with Hebrews, that was just their culture."
    },
    {
      "verse": "33",
      "text": "The brothers were seated in front of Joseph in order by their ages, from the firstborn to the youngest – and they looked at each other like 'how does he know our ages? This is sus.'"
    },
    {
      "verse": "34",
      "text": "When portions were served to them from Joseph's table, Benjamin's portion was five times as much as anyone else's. And they feasted and drank freely with him – Benjamin was getting the VIP treatment."
    }]},
{
  "chapter": "44",
  "verses": [
    {
      "verse": "1",
      "text": "Joseph pulled his steward aside and said: 'Fill their bags with food until they can't even carry more, and slide their payment back into their sacks – we're doing a whole plot twist.'"
    },
    {
      "verse": "2",
      "text": "'But put my special silver cup in lil bro Benjamin's sack along with his bread money.' And the steward did exactly that – the setup was immaculate."
    },
    {
      "verse": "3",
      "text": "Morning came and the brothers bounced with their donkeys – thinking they were clear."
    },
    {
      "verse": "4",
      "text": "They hadn't even made it far when Joseph hit his steward with: 'Go chase them down and ask why they decided to do me dirty after I showed them love.'"
    },
    {
      "verse": "5",
      "text": "'Ask them if they really stole the cup I drink from AND use for spiritual readings. That's just foul behavior.'"
    },
    {
      "verse": "6",
      "text": "When the steward caught up, he delivered the message word for word – no cap."
    },
    {
      "verse": "7",
      "text": "The brothers were like: 'Why would you even say that? We would NEVER disrespect your house like that!'"
    },
    {
      "verse": "8",
      "text": "'We literally brought back the money we found last time – why would we steal your silver or gold? That's not our vibe.'"
    },
    {
      "verse": "9",
      "text": "'If you find that cup with any of us, that guy gets the death penalty and the rest of us become your permanent servants.'"
    },
    {
      "verse": "10",
      "text": "The steward said: 'Bet. But only the one who has it becomes my servant – the rest of y'all are free to go.'"
    },
    {
      "verse": "11",
      "text": "Everyone immediately dropped their sacks and opened them – the tension was real."
    },
    {
      "verse": "12",
      "text": "The steward searched from the oldest to the youngest... and the cup was in BENJAMIN'S SACK. The plot twist of the century."
    },
    {
      "verse": "13",
      "text": "They all started tearing their clothes – the drama was at an all-time high. Then they loaded up and headed back to the city."
    },
    {
      "verse": "14",
      "text": "Joseph was still in his spot when Judah and the crew came in and hit the floor – full submission mode."
    },
    {
      "verse": "15",
      "text": "Joseph said: 'What is this? Y'all really thought you could steal my spiritual reading cup? I see everything.'"
    },
    {
      "verse": "16",
      "text": "Judah said: 'What can we even say? God exposed our past mess. We're all your servants now – us AND the one who had the cup.'"
    },
    {
      "verse": "17",
      "text": "Joseph said: 'Nah, only the one who had the cup stays. The rest of y'all can go back to your dad.'"
    },
    {
      "verse": "18",
      "text": "Then Judah stepped up and said: 'Please, let me speak real quick. Don't be mad, but you're basically Pharaoh-level important.'"
    },
    {
      "verse": "19",
      "text": "'You asked us if we had a dad or brother.'"
    },
    {
      "verse": "20",
      "text": "'We told you our dad is old and has this young son – his brother is dead so he's the only one left from his mom, and our dad is absolutely obsessed with him.'"
    },
    {
      "verse": "21",
      "text": "'Then you said: Bring him to me, I need to see him.'"
    },
    {
      "verse": "22",
      "text": "'We told you the kid can't leave his dad – if he does, our father will literally die from sadness.'"
    },
    {
      "verse": "23",
      "text": "'But you said: No lil bro, no face time with me ever again.'"
    },
    {
      "verse": "24",
      "text": "'When we told our dad what you said...'"
    },
    {
      "verse": "25",
      "text": "'He was like: Go get some more food please.'"
    },
    {
      "verse": "26",
      "text": "'We said: We can't go back without lil bro.'"
    },
    {
      "verse": "27",
      "text": "'Then our dad said: My wife had two sons.'"
    },
    {
      "verse": "28",
      "text": "'One disappeared and I was like – he's definitely gone forever. Haven't seen him since.'"
    },
    {
      "verse": "29",
      "text": "'If you take this one too and something happens, I'll die miserable.'"
    },
    {
      "verse": "30",
      "text": "'So if I go back without the boy – and our dad's whole life is wrapped up in him –'"
    },
    {
      "verse": "31",
      "text": "'he'll see he's gone and just give up on life. We can't do that to him.'"
    },
    {
      "verse": "32",
      "text": "'I promised my dad I'd bring him back safe. I said if I don't, I'll take the L forever.'"
    },
    {
      "verse": "33",
      "text": "'So please – let me stay as your servant instead of the boy. Let him go back with his brothers.'"
    },
    {
      "verse": "34",
      "text": "'How could I ever face my dad if the boy isn't with me? I can't watch my father's heart break like that.'"
    }]},
 {
  "chapter": "45",
  "verses": [
    {
      "verse": "1",
      "text": "Joseph could no longer keep his main character energy contained in front of all his attendants, so he cried out, 'Have everyone leave my presence!' So there was no one with Joseph when he revealed himself to his brothers."
    },
    {
      "verse": "2",
      "text": "And he wept so loudly that the Egyptians heard him, and Pharaoh’s household heard about it. The vibe check was emotional."
    },
    {
      "verse": "3",
      "text": "Joseph said to his brothers, 'I am Joseph! Is my father still living?' But his brothers were too shook to answer him—they were literally terrified in his presence."
    },
    {
      "verse": "4",
      "text": "Then Joseph said to his brothers, 'Come close to me.' When they did, he said, 'I am your brother Joseph, the one you sold into Egypt—yes, that Joseph.'"
    },
    {
      "verse": "5",
      "text": "'And now, do not be distressed or angry with yourselves because you sold me here, because God sent me ahead of you to preserve life—the ultimate divine plot twist.'"
    },
    {
      "verse": "6",
      "text": "'For two years now there has been famine in the land, and for the next five years there will be no plowing or reaping—it's about to be a whole situation.'"
    },
    {
      "verse": "7",
      "text": "'But God sent me ahead of you to make sure you survive on earth and to save your lives by a great deliverance.'"
    },
    {
      "verse": "8",
      "text": "'So then, it was not you who sent me here, but God. He made me like a father to Pharaoh, lord of his entire household and ruler of all Egypt—the ultimate glow-up.'"
    },
    {
      "verse": "9",
      "text": "'Now hurry back to my father and say to him: This is what your son Joseph says—God has made me lord of all Egypt. Come down to me; don’t delay.'"
    },
    {
      "verse": "10",
      "text": "'You shall live in the region of Goshen and be near me—you, your children and grandchildren, your flocks and herds, and all you have.'"
    },
    {
      "verse": "11",
      "text": "'I will provide for you there, because five years of famine are still to come. Otherwise you and your household and all who belong to you will become broke and miserable.'"
    },
    {
      "verse": "12",
      "text": "'You can see for yourselves, and so can my brother Benjamin, that it is really I who am speaking to you—this is not a drill.'"
    },
    {
      "verse": "13",
      "text": "'Tell my father about all the honor placed on me in Egypt and about everything you have seen. And bring my father down here quickly.'"
    },
    {
      "verse": "14",
      "text": "Then he threw his arms around his brother Benjamin and wept, and Benjamin embraced him, weeping. Sibling vibe: restored."
    },
    {
      "verse": "15",
      "text": "And he kissed all his brothers and wept over them. Afterward his brothers talked with him—the healing arc begins."
    },
    {
      "verse": "16",
      "text": "When the news reached Pharaoh’s palace that Joseph’s brothers had come, Pharaoh and all his officials were hyped."
    },
    {
      "verse": "17",
      "text": "Pharaoh said to Joseph, 'Tell your brothers, Do this: Load your animals and return to the land of Canaan,"
    },
    {
      "verse": "18",
      "text": "'and bring your father and your families back to me. I will give you the best of the land of Egypt and you will enjoy the fat of the land.”'"
    },
    {
      "verse": "19",
      "text": "'You are also directed to tell them, Do this: Take some carts from Egypt for your children and your wives, and get your father and come.'"
    },
    {
      "verse": "20",
      "text": "'Never mind about your belongings, because the best of all Egypt will be yours.”'"
    },
    {
      "verse": "21",
      "text": "So the sons of Israel did this. Joseph gave them carts, as Pharaoh had commanded, and he also gave them provisions for their journey."
    },
    {
      "verse": "22",
      "text": "He gave each of them new fits of clothing, but to Benjamin he gave three hundred shekels of silver and five sets of outfits—favoritism? Maybe. Blessings? Definitely."
    },
    {
      "verse": "23",
      "text": "To his father he sent ten donkeys loaded with the best things of Egypt, and ten female donkeys loaded with grain and bread and other provisions for his journey."
    },
    {
      "verse": "24",
      "text": "Then he sent his brothers away, and as they were leaving he said to them, 'Don’t argue on the way!—like, keep the vibes peaceful.'"
    },
    {
      "verse": "25",
      "text": "So they went up out of Egypt and came to their father Jacob in the land of Canaan."
    },
    {
      "verse": "26",
      "text": "They told him, 'Joseph is still alive! In fact, he is ruler of all Egypt.' Jacob was stunned; he did not believe them."
    },
    {
      "verse": "27",
      "text": "But when they told him everything Joseph had said to them, and when he saw the carts Joseph had sent to carry him back, the spirit of their father Jacob was revived."
    },
    {
      "verse": "28",
      "text": "And Israel said, 'I’m convinced! My son Joseph is still alive. I will go and see him before I die.' The redemption arc is complete."
    }]},
{
  "chapter": "46",
  "verses": [
    {
      "verse": "1",
      "text": "So Israel packed the whole fit and set out with everything he owned. When he reached Beersheba, he offered sacrifices to the God of his father Isaac – giving thanks before the big move."
    },
    {
      "verse": "2",
      "text": "God spoke to Israel in a vision that night and said, 'Jacob? Jacob?' And he replied, 'I'm here, for real.'"
    },
    {
      "verse": "3",
      "text": "And God said, 'I am God, the God of your father. Do not be afraid to go to Egypt, 'cause I'm gonna make you into a whole nation there. Main character energy activated.'"
    },
    {
      "verse": "4",
      "text": "'I'm going down to Egypt with you, and I will definitely bring you back up. And Joseph's own hands will gently close your eyes when it's time – full circle moment.'"
    },
    {
      "verse": "5",
      "text": "So Jacob left Beersheba, and Israel's sons put their father Jacob, their children, and their wives in the wagons Pharaoh had sent to carry him – the ultimate relocation package."
    },
    {
      "verse": "6",
      "text": "They also took their livestock and the possessions they had acquired in Canaan. And Jacob brought his whole family with him to Egypt – sons, grandsons, daughters, granddaughters. His whole squad was present and accounted for."
    },
    {
      "verse": "7",
      "text": "He brought his whole bloodline to Egypt – no one was left on read."
    },
    {
      "verse": "8",
      "text": "These are the names of the children of Israel who entered Egypt (Jacob and his whole lineup): Starting with Reuben, Jacob's firstborn."
    },
    {
      "verse": "9",
      "text": "The sons of Reuben: Hanoch, Pallu, Hezron, and Carmi."
    },
    {
      "verse": "10",
      "text": "The sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul (the son of a Canaanite woman)."
    },
    {
      "verse": "11",
      "text": "The sons of Levi: Gershon, Kohath, and Merari."
    },
    {
      "verse": "12",
      "text": "The sons of Judah: Er, Onan, Shelah, Perez, and Zerah (but Er and Onan had already passed in the land of Canaan). And the sons of Perez were Hezron and Hamul."
    },
    {
      "verse": "13",
      "text": "The sons of Issachar: Tola, Puvah, Job, and Shimron."
    },
    {
      "verse": "14",
      "text": "The sons of Zebulun: Sered, Elon, and Jahleel."
    },
    {
      "verse": "15",
      "text": "These were the sons Leah bore to Jacob in Paddan-aram, together with his daughter Dinah. All his sons and daughters totaled 33 – the family group chat was large."
    },
    {
      "verse": "16",
      "text": "The sons of Gad: Ziphion, Haggi, Shuni, Ezbon, Eri, Arodi, and Areli."
    },
    {
      "verse": "17",
      "text": "The sons of Asher: Imnah, Ishvah, Ishvi, Beriah, and their sister Serah. The sons of Beriah: Heber and Malchiel."
    },
    {
      "verse": "18",
      "text": "These were the children born to Jacob by Zilpah, whom Laban had given to his daughter Leah – 16 people in this branch of the family tree."
    },
    {
      "verse": "19",
      "text": "The sons of Jacob's wife Rachel: Joseph and Benjamin."
    },
    {
      "verse": "20",
      "text": "In Egypt, Joseph became the father of Manasseh and Ephraim by his wife Asenath, daughter of Potiphera, priest of On – the Egyptian connection was strong."
    },
    {
      "verse": "21",
      "text": "The sons of Benjamin: Bela, Becher, Ashbel, Gera, Naaman, Ehi, Rosh, Muppim, Huppim, and Ard."
    },
    {
      "verse": "22",
      "text": "These were the sons of Rachel who were born to Jacob – 14 people in all."
    },
    {
      "verse": "23",
      "text": "The son of Dan: Hushim."
    },
    {
      "verse": "24",
      "text": "The sons of Naphtali: Jahzeel, Guni, Jezer, and Shillem."
    },
    {
      "verse": "25",
      "text": "These were the sons born to Jacob by Bilhah, whom Laban had given to his daughter Rachel – 7 people total."
    },
    {
      "verse": "26",
      "text": "All those who went to Egypt with Jacob – those who were his direct descendants – numbered 66 people. And that's not even counting the wives – just the main roster."
    },
    {
      "verse": "27",
      "text": "With the two sons who had been born to Joseph in Egypt, the total number of Jacob's family members who came to Egypt was 70 – the sacred squad was complete."
    },
    {
      "verse": "28",
      "text": "Now Jacob sent Judah ahead of him to Joseph to get the coordinates to Goshen. And when they arrived in the region of Goshen – the reunion was imminent."
    },
    {
      "verse": "29",
      "text": "Joseph had his chariot ready and went to Goshen to meet his father Israel. As soon as he appeared, he hugged his neck and cried on his shoulder for a good minute – the emotions were 100."
    },
    {
      "verse": "30",
      "text": "Israel said to Joseph, 'Now I'm ready to let go for real. I've seen your face and know you're still alive. My soul has achieved final peace.'"
    },
    {
      "verse": "31",
      "text": "Joseph said to his brothers and his father's household, 'Let me go up and speak to Pharaoh. I'll tell him the whole family reunion update.'"
    },
    {
      "verse": "32",
      "text": "'I'll say my brothers and my father's family have officially landed from Canaan with their whole livestock operation.'"
    },
    {
      "verse": "33",
      "text": "'So when Pharaoh calls you in and asks about your profession...'"
    },
    {
      "verse": "34",
      "text": "'You better say your whole family has been tending livestock since forever. Then you can stay in Goshen, 'cause Egyptians can't stand shepherds – it's a whole cultural thing.'"
    }]},
   {
  "chapter": "47",
  "verses": [
    {
      "verse": "1",
      "text": "Joseph went and gave Pharaoh the update: 'My father and brothers just pulled up from Canaan with their whole livestock and possessions. They're currently posted in Goshen.'"
    },
    {
      "verse": "2",
      "text": "He brought five of his brothers and presented them to Pharaoh – the delegation was elite."
    },
    {
      "verse": "3",
      "text": "Pharaoh asked them, 'What's your profession?' They replied, 'We're shepherds, just like our ancestors – it's the family business.'"
    },
    {
      "verse": "4",
      "text": "'We came to stay in your land for a minute,' they continued, 'because the famine in Canaan is hitting different – no grass for the flocks. So we're asking to post up in Goshen.'"
    },
    {
      "verse": "5",
      "text": "Pharaoh said to Joseph, 'Your father and your brothers have arrived. Bet.'"
    },
    {
      "verse": "6",
      "text": "'The land of Egypt is yours. Let your father and brothers settle in the best part – Goshen is theirs. And if any of them are truly built different, put them in charge of my own livestock – we recognize talent.'"
    },
    {
      "verse": "7",
      "text": "Then Joseph brought his father Jacob in and presented him to Pharaoh. And Jacob blessed Pharaoh – spiritual hands were laid."
    },
    {
      "verse": "8",
      "text": "Pharaoh asked Jacob, 'How many years have you been on this earth?'"
    },
    {
      "verse": "9",
      "text": "Jacob answered, 'My pilgrimage has been 130 years – short and difficult, not measuring up to the lives of my ancestors in their era.'"
    },
    {
      "verse": "10",
      "text": "Then Jacob blessed Pharaoh again and dipped out respectfully – double blessings, major respect."
    },
    {
      "verse": "11",
      "text": "So Joseph hooked up his father and brothers with property in the best part of Egypt, the district of Rameses, just as Pharaoh ordered – premium real estate."
    },
    {
      "verse": "12",
      "text": "And Joseph provided his father, brothers, and entire father's household with bread, according to the number of their dependents – nobody was left out."
    },
    {
      "verse": "13",
      "text": "There was no bread anywhere, 'cause the famine was absolutely crushing. Both Egypt and Canaan were in struggle mode."
    },
    {
      "verse": "14",
      "text": "Joseph collected all the money that was in Egypt and Canaan in payment for the grain they were buying, and he brought it to Pharaoh's treasury – the bag was secured."
    },
    {
      "verse": "15",
      "text": "When the money in both Egypt and Canaan was totally spent, all the Egyptians came to Joseph saying, 'We're broke! Give us bread! Why should we starve just because our money's gone?'"
    },
    {
      "verse": "16",
      "text": "Joseph replied, 'No problem – if money's gone, bring your livestock. I'll trade you bread for your animals.'"
    },
    {
      "verse": "17",
      "text": "So they brought their horses, sheep, cattle, and donkeys to Joseph, and he traded them food for another year – the barter system was in full effect."
    },
    {
      "verse": "18",
      "text": "When that year ended, they came again and said, 'We can't hide it – our money is gone, and our animals belong to you. All we have left is our bodies and our land.'"
    },
    {
      "verse": "19",
      "text": "'Why die in front of you? Buy us and our land in exchange for food. We'll become Pharaoh's servants – just give us seed so we can live and not let the land go to waste.'"
    },
    {
      "verse": "20",
      "text": "So Joseph bought all the land of Egypt for Pharaoh. Every Egyptian sold their field because the famine was too much, and the whole land became Pharaoh's – the ultimate acquisition."
    },
    {
      "verse": "21",
      "text": "As for the people, Joseph moved them into the cities from one end of Egypt to the other – the great migration."
    },
    {
      "verse": "22",
      "text": "Only the priests' land he didn't buy, because they received a regular allowance from Pharaoh and lived on that – clergy benefits stayed intact."
    },
    {
      "verse": "23",
      "text": "Joseph told the people, 'Today I've acquired you and your land for Pharaoh. Here's seed for you to plant the land.'"
    },
    {
      "verse": "24",
      "text": "'But when the harvest comes, you've gotta give a fifth to Pharaoh. The other four-fifths are yours for seed, food, and for your households and kids – the 80/20 rule in ancient times.'"
    },
    {
      "verse": "25",
      "text": "They said, 'You've saved our lives. If it's cool with you, we'll stay on as Pharaoh's servants – loyalty earned.'"
    },
    {
      "verse": "26",
      "text": "So Joseph made it a law for the land of Egypt that a fifth goes to Pharaoh – and it's still in effect today. Only the priests' land didn't become Pharaoh's."
    },
    {
      "verse": "27",
      "text": "Now Israel settled in the land of Egypt, in Goshen. They acquired property there, were fruitful, and their numbers went way up – thriving in the midst of chaos."
    },
    {
      "verse": "28",
      "text": "Jacob lived in Egypt for 17 years, so his whole life span was 147 years – a full legacy."
    },
    {
      "verse": "29",
      "text": "When Israel's time to depart was near, he called his son Joseph and said, 'If I've found favor with you, put your hand under my thigh and promise me: Please don't bury me in Egypt.'"
    },
    {
      "verse": "30",
      "text": "'But when I rest with my ancestors, carry me out of Egypt and bury me where they are buried.' Joseph replied, 'I'll do exactly what you said.'"
    },
    {
      "verse": "31",
      "text": "Jacob said, 'Swear to me.' So Joseph swore to him. Then Israel bowed in worship right there at the head of his bed – faith until the very end."
    }]},
   {
  "chapter": "48",
  "verses": [
    {
      "verse": "1",
      "text": "Some time later, someone came to Joseph with the news: 'Yo, your father is declining.' So he took his two sons, Manasseh and Ephraim, and went to see him."
    },
    {
      "verse": "2",
      "text": "When Jacob was told, 'Your son Joseph has pulled up to see you,' Israel gathered his strength and sat up in bed – main character energy activated."
    },
    {
      "verse": "3",
      "text": "Jacob said to Joseph: 'God Almighty showed up to me at Luz in the land of Canaan and blessed me there – the original glow-up.'"
    },
    {
      "verse": "4",
      "text": "He said to me: 'I'm going to make you thrive and multiply you into a whole community of nations. I'll give this land to your descendants as their permanent inheritance – the ultimate legacy W.'"
    },
    {
      "verse": "5",
      "text": "'Your two sons, who were born to you in Egypt before I arrived, are officially mine. Ephraim and Manasseh will be my sons, just like Reuben and Simeon – they're in the main lineup now.'"
    },
    {
      "verse": "6",
      "text": "'But any other kids you have after them will be yours; they'll inherit under their brothers' names – the family tree stays organized.'"
    },
    {
      "verse": "7",
      "text": "As I was returning from Paddan, to my deepest pain Rachel passed away in the land of Canaan while we were still on the road, just a short distance from Ephrath. So I buried her there beside the road to Ephrath (that's Bethlehem) – the memory still hits.'"
    },
    {
      "verse": "8",
      "text": "When Israel saw Joseph's sons, he said: 'And who are these?'"
    },
    {
      "verse": "9",
      "text": "Joseph said to his father: 'They are my sons, whom God has blessed me with here.' Israel said: 'Bring them to me, please, so I can bless them – it's time for the anointing.'"
    },
    {
      "verse": "10",
      "text": "Now Israel's eyes were weak from age; he could barely see. Joseph brought his sons close to him, and his father kissed them and embraced them – the grandfather vibes were strong."
    },
    {
      "verse": "11",
      "text": "Israel said to Joseph: 'I never thought I'd see your face again, and now God has let me see your children too. This is a major plot twist blessing.'"
    },
    {
      "verse": "12",
      "text": "Then Joseph moved them from his father's knees and bowed down with his face to the ground – full respect mode."
    },
    {
      "verse": "13",
      "text": "And Joseph took both of them, Ephraim on his right toward Israel's left hand, and Manasseh on his left toward Israel's right hand, and brought them close to him."
    },
    {
      "verse": "14",
      "text": "But Israel reached out his right hand and put it on Ephraim's head, though he was the younger, and crossing his arms, he put his left hand on Manasseh's head, even though Manasseh was the firstborn – the ultimate spiritual power move."
    },
    {
      "verse": "15",
      "text": "Then he blessed Joseph and said: 'The God before whom my fathers Abraham and Isaac walked, the God who has been my shepherd my whole life to this day,'"
    },
    {
      "verse": "16",
      "text": "'the Angel who has delivered me from all harm—may He bless these boys. May they carry my name and the names of my fathers Abraham and Isaac, and may they multiply greatly on the earth.'"
    },
    {
      "verse": "17",
      "text": "When Joseph saw his father placing his right hand on Ephraim's head, he was not feeling it. So he took hold of his father's hand to move it from Ephraim's head to Manasseh's head."
    },
    {
      "verse": "18",
      "text": "Joseph said to him: 'Not that way, my father. This one is the firstborn; put your right hand on his head – that's how we usually do it.'"
    },
    {
      "verse": "19",
      "text": "But his father refused and said: 'I know, my son, I know. He too will become a people, and he too will become great. Nevertheless, his younger brother will be greater than he, and his descendants will become a whole group of nations – God's plan is different.'"
    },
    {
      "verse": "20",
      "text": "He blessed them that day and said: 'In your name will Israel pronounce this blessing: 'May God make you like Ephraim and Manasseh.' So he put Ephraim ahead of Manasseh – the divine order is set.'"
    },
    {
      "verse": "21",
      "text": "Then Israel said to Joseph: 'I am about to pass, but God will be with you and take you back to the land of your fathers.'"
    },
    {
      "verse": "22",
      "text": "And to you I give one more ridge of land than to your brothers—the ridge I took from the Amorites with my sword and my bow – the extra blessing is yours.'"
    }]},
{
  "chapter": "49",
  "verses": [
    {
      "verse": "1",
      "text": "Then Jacob called for his sons and said: 'Gather 'round, it's prophecy time – imma tell y'all what's gonna go down in the final days.'"
    },
    {
      "verse": "2",
      "text": "'Assemble and listen, sons of Jacob; tune in to your father Israel – no cap, just revelation.'"
    },
    {
      "verse": "3",
      "text": "'Reuben, you my firstborn, my main strength, the first sign of my power – top tier in honor and influence.'"
    },
    {
      "verse": "4",
      "text": "'But you were unstable as water, so you will not hold that main character energy, 'cause you went up on my bed and violated the family trust. That was a major L, bro.'"
    },
    {
      "verse": "5",
      "text": "'Simeon and Levi are two of a kind – their hands are literally weapons of chaos.'"
    },
    {
      "verse": "6",
      "text": "'I want no part in their group chat, no share in their toxic council, 'cause in their rage they took men out and for fun they took out livestock too.'"
    },
    {
      "verse": "7",
      "text": "'Cursed be their rage, so fierce, and their temper, so cruel! I'm gonna scatter them throughout Israel, spread them thin in the land.'"
    },
    {
      "verse": "8",
      "text": "'Judah, your brothers will praise you; your hand will be on the neck of your opps; your father's sons will bow down to you.'"
    },
    {
      "verse": "9",
      "text": "'Judah is a young lion – you've returned from the hunt, my son. He crouches, lies down like the king of the jungle; who dares to wake him? Nobody.'"
    },
    {
      "verse": "10",
      "text": "'The scepter will not leave Judah, nor the ruler's staff from between his feet, until the real King comes – and all nations will bow to Him.'"
    },
    {
      "verse": "11",
      "text": "'He'll tether his donkey to a vine, his colt to the choicest branch; he'll wash his clothes in wine, his robes in the juice of grapes – abundance on another level.'"
    },
    {
      "verse": "12",
      "text": "'His eyes will be darker than wine, his teeth whiter than milk – the aesthetic is immaculate.'"
    },
    {
      "verse": "13",
      "text": "'Zebulun will live by the seashore and become a safe harbor for ships; his border will extend toward Sidon – coastal king energy.'"
    },
    {
      "verse": "14",
      "text": "'Issachar is a strong donkey lying down between the saddlebags.'"
    },
    {
      "verse": "15",
      "text": "'When he sees how good the vibes are and how pleasant the land, he'll bend his shoulder to the burden and submit to the daily grind.'"
    },
    {
      "verse": "16",
      "text": "'Dan will provide justice for his people as one of the tribes of Israel.'"
    },
    {
      "verse": "17",
      "text": "'Dan will be a snake by the roadside, a viper along the path, that bites the horse's heels so that its rider eats dust – sneaky but effective.'"
    },
    {
      "verse": "18",
      "text": "'I look for your deliverance, Lord – the ultimate W is on the way.'"
    },
    {
      "verse": "19",
      "text": "'Gad will be attacked by a band of opps, but he'll chase them at their heels – the comeback is guaranteed.'"
    },
    {
      "verse": "20",
      "text": "'Asher's food will be rich; he'll serve delicacies fit for royalty – the chef of the tribes.'"
    },
    {
      "verse": "21",
      "text": "'Naphtali is a doe set free that bears beautiful fawns – graceful and fruitful.'"
    },
    {
      "verse": "22",
      "text": "'Joseph is a fruitful vine, a fruitful vine near a spring, whose branches climb over the wall – unstoppable growth.'"
    },
    {
      "verse": "23",
      "text": "'With bitterness archers attacked him; they shot at him with hate – the struggle was real.'"
    },
    {
      "verse": "24",
      "text": "'But his bow remained steady, his arms stayed strong, because of the Hand of the Mighty One of Jacob, because of the Shepherd, the Rock of Israel,'"
    },
    {
      "verse": "25",
      "text": "'because of your father's God, who helps you, because of the Almighty, who blesses you with blessings from the heavens above, blessings of the deep below, blessings of motherhood and family.'"
    },
    {
      "verse": "26",
      "text": "'Your father's blessings are greater than the blessings of the ancient mountains, than the bounty of the eternal hills. Let all these rest on the head of Joseph, on the brow of the prince among his brothers.'"
    },
    {
      "verse": "27",
      "text": "'Benjamin is a ravenous wolf; in the morning he devours the prey, in the evening he divides the plunder – grind never stops.'"
    },
    {
      "verse": "28",
      "text": "All these are the twelve tribes of Israel, and this is what their father spoke over them when he blessed them, giving each the blessing that fit their destiny."
    },
    {
      "verse": "29",
      "text": "Then he gave them these final instructions: 'I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite,'"
    },
    {
      "verse": "30",
      "text": "'the cave in the field of Machpelah, near Mamre in Canaan, which Abraham bought as a forever plot from Ephron the Hittite.'"
    },
    {
      "verse": "31",
      "text": "'There Abraham and his wife Sarah were buried, there Isaac and his wife Rebekah were buried, and there I buried Leah – the family reunion spot.'"
    },
    {
      "verse": "32",
      "text": "'The field and the cave in it were bought from the Hittites. That's the final address.'"
    },
    {
      "verse": "33",
      "text": "When Jacob had finished giving instructions to his sons, he drew his feet up into the bed, took his last breath, and was gathered to his people – legacy secured."
    }]},
{
  "chapter": "50",
  "verses": [
    {
      "verse": "1",
      "text": "Joseph fell on his father's face, wept over him, and kissed him – big emotions, no cap."
    },
    {
      "verse": "2",
      "text": "Then Joseph ordered his personal physicians to embalm his father Israel. So the doctors did their thing – ancient Egyptian preservation mode: activated."
    },
    {
      "verse": "3",
      "text": "It took a full forty days – that's the standard embalming grind. The Egyptians mourned for him seventy days straight – the respect was immaculate."
    },
    {
      "verse": "4",
      "text": "When the mourning period was over, Joseph spoke to Pharaoh's inner circle: 'If I have favor in your eyes, please put in a word for me to Pharaoh.'"
    },
    {
      "verse": "5",
      "text": "'Tell him: My father made me swear an oath, saying, 'I am about to ascend. Bury me in the tomb I dug for myself in Canaan.' So please let me go up and bury my father, then I'll return – no funny business.'"
    },
    {
      "verse": "6",
      "text": "Pharaoh replied, 'Go up and bury your father, as he made you swear – we respect the final wish around here.'"
    },
    {
      "verse": "7",
      "text": "So Joseph went up to bury his father. All Pharaoh's officials, the elders of his court, and all the elders of Egypt went with him – the procession was elite."
    },
    {
      "verse": "8",
      "text": "Plus all of Joseph's household, his brothers, and his father's household. Only their children, flocks, and herds were left in Goshen – the assets stayed secured."
    },
    {
      "verse": "9",
      "text": "Chariots and horsemen also went up with him. It was a massive flex – the whole crew showed out."
    },
    {
      "verse": "10",
      "text": "When they reached the threshing floor of Atad, near the Jordan, they held a massive and solemn lamentation. Joseph observed seven days of mourning for his father – the vibes were heavy."
    },
    {
      "verse": "11",
      "text": "When the Canaanites saw the mourning at Atad, they said, 'The Egyptians are throwing the most serious ceremony of mourning ever.' That's why the place is named Abel Mizraim – the Egyptians' meadow."
    },
    {
      "verse": "12",
      "text": "So Jacob's sons did for him what he had commanded them – they followed the instructions to the letter."
    },
    {
      "verse": "13",
      "text": "They carried him to the land of Canaan and buried him in the cave of the field at Machpelah, near Mamre, which Abraham had bought as a forever home from Ephron the Hittite."
    },
    {
      "verse": "14",
      "text": "After burying his father, Joseph returned to Egypt, together with his brothers and all the others who had gone with him to bury his father – mission accomplished."
    },
    {
      "verse": "15",
      "text": "When Joseph's brothers saw that their father was gone, they started panicking: 'What if Joseph still holds the grudge and decides to finally serve us that karma we deserve?'"
    },
    {
      "verse": "16",
      "text": "So they sent a message to Joseph: 'Before he passed, your father gave this instruction:'"
    },
    {
      "verse": "17",
      "text": "'Tell Joseph this: Please forgive your brothers for their sin and the absolute mess they made – they did you dirty.' So now, please forgive the servants of the God of your father.' Joseph wept when they spoke to him – the emotions hit different."
    },
    {
      "verse": "18",
      "text": "Then his brothers came and threw themselves down before him. 'We are your servants,' they said – full submission mode."
    },
    {
      "verse": "19",
      "text": "But Joseph said to them, 'Don't be afraid. Am I in God's position?'"
    },
    {
      "verse": "20",
      "text": "'You intended to do me harm, but God intended it for good – to accomplish what is now being done, the saving of many lives. The plot twist was divine.'"
    },
    {
      "verse": "21",
      "text": "'So then, don't be scared. I will provide for you and your kids.' And he reassured them and spoke with nothing but love – the character development was complete."
    },
    {
      "verse": "22",
      "text": "Joseph stayed in Egypt, along with all his father's family. He lived 110 years – the legacy was secured."
    },
    {
      "verse": "23",
      "text": "He saw the third generation of Ephraim's children. Also the children of Makir son of Manasseh were placed at birth on Joseph's knees – the great-grandbaby era was thriving."
    },
    {
      "verse": "24",
      "text": "Then Joseph said to his brothers, 'I am about to pass. But God will definitely pull up and help you and take you out of this land to the land he promised on oath to Abraham, Isaac and Jacob.'"
    },
    {
      "verse": "25",
      "text": "And Joseph made the Israelites swear an oath and said, 'When God comes through for you, you must carry my bones up from this place – don't leave me here fam.'"
    },
    {
      "verse": "26",
      "text": "So Joseph passed at the age of 110. And after they embalmed him, he was placed in a coffin in Egypt – the Genesis arc complete."
    }]}]}