{
  "book": "Haggai",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Back in the day, in the 2nd year of King Darius, God spoke through Haggai to the squad in Judah."
    },
    {
      "verse": "2",
      "text": "God’s like, “Yo, people of Judah, why are you chilling in fancy houses while my temple is still a mess?”"
    },
    {
      "verse": "3",
      "text": "He says, “Look around—this is wild. You’re living comfy, but my house is still wrecked.”"
    },
    {
      "verse": "4",
      "text": "God’s asking, “Don’t you think about me when you’re vibing in your own cribs?”"
    },
    {
      "verse": "5",
      "text": "“Come on, fam. Get your act together—time to step up and rebuild my house.”"
    },
    {
      "verse": "6",
      "text": "“You’ve been grinding for yourselves, but see? Nothing’s really sticking. Money, energy—it’s like you’re running on empty.”"
    },
    {
      "verse": "7",
      "text": "God continues, “Check your vibe: planting a lot, but the harvest ain’t hitting like you thought.”"
    },
    {
      "verse": "8",
      "text": "“Come on, build my temple first. Then all your grind will actually pay off.”"
    },
    {
      "verse": "9",
      "text": "“You thought you were set, but your hustle got delayed—because you forgot me.”"
    },
    {
      "verse": "10",
      "text": "God’s like, “That drought in your crops and struggles? That’s on you ignoring me.”"
    },
    {
      "verse": "11",
      "text": "“Even your paycheck and resources aren’t stretching right because my temple isn’t done.”"
    },
    {
      "verse": "12",
      "text": "Then the squad obeyed God’s voice through Haggai, and they got motivated."
    },
    {
      "verse": "13",
      "text": "Haggai said, “I’m with you! God’s vibe is on you.”"
    },
    {
      "verse": "14",
      "text": "So God sparked action in Zerubbabel, Joshua, and the people of Judah—they started rebuilding."
    },
    {
      "verse": "15",
      "text": "This happened on the 24th day of the 6th month in the 2nd year of King Darius."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "On the 21st day of the 7th month, God spoke again through Haggai to the squad in Judah and Jerusalem."
    },
    {
      "verse": "2",
      "text": "God’s like, “Yo, the elders are seeing the temple rebuild—don’t get shook by the vibes of the past.”"
    },
    {
      "verse": "3",
      "text": "“Remember the OG temple? Yeah, it looked lit back then, but compare it to now—don’t freak out.”"
    },
    {
      "verse": "4",
      "text": "“Be strong, fam! Zerubbabel, Joshua, and all of you—don’t get weak. God’s got you.”"
    },
    {
      "verse": "5",
      "text": "“Don’t sweat it. I’m still with you, just like when you left Egypt and all the way through the desert.”"
    },
    {
      "verse": "6",
      "text": "“Here’s the tea: I’m about to shake things up—mountains, nations, and kingdoms.”"
    },
    {
      "verse": "7",
      "text": "“Everything I shake will settle, and the treasures of all nations will slide into my temple.”"
    },
    {
      "verse": "8",
      "text": "“All the glory and clout? That’s mine. Everything belongs to me.”"
    },
    {
      "verse": "9",
      "text": "“My temple will be lit—more epic than the first one—and you’ll see it, fam. I’m giving peace, not drama.”"
    },
    {
      "verse": "10",
      "text": "Haggai asked, “If a holy thing touches normal stuff, does it get holy too?”"
    },
    {
      "verse": "11",
      "text": "God replied, “Nah. It stays regular unless it touches me. That’s the vibe.”"
    },
    {
      "verse": "12",
      "text": "“Example: If a pure animal touches something impure, it’s impure too.”"
    },
    {
      "verse": "13",
      "text": "“Touch something impure with impure? Still impure. That’s just how holiness works.”"
    },
    {
      "verse": "14",
      "text": "“So watch your vibe, fam. What you’ve been doing? That’s been impure and delayed.”"
    },
    {
      "verse": "15",
      "text": "“Check your harvest: nothing popped off, crops were small, money wasn’t stretching—yup, that’s on you.”"
    },
    {
      "verse": "16",
      "text": "“Your hustle for yourselves? Yeah, empty. You ignored me, so nothing really stuck.”"
    },
    {
      "verse": "17",
      "text": "“I’m shaking the sky, earth, seas, and even your work. That’s why you’ve been struggling.”"
    },
    {
      "verse": "18",
      "text": "“Look at the day you started rebuilding my temple—remember that day, mark it—it’s a new start for you.”"
    },
    {
      "verse": "19",
      "text": "“Since that day, blessings are rolling in. My Spirit is on you now, and your grind will finally pay off.”"
    },
    {
      "verse": "20",
      "text": "God spoke again on the 24th day of the 9th month to Haggai."
    },
    {
      "verse": "21",
      "text": "“Zerubbabel, fam, I’m about to shake the world—every empire will notice.”"
    },
    {
      "verse": "22",
      "text": "“I’ll smash kings and power, and you’ll be lifted up like a boss.”"
    },
    {
      "verse": "23",
      "text": "“Zerubbabel, I picked you—like my signet ring. You’re my chosen, and I got you for real.”"
    }]}
  ]}