{
  "book": "James",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, James here—Jesus’ bro, sending shoutouts to the 12 tribes scattered everywhere. Big vibes of grace and peace to you."
    },
    {
      "verse": "2",
      "text": "Real talk: whenever you’re going through trials, consider it a full-on growth hack. Hard times build patience."
    },
    {
      "verse": "3",
      "text": "Patience? Yeah, it’s like leveling up your faith. Keep grinding—God’s got plans for the long game."
    },
    {
      "verse": "4",
      "text": "Let that patience fully do its work so you can be complete and not missing anything."
    },
    {
      "verse": "5",
      "text": "Need wisdom? Don’t stress. Ask God—He gives to everyone generously, no side-eye. And He won’t throw shade."
    },
    {
      "verse": "6",
      "text": "But when you ask, ask with straight-up faith, no doubting. Doubters are like waves in the ocean, tossed around by everything."
    },
    {
      "verse": "7",
      "text": "That person shouldn’t expect to get anything from God. Seriously, they’re unstable, can’t rely on them."
    },
    {
      "verse": "8",
      "text": "Doubters? Double-minded—they can’t decide and are all over the place in life."
    },
    {
      "verse": "9",
      "text": "Low-key, let the humble ones flex their position in God’s plan."
    },
    {
      "verse": "10",
      "text": "And the rich? Don’t get cocky—your wealth is temporary, like a fading flower in the sun."
    },
    {
      "verse": "11",
      "text": "It blooms and shines, but eventually wilts. Money fades fast, and the flower dies."
    },
    {
      "verse": "12",
      "text": "Blessed is the one who keeps strong under pressure—they’ll get the crown of life promised by God to everyone who loves Him."
    },
    {
      "verse": "13",
      "text": "Don’t blame God for temptation. God can’t be tempted by evil, and He doesn’t tempt anyone."
    },
    {
      "verse": "14",
      "text": "Each person is tempted when their own desires pull them."
    },
    {
      "verse": "15",
      "text": "That desire grows, gets them pregnant with sin, and sin levels up to death."
    },
    {
      "verse": "16",
      "text": "Don’t be fooled, fam."
    },
    {
      "verse": "17",
      "text": "Every good thing comes straight from the top—God, the ultimate Father, who never changes, always steady."
    },
    {
      "verse": "18",
      "text": "He brought us to life through His word, making us His prized creations—think first fruits of His plan."
    },
    {
      "verse": "19",
      "text": "Listen up: everyone should be quick to hear, slow to speak, slow to get heated."
    },
    {
      "verse": "20",
      "text": "Anger doesn’t upgrade God’s rep, FYI."
    },
    {
      "verse": "21",
      "text": "So drop all the messy stuff and the fake vibes. Accept the word planted in you—it can save your soul."
    },
    {
      "verse": "22",
      "text": "But don’t just skim it—do it. Be the plug for God’s word, not just a viewer."
    },
    {
      "verse": "23",
      "text": "Anyone who listens but doesn’t do is like someone staring in a mirror, then walking away and forgetting what they look like."
    },
    {
      "verse": "24",
      "text": "But the one who checks themselves out, sees God’s word, and acts on it? That’s next-level living—blessed and thriving."
    },
    {
      "verse": "25",
      "text": "They’re not just hearing; they’re winning. That’s living God’s word fully."
    },
    {
      "verse": "26",
      "text": "If you claim to have faith but can’t control your tongue, your faith is weak sauce, nothing more."
    },
    {
      "verse": "27",
      "text": "Real religion? Keep it pure: look after orphans and widows in need, and don’t get tangled in this world’s vibe."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, fam, don’t play favorites—Jesus doesn’t roll that way."
    },
    {
      "verse": "2",
      "text": "Imagine someone rolls into your squad with a designer drip, and another person in basic fits. You hype up the rich one and low-key side-eye the poor one. Not cool."
    },
    {
      "verse": "3",
      "text": "If you show love to the rich but diss the poor, your heart is shady, and you’re playing judge with the wrong energy."
    },
    {
      "verse": "4",
      "text": "Listen up: God called us to follow Jesus, not to flex favoritism. If you start picking sides, you’re actually sinning and getting called out by the law."
    },
    {
      "verse": "5",
      "text": "Check this: God picked the poor to be rich in faith and heirs of His kingdom. You sure you want to diss that?"
    },
    {
      "verse": "6",
      "text": "Meanwhile, the rich might be flexing, but they’re oppressing you and running the system against you."
    },
    {
      "verse": "7",
      "text": "They trash-talk Jesus, who’s literally the One who saved us."
    },
    {
      "verse": "8",
      "text": "But the royal law of Scripture says it straight: “Love your neighbor as yourself.” Do that, and you’re not messing up."
    },
    {
      "verse": "9",
      "text": "If you play favorites, you’re guilty of sin and fail the law."
    },
    {
      "verse": "10",
      "text": "Everyone who keeps the law but slips on one part is guilty of the whole thing."
    },
    {
      "verse": "11",
      "text": "God said, “Don’t commit adultery, don’t kill, don’t steal…”—all the commands are connected. Breaking one is like breaking them all."
    },
    {
      "verse": "12",
      "text": "So speak and act like you’re about God’s law, not your own agenda. Live life in line with the freedom God gives."
    },
    {
      "verse": "13",
      "text": "Mercy wins over judgment, fam. Don’t forget that."
    },
    {
      "verse": "14",
      "text": "Real talk: What good is faith if you’re all talk? Can it actually save someone if you’re just vibing with words?"
    },
    {
      "verse": "15",
      "text": "Imagine a brother or sister who’s starving, and you just say, “Yo, stay strong,” but don’t hand them food. Come on."
    },
    {
      "verse": "16",
      "text": "Faith without action? Dead. Flat-out useless."
    },
    {
      "verse": "17",
      "text": "But when faith links up with action, boom—that’s alive."
    },
    {
      "verse": "18",
      "text": "Someone might ask, “Where’s the proof?” I’ll show you faith in action by my deeds."
    },
    {
      "verse": "19",
      "text": "You gotta know—faith isn’t just head knowledge. Even demons know God’s real, and they shake."
    },
    {
      "verse": "20",
      "text": "But knowing and actually doing are different. Mere knowledge won’t save you."
    },
    {
      "verse": "21",
      "text": "Remember Abraham? He was legit in God’s eyes because he acted on God’s call and offered Isaac."
    },
    {
      "verse": "22",
      "text": "Faith and action worked together in him—his faith got upgraded by what he did."
    },
    {
      "verse": "23",
      "text": "And that’s why Scripture says, “Abraham believed God, and it got credited to him as top-level righteousness.” He got extra points because he acted."
    },
    {
      "verse": "24",
      "text": "See? A person is made right with God through faith and action, not just faith alone."
    },
    {
      "verse": "25",
      "text": "And think about Rahab, the move-maker—she welcomed the spies and got her faith points for action."
    },
    {
      "verse": "26",
      "text": "Bottom line: Faith without moves is dead. If it doesn’t show up in real life, it’s just words."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, fam, heads up—teachers are gonna get extra scrutiny. If you’re teaching, you better make sure your words are on point."
    },
    {
      "verse": "2",
      "text": "Everyone slips sometimes, right? If you can control your words, you’re basically leveling up in self-control across the board."
    },
    {
      "verse": "3",
      "text": "Think about a horse—you control it with a tiny bit of gear, yet it can run wild if left unchecked. Words are like that."
    },
    {
      "verse": "4",
      "text": "Ships are massive, but a small rudder steers them. That’s how our speech can steer our whole life."
    },
    {
      "verse": "5",
      "text": "Words are small, but they can have huge energy—fires, chaos, big consequences."
    },
    {
      "verse": "6",
      "text": "The tongue is basically a fire—it’s dangerous. It can mess with your whole squad, set the world on fire, and it’s unpredictable."
    },
    {
      "verse": "7",
      "text": "We can tame every beast and creature on the planet, right?"
    },
    {
      "verse": "8",
      "text": "But the tongue? Straight-up untameable. It’s full of deadly vibes, spreading poison and trouble."
    },
    {
      "verse": "9",
      "text": "With our words, we hype God, our Father. But then we also curse people, who are made in His image. How does that make sense?"
    },
    {
      "verse": "10",
      "text": "Blessings and cursing from the same mouth? Big contradiction. Not a good look."
    },
    {
      "verse": "11",
      "text": "Think about it—fresh water and salt water coming from the same spring? Nah, doesn’t work."
    },
    {
      "verse": "12",
      "text": "Fig tree can’t drop olives, and a grapevine can’t give figs. That’s the vibe—words gotta match your heart."
    },
    {
      "verse": "13",
      "text": "If you’re wise and mature, show it—your actions should be chill, humble, and proven by good deeds."
    },
    {
      "verse": "14",
      "text": "But if you’re bitter or selfish, don’t flex that as wisdom. That’s fake news."
    },
    {
      "verse": "15",
      "text": "Wisdom like that? It’s trash—earthly, not heavenly."
    },
    {
      "verse": "16",
      "text": "Earthly wisdom? Full of jealousy and selfish energy—chaos everywhere."
    },
    {
      "verse": "17",
      "text": "But real wisdom from above? Mad peace vibes, respectful, humble, chill, full of mercy, and totally unbiased."
    },
    {
      "verse": "18",
      "text": "When wisdom’s rolling right, it brings peace. Those who plant peace reap a squad that’s blessed and thriving."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, fam, where’s all the fighting and beef coming from? It’s not random—it’s coming from your own cravings clashing."
    },
    {
      "verse": "2",
      "text": "You want stuff, but don’t get it. You’re jealous, then start fights. You can’t get what you want, so you stress and argue."
    },
    {
      "verse": "3",
      "text": "And when you pray, some of you pray for selfish stuff—don’t be surprised if it doesn’t work out. You’re asking with the wrong vibes."
    },
    {
      "verse": "4",
      "text": "Yo, you’re acting like enemies of God if you chase the world’s energy. Can’t be besties with God and the squad that’s living for only themselves."
    },
    {
      "verse": "5",
      "text": "God is super jealous for your heart—He wants you fully in His crew."
    },
    {
      "verse": "6",
      "text": "But check this: He also flexes mercy—so He’s got both the hype and the love."
    },
    {
      "verse": "7",
      "text": "So, squad up: submit to God. Stand against the wrong vibes. Level up in humility."
    },
    {
      "verse": "8",
      "text": "Get close to God, and He’ll get close to you. Wash your hands—drop the messy stuff in your life. Clean your heart."
    },
    {
      "verse": "9",
      "text": "Feel the weight of it—repent, be sad for the stuff you messed up. Don’t be all casual about sin."
    },
    {
      "verse": "10",
      "text": "Humble yourself in front of God, and He’ll lift you up, no cap."
    },
    {
      "verse": "11",
      "text": "Don’t drag your squad down with gossip or judging. Your words matter. Speak life, not death."
    },
    {
      "verse": "12",
      "text": "Only God has the ultimate say—He’s the judge. Stop acting like you’re the final authority."
    },
    {
      "verse": "13",
      "text": "Yo, listen to this: Some of you are like, “We’re gonna hit the city, do big deals next year, make bank, live it up.”"
    },
    {
      "verse": "14",
      "text": "But hold up—your life is a fast story, here today, gone tomorrow. You don’t even know what tomorrow brings."
    },
    {
      "verse": "15",
      "text": "Instead, say, “If God wants, we’ll live and do this.” Keep Him in the plan."
    },
    {
      "verse": "16",
      "text": "Boasting and flexing like you’re in control? That’s shady—big mess."
    },
    {
      "verse": "17",
      "text": "Real talk: If you know the right move but don’t do it? That’s sin. Full stop."}]},
      {
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, rich folks, listen up! Cry now—your luxury and flexing days are numbered. Your wealth is rotting, your designer fits eaten by moths, your gold tarnished."
    },
    {
      "verse": "2",
      "text": "That cash you hoarded? The cries of workers you underpaid hit God’s ears—straight-up receipts."
    },
    {
      "verse": "3",
      "text": "You thought you were untouchable, stacking treasure? Nah, it’s evidence against you. Your bling is proof of your shady moves."
    },
    {
      "verse": "4",
      "text": "Workers you cheated? Their cries reached the top—God is fully aware."
    },
    {
      "verse": "5",
      "text": "You’ve lived wild, chillin’, eating good while cheating others. You thought it was all smooth—but the fallout is coming."
    },
    {
      "verse": "6",
      "text": "You murdered people’s rights with lies and scams—real talk, God sees it all."
    },
    {
      "verse": "7",
      "text": "Yo, squad, be patient! Wait for the Lord to drop justice like a perfect playlist. Don’t lose hope."
    },
    {
      "verse": "8",
      "text": "The farmer waits for rain patiently—don’t front like you’re in control. God’s timing is perfect."
    },
    {
      "verse": "9",
      "text": "Don’t clap back at each other or throw shade—judge yourself, not each other. The Judge is coming."
    },
    {
      "verse": "10",
      "text": "Remember the prophets? They suffered but stayed loyal, putting their faith in God. That’s the real energy to copy."
    },
    {
      "verse": "11",
      "text": "Big takeaway: God’s mercy and patience = legendary. Check out Job—endurance game strong, full reward at the end."
    },
    {
      "verse": "12",
      "text": "Don’t swear, don’t flex with “I swear by this” or “I swear by that.” Keep it real—let your “yes” mean yes and your “no” mean no."
    },
    {
      "verse": "13",
      "text": "Feeling stressed? Pray. Feeling hyped? Praise."
    },
    {
      "verse": "14",
      "text": "Sick or down? Call the elders—they’ll pray and anoint with oil in Jesus’ name."
    },
    {
      "verse": "15",
      "text": "Real talk: prayer with faith = healing, spiritually and sometimes physically. God’s got your back."
    },
    {
      "verse": "16",
      "text": "Confess your mess-ups to each other and pray. Energy flows better when hearts are real."
    },
    {
      "verse": "17",
      "text": "Elijah was human, just like us. He prayed hard—didn’t slack—and God moved mountains."
    },
    {
      "verse": "18",
      "text": "He prayed that it wouldn’t rain—no rain for three years. Then he prayed again—rain came. God always listens."
    },
    {
      "verse": "19",
      "text": "Squad, if someone wanders off from the truth, pull them back. Save their soul from chaos—they’ll thank you later."
    },
    {
      "verse": "20",
      "text": "Real talk: saving someone from sin = huge win, like saving a soul from death and covering a ton of mistakes."}]}
  ]}