{
  "book": "Joel",
  "chapters": [
    {
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, this is the Word God dropped through Joel, son of Pethuel. Listen up."
    },
    {
      "verse": "2",
      "text": "Squad, pay attention! Elders, ancestors, all y’all — hear this prophecy, take notes."
    },
    {
      "verse": "3",
      "text": "Has anything like this ever gone down in your days, or your dads’? Spread the word to your kids."
    },
    {
      "verse": "4",
      "text": "Locust apocalypse incoming: the palmerworm, the cankerworm, the caterpillar, the locust — all swooped in, devouring everything. Nothing left."
    },
    {
      "verse": "5",
      "text": "Vines? Stripped. Fig trees? Gone. Pomegranate trees? Eaten. Fruit? Canceled. Pure chaos."
    },
    {
      "verse": "6",
      "text": "Hops, grain, barley, corn, olive trees — destroyed. Fields empty. Farmers crying."
    },
    {
      "verse": "7",
      "text": "Yo, priests! Sound the alarm in Zion! Trumpets up! People, brace yourselves — God’s judgment flex incoming."
    },
    {
      "verse": "8",
      "text": "Day of the Lord approaching. Land shaking. Fire consuming. Total end-of-days energy."
    },
    {
      "verse": "9",
      "text": "Meat and drink offerings? Gone. Temple vibes? Dead. Priests, you gotta mourn."
    },
    {
      "verse": "10",
      "text": "Wail, farmers! Beat your chest in sackcloth. Grain, wine, oil? Gone. Joy? Deleted."
    },
    {
      "verse": "11",
      "text": "Fields ruined, vines burned, trees stripped. Life groaning. Earth literally shook."
    },
    {
      "verse": "12",
      "text": "Seed shriveled under the sun. Farmers weep. Vintners mourn. Total loss."
    },
    {
      "verse": "13",
      "text": "Vine dried. Fig trees withered. Pomegranate trees wrecked. Fruit? Nada."
    },
    {
      "verse": "14",
      "text": "Alert in the holy spot! God’s wrath is real, landing heavy. No cap."
    },
    {
      "verse": "15",
      "text": "Blow the trumpet in Zion! Day of the Lord near. Darkness, gloom, clouds of doom."
    },
    {
      "verse": "16",
      "text": "Nation, panic! Hide in caves! Scatter! Land convulsing. Big chaos."
    },
    {
      "verse": "17",
      "text": "Animals groaning, flocks suffering. Birds starving. Fish panicking. Nature in total meltdown."
    },
    {
      "verse": "18",
      "text": "Rivers dried. Streams vanished. Land crying. Earth mourning. God’s wrath on full flex."
    },
    {
      "verse": "19",
      "text": "People, pay attention! God’s anger is real. Repent and return before it hits harder."
    },
    {
      "verse": "20",
      "text": "Grain gone, offerings cut, joy deleted — sing to God! Humble yourselves, call for mercy, save what’s left."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, blow the trumpet loud in Zion! Alarm in God’s squad – Day of the Lord is rolling in mad fast."
    },
    {
      "verse": "2",
      "text": "Terrifying energy: Lord’s army charging, nothing chill about it, darkness covers the skies, fire in front, smoke behind."
    },
    {
      "verse": "3",
      "text": "Like warriors, running hard, teeth like lions, jaws flexing, devouring everything."
    },
    {
      "verse": "4",
      "text": "Faces fierce, like flames, moving fast, causing chaos everywhere."
    },
    {
      "verse": "5",
      "text": "Columns of smoke, land shaking, nothing stands in their path."
    },
    {
      "verse": "6",
      "text": "Their army moves like cavalry, teeth chomping, teeth gnashing, destruction nonstop."
    },
    {
      "verse": "7",
      "text": "They crush everything underfoot; human squads panic, animals scatter."
    },
    {
      "verse": "8",
      "text": "Behind them, land is wasted, fields devoured, cities crumble, no chill left."
    },
    {
      "verse": "9",
      "text": "Nothing can hide – walls fall, windows smashed, people flee."
    },
    {
      "verse": "10",
      "text": "Earth quakes before them, mountains shake, rivers dry, fire burns."
    },
    {
      "verse": "11",
      "text": "God thunders from Zion, Heaven flexes, troops shake. His army is unstoppable."
    },
    {
      "verse": "12",
      "text": "Squad, return! Fast, repent, heart, soul, spirit – all in, no cap."
    },
    {
      "verse": "13",
      "text": "Priests, nation, cry out; beat your chest, sackcloth on, God sees your grind."
    },
    {
      "verse": "14",
      "text": "The Lord is merciful, slow to anger, huge love – maybe He’ll chill wrath."
    },
    {
      "verse": "15",
      "text": "Blow the trumpet, Zion! Holy fast, all hands on deck, day is near."
    },
    {
      "verse": "16",
      "text": "Call for assembly, nation squad, priests unite – repentance flex incoming."
    },
    {
      "verse": "17",
      "text": "Even newlyweds, old and young, call for mercy, God is watching."
    },
    {
      "verse": "18",
      "text": "Show mercy, Lord! Don’t cancel us; flex your love over wrath."
    },
    {
      "verse": "19",
      "text": "Restore land, bless the squad – give back the vibe and life."
    },
    {
      "verse": "20",
      "text": "Northern army removed; destruction stopped – hope unlocked."
    },
    {
      "verse": "21",
      "text": "Farmers rejoice: seed, wine, oil, flocks restored; land vibes alive again."
    },
    {
      "verse": "22",
      "text": "Animals chill, birds feed, all creation rejoices – God’s flex fully revealed."
    },
    {
      "verse": "23",
      "text": "Celebrate, Zion! Praise God for mercy and restoration."
    },
    {
      "verse": "24",
      "text": "God repays for lost years, locusts, cankerworms, caterpillars, stripping crops – blessings incoming."
    },
    {
      "verse": "25",
      "text": "Eat, be full, praise God; squad restored, no cap."
    },
    {
      "verse": "26",
      "text": "Fear Him, worship Him, call His name; His love is epic, unshakable."
    },
    {
      "verse": "27",
      "text": "God will pour His Spirit on everyone – youth, old, boys, girls – visions, dreams, prophecy."
    },
    {
      "verse": "28",
      "text": "Even servants get the Spirit; no exclusions. Power unlocked, fully infinite."
    },
    {
      "verse": "29",
      "text": "Before the final day: sun darkens, moon blood-red, stars dropping, heavens shaking."
    },
    {
      "verse": "30",
      "text": "The Day of the Lord comes; cannot dodge it, all see, all feel, total apocalypse vibe."
    },
    {
      "verse": "31",
      "text": "Call for mercy, stand tall; God’s justice and love combined, total squad flex."
    },
    {
      "verse": "32",
      "text": "Blessed squad trusts Him — land restored, life blessed, peace unlocked; God flexes forever."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, God says, “I’m pulling the squad from exile; I’ll bring them back and judge Judah’s enemies.”"
    },
    {
      "verse": "2",
      "text": "I’ll gather all nations, drag them to the valley of decision – my showdown spot."
    },
    {
      "verse": "3",
      "text": "You, Tyre, Sidon, and all the coastal squad, I’m coming for you. You sold My people; cash and trade, but I saw."
    },
    {
      "verse": "4",
      "text": "I’ll stretch My hand over you, strip your wealth, and make you solo – no chill, no flex left."
    },
    {
      "verse": "5",
      "text": "I’ll turn your trading spots into rubble, your ports empty, no ships docking – chaos incoming."
    },
    {
      "verse": "6",
      "text": "You thought you got away selling My squad? Nah, God sees, justice incoming."
    },
    {
      "verse": "7",
      "text": "I’ll judge your deals, punish your squad; everyone who harmed Israel, face the wrath."
    },
    {
      "verse": "8",
      "text": "Watch out, nations: I’m bringing blood, fire, devastation – My vengeance squad activated."
    },
    {
      "verse": "9",
      "text": "Swing the sickle, Lord! Harvest is ready, the clusters of grapes are ripe for judgment."
    },
    {
      "verse": "10",
      "text": "Beat the plowshares into swords, farming tools into weapons – God’s battle is coming."
    },
    {
      "verse": "11",
      "text": "Nations, assemble! I’ll summon everyone to the valley for war; no hiding."
    },
    {
      "verse": "12",
      "text": "Multitudes die; the sun burns, the moon darkens – God’s wrath is real, no cap."
    },
    {
      "verse": "13",
      "text": "The elders, the princes, everyone trembles before His throne; God flexes holy power."
    },
    {
      "verse": "14",
      "text": "Listen, nations: scatter My people no more, treat them right – My eyes are on you."
    },
    {
      "verse": "15",
      "text": "God’s squad will rule; He’ll settle the land, give the right vibes to His people."
    },
    {
      "verse": "16",
      "text": "Judah, don’t stress; God’s coming, mighty in power, He fights for you."
    },
    {
      "verse": "17",
      "text": "Streams in Judah will flow; cities restored; My squad gets back what was lost."
    },
    {
      "verse": "18",
      "text": "Egypt, Edom, the squad nearby, fear! God’s vengeance rolls; you’ll pay for your moves."
    },
    {
      "verse": "19",
      "text": "God roars from Zion; His voice shakes the nations; His squad is untouchable."
    },
    {
      "verse": "20",
      "text": "Judah, rejoice! God is in the squad, no enemy can touch you; blessings unlocked."
    },
    {
      "verse": "21",
      "text": "God’s name forever praised in Zion; His glory covers the land, squad secure, no cap."}]}]}