{
  "book": "John",
  "chapters": [
    {
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, in the beginning, the Word existed—straight up with God, and the Word was God."
    },
    {
      "verse": "2",
      "text": "The Word was chilling with God from the start."
    },
    {
      "verse": "3",
      "text": "Everything came into being through the Word. Nothing was made without it."
    },
    {
      "verse": "4",
      "text": "Life was in the Word, and that life was the light for all humans."
    },
    {
      "verse": "5",
      "text": "The light shines in the darkness, and the darkness hasn’t won."
    },
    {
      "verse": "6",
      "text": "There was this dude, John, sent by God."
    },
    {
      "verse": "7",
      "text": "His mission? To flex the light so everyone could see and believe."
    },
    {
      "verse": "8",
      "text": "He wasn’t the light himself, just pointing people to it."
    },
    {
      "verse": "9",
      "text": "The true light, the one that lights up everyone, was coming into the world."
    },
    {
      "verse": "10",
      "text": "The world was made through him, but the world didn’t recognize him."
    },
    {
      "verse": "11",
      "text": "He came to his own people, but they ghosted him."
    },
    {
      "verse": "12",
      "text": "Anyone who did believe him? God gave them the right to become his kids."
    },
    {
      "verse": "13",
      "text": "Not through human effort or plans, but straight-up born from God."
    },
    {
      "verse": "14",
      "text": "The Word became human and vibed with us. We saw his glory—full of grace and truth."
    },
    {
      "verse": "15",
      "text": "John flexed, “This is the one I was telling you about: coming after me but actually way ahead.”"
    },
    {
      "verse": "16",
      "text": "From him, we’ve all gotten blessings, over and over."
    },
    {
      "verse": "17",
      "text": "Law came through Moses, but grace and truth came through Jesus."
    },
    {
      "verse": "18",
      "text": "No one has seen God, but Jesus, the One and Only, who is close to God’s heart, revealed him."
    },
    {
      "verse": "19",
      "text": "“So here’s what went down — the Jewish leaders from Jerusalem pulled up, sending some priests and Levite bros to John like, ‘Ayo… who even are you, fr?”"
    },
    {
      "verse": "20",
      "text": "He didn’t hold back: “I’m not the Messiah.”"
    },
    {
      "verse": "21",
      "text": "They asked, “Then are you Elijah?” He said, “Nah.” “Are you the Prophet?” He said, “No.”"
    },
    {
      "verse": "22",
      "text": "“Who are you then? Tell us so we can explain to people why you’re baptizing.”"
    },
    {
      "verse": "23",
      "text": "He said, “I’m the voice shouting in the desert: ‘Get your life ready for the Lord!’”"
    },
    {
      "verse": "24",
      "text": "Some Pharisees were sent from Jerusalem to check him out."
    },
    {
      "verse": "25",
      "text": "They asked him, “Why are you baptizing if you’re not the Messiah, Elijah, or the Prophet?”"
    },
    {
      "verse": "26",
      "text": "John said, “I baptize with water, but one way more epic is coming after me—way stronger.”"
    },
    {
      "verse": "27",
      "text": "“I’m not even worthy to tie his sandals. That’s how next-level he is.”"
    },
    {
      "verse": "28",
      "text": "This happened in Bethany across the Jordan River."
    },
    {
      "verse": "29",
      "text": "Next day, John saw Jesus and said, “Look! The Lamb of God who takes away the world’s sin!”"
    },
    {
      "verse": "30",
      "text": "“He’s the one I was talking about when I said, ‘After me comes a guy who’s higher ranked than me.’”"
    },
    {
      "verse": "31",
      "text": "“I didn’t know him before, but God sent me to reveal him to Israel.”"
    },
    {
      "verse": "32",
      "text": "John testified, “I saw the Spirit descend like a dove from heaven and stay on him.”"
    },
    {
      "verse": "33",
      "text": "“I didn’t know he was the one, but God told me, ‘The one you see the Spirit on—that’s him.’”"
    },
    {
      "verse": "34",
      "text": "“I’ve seen it and can confirm: he’s God’s chosen.”"
    },
    {
      "verse": "35",
      "text": "Next day, John was with two of his followers."
    },
    {
      "verse": "36",
      "text": "He looked at Jesus walking by and said, “Look! The Lamb of God!”"
    },
    {
      "verse": "37",
      "text": "The two followers heard him and started following Jesus."
    },
    {
      "verse": "38",
      "text": "Jesus turned and asked, “What’s up? What are you looking for?” They said, “Where are you staying?”"
    },
    {
      "verse": "39",
      "text": "Jesus said, “Come see.” So they spent the day with him. It was about 10 AM."
    },
    {
      "verse": "40",
      "text": "One of the two who heard John and followed Jesus was Andrew, Simon Peter’s brother."
    },
    {
      "verse": "41",
      "text": "Andrew first found his brother Simon and said, “We found the Messiah!” (which means Christ)."
    },
    {
      "verse": "42",
      "text": "He brought Simon to Jesus. Jesus looked at him and said, “You’re Simon, son of John? You’ll be called Cephas” (that means Peter)."
    },
    {
      "verse": "43",
      "text": "Next day, Jesus decided to head to Galilee. He found Philip and said, “Follow me.”"
    },
    {
      "verse": "44",
      "text": "Philip was from Bethsaida, same city as Andrew and Peter."
    },
    {
      "verse": "45",
      "text": "Philip found Nathanael and said, “We found the one Moses and the prophets wrote about—Jesus of Nazareth, Joseph’s son.”"
    },
    {
      "verse": "46",
      "text": "Nathanael was like, “Nazareth? Come on, can anything good come from there?” Philip said, “Come see for yourself.”"
    },
    {
      "verse": "47",
      "text": "Jesus saw Nathanael coming and said, “Here’s a real Israelite, no cap, no fake vibes.”"
    },
    {
      "verse": "48",
      "text": "Nathanael asked, “How do you know me?” Jesus said, “I saw you under the fig tree before Philip called you.”"
    },
    {
      "verse": "49",
      "text": "Nathanael replied, “Rabbi, you’re God’s Son! You’re the King of Israel!”"
    },
    {
      "verse": "50",
      "text": "Jesus said, “You believe just because I saw you under a tree? You’ll see bigger things than that.”"
    },
    {
      "verse": "51",
      "text": "Then Jesus said, “For real, you’ll see heaven open, angels moving up and down on the Son of Man.”"
    }
  ]
},
{
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "A few days later, there was a wedding in Cana, Galilee. Jesus’ mom was there."
    },
    {
      "verse": "2",
      "text": "Jesus and his disciples were also invited to the wedding."
    },
    {
      "verse": "3",
      "text": "When the wine ran out, Jesus’ mom told him, “They’re out of wine.”"
    },
    {
      "verse": "4",
      "text": "Jesus said, “What’s up with me and you? My time hasn’t come yet, but we’ll talk.”"
    },
    {
      "verse": "5",
      "text": "His mom told the servants, “Do whatever he tells you.”"
    },
    {
      "verse": "6",
      "text": "Nearby, there were six big stone water jars, used for Jewish rituals, each holding 20–30 gallons."
    },
    {
      "verse": "7",
      "text": "Jesus told the servants, “Fill the jars with water.” They filled them to the top."
    },
    {
      "verse": "8",
      "text": "Then he told them, “Now take some out and give it to the master of the banquet.” They did."
    },
    {
      "verse": "9",
      "text": "The master of the banquet tasted it—boom! It was wine. He didn’t know where it came from, but the servants did."
    },
    {
      "verse": "10",
      "text": "He called the bridegroom, “Everyone serves the good wine first, then the cheaper wine after the guests are drunk. But you saved the best for last!”"
    },
    {
      "verse": "11",
      "text": "This was Jesus’ first miracle in Cana, and it showed his glory. His disciples saw it and believed in him."
    },
    {
      "verse": "12",
      "text": "After that, Jesus, his mom, his brothers, and his disciples went down to Capernaum and stayed a few days."
    },
    {
      "verse": "13",
      "text": "It was almost time for the Jewish Passover, and Jesus went up to Jerusalem."
    },
    {
      "verse": "14",
      "text": "In the temple courts, he found people selling cattle, sheep, and doves, and others exchanging money."
    },
    {
      "verse": "15",
      "text": "He made a whip from cords and drove everyone out, including the animals. He dumped the money on the floor."
    },
    {
      "verse": "16",
      "text": "He told the sellers, “Take these out of here! Stop turning my Father’s house into a marketplace!”"
    },
    {
      "verse": "17",
      "text": "His disciples remembered what the Scriptures said: “God’s passion for your house will eat me up.”"
    },
    {
      "verse": "18",
      "text": "The Jews asked Jesus, “What miracle can you show us to justify what you’re doing?”"
    },
    {
      "verse": "19",
      "text": "Jesus answered, “Destroy this temple, and in three days I’ll raise it up.”"
    },
    {
      "verse": "20",
      "text": "They said, “It took 46 years to build this temple! How can you rebuild it in three days?”"
    },
    {
      "verse": "21",
      "text": "But Jesus was talking about his body as the temple."
    },
    {
      "verse": "22",
      "text": "After he was raised from the dead, his disciples remembered what he said, and they believed the Scripture and his words."
    },
    {
      "verse": "23",
      "text": "While he was in Jerusalem for the Passover, many people saw the signs he was doing and believed in his name."
    },
    {
      "verse": "24",
      "text": "But Jesus didn’t trust them because he knew human nature."
    },
    {
      "verse": "25",
      "text": "He didn’t need proof about anyone—he already knew what was in people’s hearts."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "There was a Pharisee named Nicodemus, a big deal in the Jewish council."
    },
    {
      "verse": "2",
      "text": "He came to Jesus at night and said, “Yo, we know you’re a teacher from God. No one could do these miracles unless God is with them.”"
    },
    {
      "verse": "3",
      "text": "Jesus said, “For real, unless someone is born again, they can’t even see God’s kingdom.”"
    },
    {
      "verse": "4",
      "text": "Nicodemus was like, “Wait, how can a grown man be born again? You can’t enter your mom’s womb twice, right?”"
    },
    {
      "verse": "5",
      "text": "Jesus said, “For real, unless someone is born of water and Spirit, they can’t enter God’s kingdom.”"
    },
    {
      "verse": "6",
      "text": "“Whatever is born of flesh is just human. Whatever is born of Spirit is a whole new life.”"
    },
    {
      "verse": "7",
      "text": "“Don’t get shook that I said, ‘You need to be born again.’”"
    },
    {
      "verse": "8",
      "text": "“The Spirit moves however it wants. You hear it, but you don’t know where it comes from or where it’s going. That’s how God’s Spirit works.”"
    },
    {
      "verse": "9",
      "text": "Nicodemus asked, “How does this even happen?”"
    },
    {
      "verse": "10",
      "text": "Jesus said, “You’re a teacher in Israel and don’t get this? For real, I’m talking about God’s kingdom.”"
    },
    {
      "verse": "11",
      "text": "“For real, I’m telling you what I know and what I’ve seen, but you won’t even vibe with it.”"
    },
    {
      "verse": "12",
      "text": "“If I told you earthly stuff and you don’t believe, how will you believe spiritual things?”"
    },
    {
      "verse": "13",
      "text": "“No one has gone up to heaven except the one who came down from heaven—the Son of Man.”"
    },
    {
      "verse": "14",
      "text": "“Like Moses lifted up the snake in the desert, the Son of Man must be lifted up too.”"
    },
    {
      "verse": "15",
      "text": "“So anyone who believes in him can have eternal life.”"
    },
    {
      "verse": "16",
      "text": "“God loved the world so much that he gave his one and only Son, so anyone who believes won’t get lost but have eternal life.”"
    },
    {
      "verse": "17",
      "text": "“God didn’t send his Son to judge the world, but to save it.”"
    },
    {
      "verse": "18",
      "text": "“Whoever believes in him isn’t judged. Whoever doesn’t believe is already judged because they didn’t believe in God’s Son.”"
    },
    {
      "verse": "19",
      "text": "“Light came into the world, but people loved darkness more than the light because their vibes were shady.”"
    },
    {
      "verse": "20",
      "text": "“Everyone who does sketchy stuff hates the light and avoids it because it exposes them.”"
    },
    {
      "verse": "21",
      "text": "“But anyone who lives by the truth comes into the light, so everyone can see their vibes are in line with God.”"
    },
    {
      "verse": "22",
      "text": "After this, Jesus and his disciples went out into Judea, and he spent time baptizing."
    },
    {
      "verse": "23",
      "text": "John was also baptizing at Aenon near Salim, because there was plenty of water. People were coming and being baptized."
    },
    {
      "verse": "24",
      "text": "(It wasn’t John yet—he hadn’t been thrown into prison.)"
    },
    {
      "verse": "25",
      "text": "A debate came up between John’s disciples and a Jew about purification."
    },
    {
      "verse": "26",
      "text": "John’s disciples told him, “Yo, the guy you were talking about? He’s baptizing and everyone’s going to him.”"
    },
    {
      "verse": "27",
      "text": "John said, “Hold up—no one can get anything unless God gives it.”"
    },
    {
      "verse": "28",
      "text": "“You know, we baptized people, but he’s coming from above and is higher ranked than me.”"
    },
    {
      "verse": "29",
      "text": "“The one with the bride is the bridegroom. I’m just the best man—standing there cheering because I hear his voice. He’s my priority.”"
    },
    {
      "verse": "30",
      "text": "“He must become bigger; I must become smaller.”"
    },
    {
      "verse": "31",
      "text": "“The one coming from above is above all. The one from the earth talks about earthly things, but the one from heaven is above all.”"
    },
    {
      "verse": "32",
      "text": "“He testifies about what he’s seen and heard—but no one takes his word straight up.”"
    },
    {
      "verse": "33",
      "text": "“Anyone who trusts his testimony confirms God is real.”"
    },
    {
      "verse": "34",
      "text": "“God gives the Spirit without limits.”"
    },
    {
      "verse": "35",
      "text": "“The Father loves the Son and gave him all power.”"
    },
    {
      "verse": "36",
      "text": "“Anyone who believes in the Son has eternal life. Anyone who doesn’t obey the Son will never see life, and God’s anger stays on them.”"
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "So Jesus caught wind that people were hyping him up more than John for baptizing,"
    },
    {
      "verse": "2",
      "text": "even though Jesus himself wasn’t the one dunking people—his squad was."
    },
    {
      "verse": "3",
      "text": "He bounced out of Judea and rolled back to Galilee."
    },
    {
      "verse": "4",
      "text": "On the way, he had to slide through Samaria."
    },
    {
      "verse": "5",
      "text": "He pulled up to a town called Sychar, near the field Jacob gave to Joseph his son."
    },
    {
      "verse": "6",
      "text": "Dead tired from the trip, Jesus just chilled by the well around noon."
    },
    {
      "verse": "7",
      "text": "A Samaritan woman came to grab water, and Jesus was like, “Yo, can I get a sip?”"
    },
    {
      "verse": "8",
      "text": "(Meanwhile, the disciples dipped into town to grab some snacks.)"
    },
    {
      "verse": "9",
      "text": "She side-eyed him: “Hold up… you’re a Jew asking me, a Samaritan, for water? That’s sus.”"
    },
    {
      "verse": "10",
      "text": "Jesus was like, “Real talk—if you knew who you were talking to, you’d be like, ‘Give me that living water!’ And I’d hook you up, no cap.”"
    },
    {
      "verse": "11",
      "text": "She was shook: “Bruh, you don’t even have a bucket, and this well is deep. Where’s this living water even coming from?”"
    },
    {
      "verse": "12",
      "text": "“Are you telling me you’re bigger than our OG Jacob, who gave us this well?”"
    },
    {
      "verse": "13",
      "text": "Jesus said, “Anyone who drinks regular water? Yeah, you’ll just get thirsty again."
    },
    {
      "verse": "14",
      "text": "But the water I give? Eternal drip. Never dry, always hydrated spiritually.”"
    },
    {
      "verse": "15",
      "text": "She was low-key vibing: “Bet, gimme that water, so I don’t have to keep trekking here every day.”"
    },
    {
      "verse": "16",
      "text": "Jesus said, “Go call your man.”"
    },
    {
      "verse": "17",
      "text": "She froze: “Uh… I don’t have one.”"
    },
    {
      "verse": "18",
      "text": "Jesus: “Right, you’ve had a few side hustles, and the guy you’re with now? Not officially yours.”"
    },
    {
      "verse": "19",
      "text": "She realized: “Okay… you’re no basic prophet, I see you.”"
    },
    {
      "verse": "20",
      "text": "She asked, “Our squad worships on this mountain, but y’all Jews say Jerusalem’s the spot. What’s the move?”"
    },
    {
      "verse": "21",
      "text": "Jesus dropped the wisdom: “Listen, real worshipers don’t stress locations. God wants people who worship in truth and spirit, period.”"
    },
    {
      "verse": "22",
      "text": "“God is spirit, so if you’re real with Him, you gotta worship spiritually.”"
    },
    {
      "verse": "23",
      "text": "She said, “I know the Messiah is coming—he’s gonna spill all the tea.”"
    },
    {
      "verse": "24",
      "text": "Jesus straight-up said, “I’m the one. I’m talking to you, live.”"
    },
    {
      "verse": "25",
      "text": "The disciples came back and low-key were shook seeing him chatting with a woman, but they didn’t clap back."
    },
    {
      "verse": "26",
      "text": "She ditched her water jar, ran into town, and was like, “Yo, come see this guy! He told me everything I ever did. Could he be the Messiah?”"
    },
    {
      "verse": "27",
      "text": "People rolled out, curious."
    },
    {
      "verse": "28",
      "text": "Meanwhile, the disciples were like, “Yo, eat something, we’re starving.”"
    },
    {
      "verse": "29",
      "text": "Jesus said, “Nah fam, my food is doing what God sent me here to do.”"
    },
    {
      "verse": "30",
      "text": "They were confused: “Uh… did someone bring food?”"
    },
    {
      "verse": "31",
      "text": "Jesus: “Nope, my actual mission feeds me more than any snack.”"
    },
    {
      "verse": "32",
      "text": "They didn’t get it, but they stayed."
    },
    {
      "verse": "33",
      "text": "Jesus said, “Peep the fields—they’re basically ready for harvest.”"
    },
    {
      "verse": "34",
      "text": "“And I’m telling you, harvest isn’t about crops—it’s about people. The ones who plant and the ones who reap? They’re vibing for the same goal.”"
    },
    {
      "verse": "35",
      "text": "“Here’s the real talk: one plants, another reaps, but both get rewarded big time.”"
    },
    {
      "verse": "36",
      "text": "“The laborers may switch, but the reward is still mad real.”"
    },
    {
      "verse": "37",
      "text": "“I sent you to reap what you didn’t plant; other people put in the grind, now you’re benefiting too.”"
    },
    {
      "verse": "38",
      "text": "Loads of Samaritans believed because of the woman’s hype."
    },
    {
      "verse": "39",
      "text": "When they came to see Jesus, they begged him to stay, and he stayed two days."
    },
    {
      "verse": "40",
      "text": "Many more believed just from listening to him."
    },
    {
      "verse": "41",
      "text": "They told the woman, “We believe now, not just ‘cause of you—your guy’s legit, the Savior of the world.”"
    },
    {
      "verse": "42",
      "text": "After this, Jesus dipped to Galilee,"
    },
    {
      "verse": "43",
      "text": "but he knew prophets don’t usually get respect in their hometown."
    },
    {
      "verse": "44",
      "text": "The Galileans welcomed him because they saw the receipts—everything he did in Jerusalem during the festival."
    },
    {
      "verse": "45",
      "text": "Jesus came back to Cana in Galilee, where he had done the water-to-wine flex. There, he healed a nobleman’s son."
    },
    {
      "verse": "46",
      "text": "The dude’s son was sick, straight from Capernaum."
    },
    {
      "verse": "47",
      "text": "The dad begged, “Yo, come down before my kid dies.”"
    },
    {
      "verse": "48",
      "text": "Jesus said, “Unless you see some signs and miracles, you won’t believe.”"
    },
    {
      "verse": "49",
      "text": "The dad said, “Bet, but come heal him before it’s too late.”"
    },
    {
      "verse": "50",
      "text": "Jesus: “Go home, your kid’s alive.” The man believed Jesus’ word and bounced."
    },
    {
      "verse": "51",
      "text": "On the way, his servants met him with the news: his son’s alive and thriving."
    },
    {
      "verse": "52",
      "text": "He asked when it happened, and they said, “Yesterday, at one in the afternoon, the fever dipped.”"
    },
    {
      "verse": "53",
      "text": "The dad realized it matched exactly when Jesus said, “Your son’s alive.” So he and his whole crew believed."
    },
    {
      "verse": "54",
      "text": "This was the second big miracle Jesus did after leaving Judea for Galilee."
    }]},
    {
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, after that, there was a big Jewish holiday, and Jesus pulled up to Jerusalem."
    },
    {
      "verse": "2",
      "text": "There’s this famous spot in the city called Bethesda, with five porches. Loads of sick peeps used to chill there—blind, lame, or just stuck in pain."
    },
    {
      "verse": "3",
      "text": "(Some old scrolls say an angel would roll through the pool and stir the water. First one in after that got healed.)"
    },
    {
      "verse": "4",
      "text": "Jesus sees this dude who’s been stuck in his condition for 38 years."
    },
    {
      "verse": "5",
      "text": "He’s like, “Bro, you’ve been out here a long time. Wanna get better?”"
    },
    {
      "verse": "6",
      "text": "The man was like, “I don’t even have anyone to help me into the pool when the water moves. Others beat me there.”"
    },
    {
      "verse": "7",
      "text": "Jesus drops, “Get up, pick up your mat, and walk.”"
    },
    {
      "verse": "8",
      "text": "And guess what? Dude got up instantly and bounced."
    },
    {
      "verse": "9",
      "text": "It was a Saturday, so the Jewish leaders were salty and told him, “Yo, it’s the Sabbath, you can’t be carrying your mat.”"
    },
    {
      "verse": "10",
      "text": "But he was like, “The guy who healed me told me to, so I did.”"
    },
    {
      "verse": "11",
      "text": "They asked, “Who’s that guy who told you to do that?”"
    },
    {
      "verse": "12",
      "text": "But the man didn’t know, Jesus had dipped before anyone could ID Him."
    },
    {
      "verse": "13",
      "text": "Later, Jesus finds him and says, “Hey, you’re healed! Don’t slack off—sin no more, or worse stuff could happen.”"
    },
    {
      "verse": "14",
      "text": "Dude went back and told the leaders that Jesus was the one who healed him."
    },
    {
      "verse": "15",
      "text": "After that, the Jews started beefing with Jesus because He was doing stuff only God could do."
    },
    {
      "verse": "16",
      "text": "They were mad He was healing on the Sabbath."
    },
    {
      "verse": "17",
      "text": "Jesus claps back, “Yo, my Father’s been working nonstop, and I’m working too.”"
    },
    {
      "verse": "18",
      "text": "This made them even more triggered—they tried to cancel Him because He was flexing God-level status, calling God His own Father."
    },
    {
      "verse": "19",
      "text": "Jesus breaks it down: “No cap, I do nothing on my own. I only do what I see my Father doing. Whatever He does, I do too.”"
    },
    {
      "verse": "20",
      "text": "He adds, “For real, the Father loves me, and He shows me all His moves. You’ll see me flexing even bigger stuff than this.”"
    },
    {
      "verse": "21",
      "text": "“Because just like the Father can bring the dead back to life, I can do the same—no lie.”"
    },
    {
      "verse": "22",
      "text": "“The Father isn’t calling the shots solo; He gave all the power to the Son to judge.”"
    },
    {
      "verse": "23",
      "text": "“So, whoever honors the Son honors the Father. No contest.”"
    },
    {
      "verse": "24",
      "text": "“Real talk, anyone who vibes with me and listens to my words has eternal life. They’re not getting canceled—they’re secure.”"
    },
    {
      "verse": "25",
      "text": "“And check it—dead people in the grave will hear my voice and come alive.”"
    },
    {
      "verse": "26",
      "text": "“Cause just like my Father has life in Him, He gave me that life too.”"
    },
    {
      "verse": "27",
      "text": "“I was handed all the authority to judge, and it’s fair.”"
    },
    {
      "verse": "28",
      "text": "“Don’t sleep on this—dead folks will rise, some for blessings, some for judgment.”"
    },
    {
      "verse": "29",
      "text": "“And those who do good will shine, those who do shady stuff will face the consequences.”"
    },
    {
      "verse": "30",
      "text": "“I don’t flex on my own. I judge fair, just like the Father taught me.”"
    },
    {
      "verse": "31",
      "text": "“If I drop receipts about myself, they’re legit—but the Father backing me up is stronger.”"
    },
    {
      "verse": "32",
      "text": "“You’ve also seen John the Baptizer’s vibe; he came telling the truth.”"
    },
    {
      "verse": "33",
      "text": "“I respect John’s words, and you know he spoke the truth.”"
    },
    {
      "verse": "34",
      "text": "“But I don’t need just one witness—my works, showing God’s love and power, are proof.”"
    },
    {
      "verse": "35",
      "text": "“The Father who sent me also testified, and you haven’t really recognized Him.”"
    },
    {
      "verse": "36",
      "text": "“I’ve shown you mad signs and miracles from Him. Who sees me sees the Father’s touch.”"
    },
    {
      "verse": "37",
      "text": "“But you’re still not down with the Father’s vibe in these works.”"
    },
    {
      "verse": "38",
      "text": "“I’m rolling with what I heard from Him, and you don’t get the full picture.”"
    },
    {
      "verse": "39",
      "text": "“You read the Scriptures all day, thinking they give life, but they’re really dropping receipts about me.”"
    },
    {
      "verse": "40",
      "text": "“Still, you won’t come to me to get life.”"
    },
    {
      "verse": "41",
      "text": "“I don’t care about getting human props; I know you don’t truly respect God.”"
    },
    {
      "verse": "42",
      "text": "“I know what’s in you: loving praise from humans is your priority, not God’s truth.”"
    },
    {
      "verse": "43",
      "text": "“I came in my Father’s name, but you don’t flex with me. If another rolls up in their own name, you’re quick to vibe with them.”"
    },
    {
      "verse": "44",
      "text": "“How can you believe when you’re out here chasing human hype?”"
    },
    {
      "verse": "45",
      "text": "“Don’t think I’m gonna throw shade—I’ll defend myself with the Father’s word. He sent me, and that’s my testimony.”"
    },
    {
      "verse": "46",
      "text": "“If you really believed Moses, you’d believe me—he wrote about me!”"
    },
    {
      "verse": "47",
      "text": "“But since you don’t believe his script, you’re ghosting me too.”"
    }]},
    {
  "chapter": "6",
  "verses": [
    {
      "verse": "1",
      "text": "After that, Jesus dipped over the Sea of Galilee—crowds were vibing with Him ‘cause He healed mad people."
    },
    {
      "verse": "2",
      "text": "Jesus saw the crowd coming and realized they were tryna keep up with Him even though they were struggling."
    },
    {
      "verse": "3",
      "text": "He pulled His squad aside, low-key, and chilled for a bit."
    },
    {
      "verse": "4",
      "text": "It was around the Passover holiday, so everyone was hyped."
    },
    {
      "verse": "5",
      "text": "Jesus looked at the crowd and asked Philip, “Yo, where are we gonna get food for all these people?”"
    },
    {
      "verse": "6",
      "text": "He said this to test him, not ‘cause He didn’t know the move already."
    },
    {
      "verse": "7",
      "text": "Philip did the math in his head, “Bruh, it would cost mad cash just to give everyone a bite!”"
    },
    {
      "verse": "8",
      "text": "Andrew, Simon Peter’s bro, says, “Yo, there’s a kid here with five loaves and two fish—but what’s that gonna do for thousands?”"
    },
    {
      "verse": "9",
      "text": "Jesus said, “Bet. Tell everyone to sit down.” There was a lot of grass out there, so they chilled in squads."
    },
    {
      "verse": "10",
      "text": "Jesus took the five loaves and two fish, looked up to God, blessed the food, then handed it to the crowd. Everyone got fed, mad energy, no one went hungry."
    },
    {
      "verse": "11",
      "text": "They ate ‘til they were full."
    },
    {
      "verse": "12",
      "text": "And Jesus told His crew, “Yo, gather up the leftovers, don’t waste anything.” They picked up 12 baskets full."
    },
    {
      "verse": "13",
      "text": "The people were shook—they realized, “Yo, this is kinda miraculous!”"
    },
    {
      "verse": "14",
      "text": "That night, the crowd realized, “This has gotta be the Prophet, the one Moses said would come.”"
    },
    {
      "verse": "15",
      "text": "Jesus knew they were tryna crown Him king by force, so He dipped back to the hills alone."
    },
    {
      "verse": "16",
      "text": "Evening rolls in, His squad gets into a boat heading across the Sea of Galilee."
    },
    {
      "verse": "17",
      "text": "It got dark, and the water was rough."
    },
    {
      "verse": "18",
      "text": "Jesus hadn’t joined yet."
    },
    {
      "verse": "19",
      "text": "Waves were crashing, and they were stressed, paddling hard."
    },
    {
      "verse": "20",
      "text": "Then Jesus walks on the water, straight up, heading toward them. They were shook."
    },
    {
      "verse": "21",
      "text": "But He said, “Relax, it’s me. Don’t freak.” They pulled Him into the boat, and instantly they reached the shore safely."
    },
    {
      "verse": "22",
      "text": "Next day, the crowd sees Jesus in Capernaum and starts asking Him, “Yo, when did you get here?”"
    },
    {
      "verse": "23",
      "text": "Jesus said, “No one comes to Me unless the Father draws them. I’m not flexing my own moves.”"
    },
    {
      "verse": "24",
      "text": "“Real talk, everyone who vibes with Me has eternal life, and I won’t ghost them.”"
    },
    {
      "verse": "25",
      "text": "The crowd was like, “Yo, what’s up with these signs you pulled yesterday with the bread?”"
    },
    {
      "verse": "26",
      "text": "Jesus said, “Listen, y’all aren’t here just because of free food. Keep it real—you’re chasing Me for the snacks.”"
    },
    {
      "verse": "27",
      "text": "“Work for the stuff that lasts forever, stuff God’s giving, not just your stomach.”"
    },
    {
      "verse": "28",
      "text": "They were like, “What’s the move we gotta do to make that happen?”"
    },
    {
      "verse": "29",
      "text": "Jesus said, “Believe in the One God sent.”"
    },
    {
      "verse": "30",
      "text": "They wanted receipts, like, “Show us a sign, like manna in the desert.”"
    },
    {
      "verse": "31",
      "text": "Moses gave our ancestors bread from heaven, right?"
    },
    {
      "verse": "32",
      "text": "Jesus said, “No cap, Moses didn’t give y’all bread from God. I’m the real Bread from heaven.”"
    },
    {
      "verse": "33",
      "text": "“Whoever eats this bread will never be hungry; whoever believes in Me will never thirst.”"
    },
    {
      "verse": "34",
      "text": "They said, “Yo, give us this bread every day.”"
    },
    {
      "verse": "35",
      "text": "Jesus flexed, “I’m the Bread of Life. Whoever rolls with Me will never starve for truth.”"
    },
    {
      "verse": "36",
      "text": "“Your ancestors ate manna and still dipped, but those who chow down on Me will live forever.”"
    },
    {
      "verse": "37",
      "text": "“I won’t ghost anyone who comes to Me; I’ll pull them in, no cap.”"
    },
    {
      "verse": "38",
      "text": "“I came down from heaven, not to do my own flexing, but to do the Father’s plan.”"
    },
    {
      "verse": "39",
      "text": "“My mission? None of the ones God gave Me will be lost. I’ll bring them all up on the last day.”"
    },
    {
      "verse": "40",
      "text": "“God’s plan is that everyone who vibes with Me sees eternal life, no one gets canceled.”"
    },
    {
      "verse": "41",
      "text": "The Jews were salty, “Yo, why is He saying He came down from heaven? Isn’t this Jesus, Joseph’s kid?”"
    },
    {
      "verse": "42",
      "text": "“Don’t play with us—Jesus, the Son of God, the King of Israel?”"
    },
    {
      "verse": "43",
      "text": "Jesus claps back, “Stop fronting. No one can come to Me unless God draws them, and I’ll raise them up at the last day.”"
    },
    {
      "verse": "44",
      "text": "“I’m not just talking random vibes; the Father sent Me, and I’ll pull them all in.”"
    },
    {
      "verse": "45",
      "text": "“It’s written in the prophets: ‘They’ll all be taught by God.’ Anyone who listens and learns from the Father comes to Me.”"
    },
    {
      "verse": "46",
      "text": "“No one has seen the Father except the One who came from Him—Me.”"
    },
    {
      "verse": "47",
      "text": "“Real talk, whoever believes has eternal life.”"
    },
    {
      "verse": "48",
      "text": "“I am the Bread of Life."
    },
    {
      "verse": "49",
      "text": "Your ancestors ate manna and still dipped in hunger,"
    },
    {
      "verse": "50",
      "text": "But I’m the Bread that drops eternal life for anyone who vibes with Me.”"
    },
    {
      "verse": "51",
      "text": "“I’m about to flex—give My life so all can get this true bread. Whoever eats it won’t die spiritually; they live forever.”"
    },
    {
      "verse": "52",
      "text": "The Jews started arguing, “Yo, how can this guy literally give us His flesh to eat?”"
    },
    {
      "verse": "53",
      "text": "Jesus said, “No cap, if you don’t eat the Bread of Life and drink the Cup of Life, you won’t have real life in you.”"
    },
    {
      "verse": "54",
      "text": "“Whoever eats Me and believes in Me will have eternal life. I’ll raise them on the last day.”"
    },
    {
      "verse": "55",
      "text": "“My flesh is real food; My blood is real drink. If you really eat and drink this way, you’ll live forever.”"
    },
    {
      "verse": "56",
      "text": "“Whoever vibes with Me stays in Me, and I in them.”"
    },
    {
      "verse": "57",
      "text": "“I’m about the Father’s plan, and if you follow, you’ll get the same life I’ve got.”"
    },
    {
      "verse": "58",
      "text": "“I’m dropping real talk: whoever eats this bread will live forever. It’s not like your ancestors who ate and still dipped.”"
    },
    {
      "verse": "59",
      "text": "Jesus said this in a synagogue in Capernaum, teaching hard truths."
    },
    {
      "verse": "60",
      "text": "Many of His squad were like, “Whoa… this is intense. Hard vibes. Who can listen to this?”"
    },
    {
      "verse": "61",
      "text": "Jesus knew peeps were salty and murmuring about Him."
    },
    {
      "verse": "62",
      "text": "He said, “Yo, if you see Me flexing in heaven, you’ll get why I said this. No one can vibe with eternal life unless God opens them up.”"
    },
    {
      "verse": "63",
      "text": "“Spirit is where the life’s at, not just the meat. My words are full of life, straight up.”"
    },
    {
      "verse": "64",
      "text": "“I told you, some won’t believe. That’s why I said, ‘No one can come unless drawn by the Father.’”"
    },
    {
      "verse": "65",
      "text": "“From the start, God chose who would believe and who wouldn’t.”"
    },
    {
      "verse": "66",
      "text": "From that day, many of His followers dipped—they couldn’t handle the real talk."
    },
    {
      "verse": "67",
      "text": "Jesus asked the 12, “Yo, you’re staying or bouncing?”"
    },
    {
      "verse": "68",
      "text": "Simon Peter said, “Yo, Jesus, where else we gonna go? You’ve got the words of eternal life.”"
    },
    {
      "verse": "69",
      "text": "“We’ve peeped that You’re the Holy One of God.”"
    },
    {
      "verse": "70",
      "text": "Jesus replied, “I know, I chose you 12, but one of you is a total snake.”"
    },
    {
      "verse": "71",
      "text": "He meant Judas, son of Simon Iscariot, ‘cause he was gonna betray Him—though Jesus didn’t drop the full tea yet."
    }]},
    {
  "chapter": "7",
  "verses": [
    {
      "verse": "1",
      "text": "After this, Jesus stayed low in Galilee ‘cause the Jews were tryna take Him out in Judea."
    },
    {
      "verse": "2",
      "text": "But the Jewish festival of Booths (Sukkot) was coming up."
    },
    {
      "verse": "3",
      "text": "His brothers said, “Yo, why are You chillin’? Go to Judea so Your squad can see You flex.”"
    },
    {
      "verse": "4",
      "text": "“No one hides if they want clout—come show Yourself.”"
    },
    {
      "verse": "5",
      "text": "Even His fam didn’t really believe in Him."
    },
    {
      "verse": "6",
      "text": "Jesus said, “Nah, my time isn’t here yet, but your time’s always lit.”"
    },
    {
      "verse": "7",
      "text": "So He stayed in Galilee."
    },
    {
      "verse": "8",
      "text": "After His brothers went to the festival, He didn’t go publicly."
    },
    {
      "verse": "9",
      "text": "But after a while, He went secretly."
    },
    {
      "verse": "10",
      "text": "The Jews were watching, whispering, “Where’s He at?”"
    },
    {
      "verse": "11",
      "text": "Crowds were split—some hyped, some salty, wondering how He knew so much without school."
    },
    {
      "verse": "12",
      "text": "During the festival, Jesus was teaching in the temple."
    },
    {
      "verse": "13",
      "text": "People were shook, saying, “How does this guy know so much?”"
    },
    {
      "verse": "14",
      "text": "Jesus said, “My teaching isn’t mine—it comes from the One who sent Me.”"
    },
    {
      "verse": "15",
      "text": "“If anyone wants to do God’s truth, they’ll recognize it and see the facts.”"
    },
    {
      "verse": "16",
      "text": "“Whoever speaks for Me isn’t doing it for clout; God’s got their back.”"
    },
    {
      "verse": "17",
      "text": "“If anyone's actually bout that life (truly wanting to do God’s will), they'll vibe with my teaching and know it’s not cap.”"
    },
    {
      "verse": "18",
      "text": "Whoever tries to flex for themselves won’t last; the One who sent Me knows the truth, and I follow Him."
    },
    {
      "verse": "19",
      "text": "The Jews were salty, saying, “Why’s He breaking rules?”"
    },
    {
      "verse": "20",
      "text": "Some said, “He can’t be from God.”"
    },
    {
      "verse": "21",
      "text": "Jesus said, “Stop fronting. You don’t know Me or the One who sent Me, so quit hating.”"
    },
    {
      "verse": "22",
      "text": "“Moses gave y’all the rule about circumcision (though it really came from the ancestors), and y’all still do that on the Sabbath.”"
    },
    {
      "verse": "23",
      "text": "If the Son makes you free, you’ll really be free."
    },
    {
      "verse": "24",
      "text": "Don’t judge by looks; judge by truth."
    },
    {
      "verse": "25",
      "text": "Some were arguing, some impressed."
    },
    {
      "verse": "26",
      "text": "“If anyone’s truly about God’s will, they’ll recognize My teaching,” Jesus said."
    },
    {
      "verse": "27",
      "text": "“I’m not flexing for Myself; the Father sent Me. He knows the truth, and I follow Him.”"
    },
    {
      "verse": "28",
      "text": "“If you knew Me, you’d know the Father too.”"
    },
    {
      "verse": "29",
      "text": "Many were still confused and debating."
    },
    {
      "verse": "30",
      "text": "Some tried to grab Him, but no one had the power yet."
    },
    {
      "verse": "31",
      "text": "Many believed after seeing His teaching."
    },
    {
      "verse": "32",
      "text": "But some went to the Pharisees and complained."
    },
    {
      "verse": "33",
      "text": "Jesus moved quietly to keep teaching."
    },
    {
      "verse": "34",
      "text": "Midway, He openly taught in the temple."
    },
    {
      "verse": "35",
      "text": "He said, “Anyone thirsty for truth, come to Me and drink. Whoever believes will get living water inside them.”"
    },
    {
      "verse": "36",
      "text": "People were confused; they didn’t get He meant the Spirit."
    },
    {
      "verse": "37",
      "text": "On the last day of the festival, He stood and shouted: “If anyone’s thirsty, come to Me! Drink the truth I give!”"
    },
    {
      "verse": "38",
      "text": "“Whoever believes in Me, just like the Scripture said, will have rivers of living water flowing from their core.”"
    },
    {
      "verse": "39",
      "text": "He was talking about the Spirit, which believers would get later after He was glorified."
    },
    {
      "verse": "40",
      "text": "Many said, “This has to be the Prophet.”"
    },
    {
      "verse": "41",
      "text": "Others said, “Nah, this is the Messiah.”"
    },
    {
      "verse": "42",
      "text": "Yet others said, “No way, He’s from Galilee. Messiah can’t come from there.”"
    },
    {
      "verse": "43",
      "text": "The crowd was split: some vibing, some salty, some confused."
    },
    {
      "verse": "44",
      "text": "Some wanted to arrest Him, but no one laid hands on Him."
    },
    {
      "verse": "45",
      "text": "The officers went back to the Pharisees."
    },
    {
      "verse": "46",
      "text": "The Pharisees asked, “Why didn’t you bring Him in?”"
    },
    {
      "verse": "47",
      "text": "The officers said, “Never has anyone taught like this.”"
    },
    {
      "verse": "48",
      "text": "The Pharisees replied, “You’re not tryna get played by Him too, right?”"
    },
    {
      "verse": "49",
      "text": "“Have any of the rulers or Pharisees believed in Him?”"
    },
    {
      "verse": "50",
      "text": "The crowd didn’t know the law, that He was sent by God."
    },
    {
      "verse": "51",
      "text": "Nicodemus, who came at night, said, “Yo, does our law judge someone without a fair hearing first?”"
    },
    {
      "verse": "52",
      "text": "They said, “Are you tryna be from Galilee too?”"
    },
    {
      "verse": "53",
      "text": "“After that, everyone just went home.”"
    }]},
   {
  "chapter": "8",
  "verses": [
    {
      "verse": "1",
      "text": "Jesus went back to the Mount of Olives early morning. The crowd rolled up to Him at the temple."
    },
    {
      "verse": "2",
      "text": "He sat down, teaching. People stayed around, listening like it was the latest live drop."
    },
    {
      "verse": "3",
      "text": "The Pharisees and teachers of the law brought a woman caught in adultery."
    },
    {
      "verse": "4",
      "text": "They put her in front of Jesus, saying, “Teacher, this woman got caught in the act.”"
    },
    {
      "verse": "5",
      "text": "“Moses commanded us to stone these people. What do you say?” They were trying to trap Him, looking for a scandal."
    },
    {
      "verse": "6",
      "text": "Jesus bent down and wrote on the ground with His finger."
    },
    {
      "verse": "7",
      "text": "They kept questioning Him, so He said, “Whoever has never sinned, throw the first stone.”"
    },
    {
      "verse": "8",
      "text": "Then He bent down again and kept writing."
    },
    {
      "verse": "9",
      "text": "One by one, the older ones left. Youngest to oldest. No one threw a stone. Crowd faded."
    },
    {
      "verse": "10",
      "text": "Jesus straightened up and asked the woman, “Where are they? Did anyone condemn you?”"
    },
    {
      "verse": "11",
      "text": "She said, “No one, Lord.” Jesus said, “Neither do I. Go, and don’t sin anymore.”"
    },
    {
      "verse": "12",
      "text": "Jesus spoke to the crowd: “I’m the light of the world. Whoever follows Me won’t walk in darkness but will have the light of life.”"
    },
    {
      "verse": "13",
      "text": "Pharisees said, “You testify about yourself. Your witness isn’t legit.”"
    },
    {
      "verse": "14",
      "text": "Jesus answered, “Even if I testify about Myself, My witness is true. I know who I am, and My Father who sent Me also testifies.”"
    },
    {
      "verse": "15",
      "text": "“You judge by human standards. I don’t judge anyone.”"
    },
    {
      "verse": "16",
      "text": "“Even if I did judge, My judgment is true. I’m not alone. Father who sent Me is with Me.”"
    },
    {
      "verse": "17",
      "text": "“It’s also written in your law: My witness counts.”"
    },
    {
      "verse": "18",
      "text": "Crowd asked, “Where’s Your Father?” Jesus said, “You don’t know Him. I know Him, and if I said I didn’t, I’d be lying. I’m always with Him.”"
    },
    {
      "verse": "19",
      "text": "“You try to kill Me? I work openly, and the Father is still with Me. You’re acting blind.”"
    },
    {
      "verse": "20",
      "text": "Jesus said these things while teaching in the temple. No one seized Him because His hour hadn’t come yet."
    },
    {
      "verse": "21",
      "text": "He said again, “I go, and you’ll search for Me, but you’ll die in your sin. Where I go, you cannot come.”"
    },
    {
      "verse": "22",
      "text": "Jews said, “Will you kill Yourself then?” Jesus said, “You’re wild. You won’t understand. I go where the Father sent Me.”"
    },
    {
      "verse": "23",
      "text": "“You’ll search for Me and die in your sins if you don’t believe that I AM.”"
    },
    {
      "verse": "24",
      "text": "“I told you who I AM. If you don’t believe, you die in your sins.”"
    },
    {
      "verse": "25",
      "text": "Jews said, “Who are You then?” Jesus: “Exactly what I’ve been telling you from the jump.”"
    },
    {
      "verse": "26",
      "text": "“I have much to say about you and much to judge, but the One who sent Me is true. I speak only what I’ve heard from Him.”"
    },
    {
      "verse": "27",
      "text": "“You don’t know Him, but I do. I come from Him, and He sent Me.”"
    },
    {
      "verse": "28",
      "text": "“When you lift the Son of Man, you’ll know that I AM, and I do nothing on My own.”"
    },
    {
      "verse": "29",
      "text": "“I speak what My Father taught Me. Those who hate Me are still trapped in sin.”"
    },
    {
      "verse": "30",
      "text": "Many believed in Him at that time."
    },
    {
      "verse": "31",
      "text": "Jesus said to those who believed Him, “If you hold to My teaching, you are really My disciples.”"
    },
    {
      "verse": "32",
      "text": "“Then you’ll know the truth, and the truth will set you free.”"
    },
    {
      "verse": "33",
      "text": "They replied, “We’re Abraham’s children and have never been slaves to anyone. How can You say, ‘You will be set free’?”"
    },
    {
      "verse": "34",
      "text": "Jesus said, “I tell you the truth, everyone who sins is a slave to sin.”"
    },
    {
      "verse": "35",
      "text": "“A slave has no permanent place in the family, but a Son belongs forever.”"
    },
    {
      "verse": "36",
      "text": "“So if the Son sets you free, you will be truly free.”"
    },
    {
      "verse": "37",
      "text": "“I know you are Abraham’s children. Yet you are trying to kill Me because My word has no place in you.”"
    },
    {
      "verse": "38",
      "text": "“I speak what I have seen with My Father, and you do what you have heard from your father.”"
    },
    {
      "verse": "39",
      "text": "They answered Him, “Abraham is our father.” Jesus said, “If you were Abraham’s children, you would do the things Abraham did.”"
    },
    {
      "verse": "40",
      "text": "“But instead, you want to kill Me, a man who has told you the truth. This is not what Abraham did.”"
    },
    {
      "verse": "41",
      "text": "“You are doing what your father does.” They said, “We were not born of fornication; we have one Father—God.”"
    },
    {
      "verse": "42",
      "text": "Jesus said, “If God were your Father, you would love Me, for I came from God. I did not come on My own, but He sent Me.”"
    },
    {
      "verse": "43",
      "text": "“Why don’t you understand what I say? It’s because you cannot accept My word.”"
    },
    {
      "verse": "44",
      "text": "“You belong to your father, the devil, and you want to carry out your father’s desires. He was a murderer from the beginning, not holding to the truth, because there is no truth in him.”"
    },
    {
      "verse": "45",
      "text": "“When he lies, he speaks his native language, for he is a liar and the father of lies.”"
    },
    {
      "verse": "46",
      "text": "“But because I tell the truth, you do not believe Me.”"
    },
    {
      "verse": "47",
      "text": "“Which of you can prove Me guilty of sin? If I tell the truth, why don’t you believe Me?”"
    },
    {
      "verse": "48",
      "text": "“Whoever belongs to God hears what God says. The reason you do not hear is that you do not belong to God.”"
    },
    {
      "verse": "49",
      "text": "Jews answered Him, “Aren’t we right in saying that You are a Samaritan and have a demon?”"
    },
    {
      "verse": "50",
      "text": "Jesus replied, “I do not have a demon, but I honor My Father, and you dishonor Me.”"
    },
    {
      "verse": "51",
      "text": "“I tell you the truth, if anyone keeps My word, he will never see death.”"
    },
    {
      "verse": "52",
      "text": "They said to Him, “Now we know You have a demon. Abraham died, and so did the prophets. You say, ‘If anyone keeps My word, he will never taste death.’”"
    },
    {
      "verse": "53",
      "text": "“Are You greater than our father Abraham? He died, and so did the prophets. Who do You make Yourself out to be?”"
    },
    {
      "verse": "54",
      "text": "Jesus replied, “If I glorify Myself, My glory means nothing. My Father, whom you claim as your God, glorifies Me.”"
    },
    {
      "verse": "55",
      "text": "“You do not know Him, but I know Him. If I said otherwise, I would be a liar like you, but I do know Him and keep His word.”"
    },
    {
      "verse": "56",
      "text": "“Your father Abraham rejoiced at the thought of seeing My day; he saw it and was glad.”"
    },
    {
      "verse": "57",
      "text": "“You are not yet fifty years old,” they said to Him, “and You have seen Abraham?”"
    },
    {
      "verse": "58",
      "text": "Jesus answered, “I tell you the truth, before Abraham was born, I AM.”"
    },
    {
      "verse": "59",
      "text": "At this, they picked up stones to throw at Him, but Jesus hid Himself and left the temple."
    }]},
    {
  "chapter": "9",
  "verses": [
    {
      "verse": "1",
      "text": "Jesus saw a man born blind. Squad asked, “Yo, who sinned? Him or his parents?”"
    },
    {
      "verse": "2",
      "text": "Jesus said, “Nah, nobody sinned. This happened so God’s works could be flexed through him.”"
    },
    {
      "verse": "3",
      "text": "“I gotta keep working the Father’s mission while it’s daytime. Night’s coming when no one can flex.”"
    },
    {
      "verse": "4",
      "text": "“Long as I’m in the world, I’m the light of the world. Period.”"
    },
    {
      "verse": "5",
      "text": "Then He spat on the ground, made mud, and rubbed it on the guy’s eyes."
    },
    {
      "verse": "6",
      "text": "“Go wash in the pool of Siloam” (which means “Sent”). The man went and washed."
    },
    {
      "verse": "7",
      "text": "He came back seeing. Big W energy."
    },
    {
      "verse": "8",
      "text": "Neighbors asked, “Wait… isn’t this the blind guy?”"
    },
    {
      "verse": "9",
      "text": "Some said, “Yo, this is him.” Others: “Nah, he just looks like him.” He said, “It’s me, I swear.”"
    },
    {
      "verse": "10",
      "text": "They asked, “How did your eyes open?”"
    },
    {
      "verse": "11",
      "text": "He said, “Some man called Jesus made mud, rubbed it on my eyes, and told me to wash in Siloam.”"
    },
    {
      "verse": "12",
      "text": "“I went, washed, and now I see.”"
    },
    {
      "verse": "13",
      "text": "They asked, “Where’s He?” He said, “No clue.”"
    },
    {
      "verse": "14",
      "text": "They brought him to the Pharisees."
    },
    {
      "verse": "15",
      "text": "It was Sabbath when Jesus made the mud and opened his eyes."
    },
    {
      "verse": "16",
      "text": "Pharisees asked again, “How did He open your eyes?” He repeated, “He put mud on my eyes, I washed, now I see.”"
    },
    {
      "verse": "17",
      "text": "Some Pharisees: “This dude ain’t keeping the Sabbath. He can’t be from God.” Others: “How can a sinner do these signs?”"
    },
    {
      "verse": "18",
      "text": "They asked the blind guy, “What do you say about Him?”"
    },
    {
      "verse": "19",
      "text": "He said, “He’s a prophet.”"
    },
    {
      "verse": "20",
      "text": "Jews didn’t believe he was blind-born or healed. They questioned his parents."
    },
    {
      "verse": "21",
      "text": "“Is this your son? Was he born blind?”"
    },
    {
      "verse": "22",
      "text": "His parents said, “Yes, he’s our son, born blind. How he sees now? Ask him, he’s old enough.”"
    },
    {
      "verse": "23",
      "text": "They said this because they feared the Jewish leaders—if they confessed Jesus, they’d be kicked out of the synagogue."
    },
    {
      "verse": "24",
      "text": "Pharisees called the man back. “Give glory to God. We know this man is a sinner.”"
    },
    {
      "verse": "25",
      "text": "He said, “I don’t know if He’s a sinner. But I was blind, now I see.”"
    },
    {
      "verse": "26",
      "text": "“How did He open your eyes?”"
    },
    {
      "verse": "27",
      "text": "He said, “I already told you. You didn’t listen. Why hear it again? Y’all tryna be His disciples too?”"
    },
    {
      "verse": "28",
      "text": "They insulted him, “You were born in sin, and you teach us?”"
    },
    {
      "verse": "29",
      "text": "He said, “I didn’t sin, I was blind. God sent Him—He does God’s works.”"
    },
    {
      "verse": "30",
      "text": "“If He weren’t from God, He couldn’t do this at all.”"
    },
    {
      "verse": "31",
      "text": "They argued, “You’re steeped in sin since birth!” He replied, “This is wild—how can a man do these miracles and you call Him a sinner?”"
    },
    {
      "verse": "32",
      "text": "They still refused to see."
    },
    {
      "verse": "33",
      "text": "Jesus heard they kicked the guy out. He found him and asked, “Do you believe in the Son of Man?”"
    },
    {
      "verse": "34",
      "text": "He said, “Who’s that, Lord? Tell me so I can believe.”"
    },
    {
      "verse": "35",
      "text": "Jesus said, “You’ve seen Him; He’s talking to you.”"
    },
    {
      "verse": "36",
      "text": "The man said, “I believe, Lord!” and bowed before Him."
    },
    {
      "verse": "37",
      "text": "Jesus said, “For judgment I came into this world: so that those without sight might see, and those claiming sight might be humbled.”"
    },
    {
      "verse": "38",
      "text": "Some Pharisees overheard and were salty."
    },
    {
      "verse": "39",
      "text": "Jesus said, “Some are blind to truth. If you think you see but don’t, your guilt stays.”"
    },
    {
      "verse": "40",
      "text": "Pharisees snapped, “We ain’t blind! We can see!”"
    },
    {
      "verse": "41",
      "text": "Jesus said, “No, if you were blind, you’d have no sin. But now you say, ‘We see.’ Therefore, your sin remains.”"
    }]},
    {
  "chapter": "10",
  "verses": [
    {
      "verse": "1",
      "text": "“Yo, anyone who sneaks in another way? Straight thief vibes. Sheep won’t follow that dude.”"
    },
    {
      "verse": "2",
      "text": "“But the real shepherd? Opens the gate. Sheep hear His voice, He calls each by name.”"
    },
    {
      "verse": "3",
      "text": "“He leads them out. Sheep follow Him ‘cause they know His voice.”"
    },
    {
      "verse": "4",
      "text": "“They walk behind Him, no cap—they know the path.”"
    },
    {
      "verse": "5",
      "text": "“They don’t follow a stranger. Stranger? They dip, scatter.”"
    },
    {
      "verse": "6",
      "text": "“This was a metaphor Jesus used, but they didn’t catch the vibe He was putting down.”"
    },
    {
      "verse": "7",
      "text": "“I’m the gate. Whoever enters through Me? Saved, in. Pasture vibes, safety guaranteed.”"
    },
    {
      "verse": "8",
      "text": "“All who came before Me? Thieves, robbers. Sheep didn’t vibe with them.”"
    },
    {
      "verse": "9",
      "text": "“I’m the gate. Anyone entering through Me will be safe, get pasture, and live life fully.”"
    },
    {
      "verse": "10",
      "text": "“Thief? Steals, kills, destroys. Me? I bring life—extra, eternal, uncapped.”"
    },
    {
      "verse": "11",
      "text": "“I’m the good shepherd. Good shepherd lays down life for the sheep.”"
    },
    {
      "verse": "12",
      "text": "“Hireling? Not the real deal. Sheep aren’t his. He dips when danger shows.”"
    },
    {
      "verse": "13",
      "text": "“Sheep get scattered. No loyalty, no care, pure cash vibes only.”"
    },
    {
      "verse": "14",
      "text": "“I’m the good shepherd. I know My sheep, My sheep know Me—relationship flex.”"
    },
    {
      "verse": "15",
      "text": "“I lay down My life for them. Big W for loyalty, love on max.”"
    },
    {
      "verse": "16",
      "text": "“Other sheep? Not from this pen. I gotta bring them too. One shepherd, one flock, unity energy.”"
    },
    {
      "verse": "17",
      "text": "“Father loves Me because I lay down My life, so that I can take it back up.”"
    },
    {
      "verse": "18",
      "text": "“No one takes it from Me. I drop it myself. Father gave Me authority to lay it down and take it back.”"
    },
    {
      "verse": "19",
      "text": "Crowd divided, some hype, some skeptical: “Yo, what is He saying?”"
    },
    {
      "verse": "20",
      "text": "Many tried to stone Him. Drama energy."
    },
    {
      "verse": "21",
      "text": "Jesus dipped across Jordan to where John first baptized, and folks followed Him."
    },
    {
      "verse": "22",
      "text": "Winter festival of dedication at Jerusalem was on."
    },
    {
      "verse": "23",
      "text": "Jesus walked in the temple, in Solomon’s porch."
    },
    {
      "verse": "24",
      "text": "Jews surrounded Him: “How long you gon’ keep us guessing? Straight talk: are You the Christ or nah?”"
    },
    {
      "verse": "25",
      "text": "Jesus said, “I told y’all, and you don’t believe. Works I do in My Father’s name? They testify about Me.”"
    },
    {
      "verse": "26",
      "text": "“But you don’t believe because you’re not in My squad.”"
    },
    {
      "verse": "27",
      "text": "“My sheep hear My voice. I know them, they follow Me.”"
    },
    {
      "verse": "28",
      "text": "“I give them eternal life. No cap, they can’t be snatched from My hand.”"
    },
    {
      "verse": "29",
      "text": "“My Father, who gave them to Me, is greater than all. No one can snatch from His hand.”"
    },
    {
      "verse": "30",
      "text": "“I and the Father are one.”"
    },
    {
      "verse": "31",
      "text": "Jews grabbed stones again to throw."
    },
    {
      "verse": "32",
      "text": "Jesus said, “Many good works I showed you from Father. Which of them makes you wanna stone Me?”"
    },
    {
      "verse": "33",
      "text": "Jews: “You’re blaspheming. Only God can claim to be one with Him.”"
    },
    {
      "verse": "34",
      "text": "Jesus said, “Isn’t it written in your law: ‘I said you are gods’?”"
    },
    {
      "verse": "35",
      "text": "“Scripture can’t fail. Those called ‘gods’ to whom God’s word came—don’t tell Me You’ve never read it?”"
    },
    {
      "verse": "36",
      "text": "“I’m the One the Father sanctified and sent into the world. You say I blaspheme because I said, ‘I’m the Son of God’?”"
    },
    {
      "verse": "37",
      "text": "“If I don’t do the works of My Father, don’t believe Me.”"
    },
    {
      "verse": "38",
      "text": "“But if I do, even if you don’t believe Me, believe the works. Then you’ll know and understand that Father is in Me and I in Him.”"
    },
    {
      "verse": "39",
      "text": "Crowd tried to grab Him again, but He escaped."
    },
    {
      "verse": "40",
      "text": "Jesus went across Jordan to the place John first baptized, and stayed there."
    },
    {
      "verse": "41",
      "text": "Many followed Him, saying, “John did no sign, but everything John said about this man? True.”"
    },
    {
      "verse": "42",
      "text": "People believed there. Faith flex activated."
    }
  ]
},
    {
  "chapter": "11",
  "verses": [
    {
      "verse": "1",
      "text": "Lazarus was sick in Bethany, the town of Mary and her sister Martha."
    },
    {
      "verse": "2",
      "text": "This Mary is the one who poured perfume on the Lord and wiped His feet with her hair."
    },
    {
      "verse": "3",
      "text": "The sisters sent a message to Jesus: “Lord, Lazarus is sick.”"
    },
    {
      "verse": "4",
      "text": "Jesus replied, “This sickness? Ain’t about death. God’s glory will show, and His Son will flex it.”"
    },
    {
      "verse": "5",
      "text": "Jesus loved Martha, her sister, and Lazarus."
    },
    {
      "verse": "6",
      "text": "When He heard Lazarus was sick, He stayed two more days where He was."
    },
    {
      "verse": "7",
      "text": "Then Jesus said to His disciples, “Let’s bounce back to Judea.”"
    },
    {
      "verse": "8",
      "text": "The disciples warned Him, “Yo, Rabbi, the Jews just tried to stone You. You really wanna go back there?”"
    },
    {
      "verse": "9",
      "text": "Jesus said, “Ain’t there 12 hours of daylight? Anyone walking in the day won’t trip, sees the light. Night? Danger vibes.”"
    },
    {
      "verse": "10",
      "text": "“The one walking in darkness? Trips, no clue where they’re going.”"
    },
    {
      "verse": "11",
      "text": "He said, “Lazarus our homie? He’s asleep. I’m going to wake him up.”"
    },
    {
      "verse": "12",
      "text": "Disciples: “Lord, if he’s just sleeping, he’ll chill.”"
    },
    {
      "verse": "13",
      "text": "Jesus was talking about death, but they thought He meant normal sleep."
    },
    {
      "verse": "14",
      "text": "He told them straight: “Lazarus died.”"
    },
    {
      "verse": "15",
      "text": "“I’m kinda hyped for y’all that I wasn’t there, so you’ll finally believe. Still, let’s roll to him.”"
    },
    {
      "verse": "16",
      "text": "Thomas said, “Yo, let’s ride too, even if we gotta die with Him.”"
    },
    {
      "verse": "17",
      "text": "Jesus arrived in Bethany. Lazarus had been in the tomb four days already."
    },
    {
      "verse": "18",
      "text": "Bethany was near Jerusalem, about two miles away."
    },
    {
      "verse": "19",
      "text": "Many Jews came to comfort Mary and Martha about their bro."
    },
    {
      "verse": "20",
      "text": "Martha heard Jesus was coming and ran to meet Him. Mary stayed home."
    },
    {
      "verse": "21",
      "text": "Martha said, “Lord, if You were here, my bro wouldn’t have died.”"
    },
    {
      "verse": "22",
      "text": "“But I still know, even now, whatever You ask God for, He’ll give You.”"
    },
    {
      "verse": "23",
      "text": "Jesus: “Your bro will rise again.”"
    },
    {
      "verse": "24",
      "text": "Martha: “I know he’ll rise at the last day.”"
    },
    {
      "verse": "25",
      "text": "Jesus: “I’m the resurrection and the life. Anyone who believes in Me? Even if they die, they live.”"
    },
    {
      "verse": "26",
      "text": "“And whoever lives and believes in Me? Won’t die forever. You believe this?”"
    },
    {
      "verse": "27",
      "text": "Martha: “Yes, Lord. I believe You are the Christ, God’s Son, the One coming into the world.”"
    },
    {
      "verse": "28",
      "text": "She ran to tell Mary, “Teacher’s here!”"
    },
    {
      "verse": "29",
      "text": "Mary ran, fell at His feet, saying the same: “Lord, if You were here, Lazarus wouldn’t have died.”"
    },
    {
      "verse": "30",
      "text": "Jesus saw her crying, and the Jews crying too, and got deeply moved."
    },
    {
      "verse": "31",
      "text": "“Where did you put him?” Jesus asked. They showed Him."
    },
    {
      "verse": "32",
      "text": "Jesus wept."
    },
    {
      "verse": "33",
      "text": "Jews said, “Look how much He loved him.”"
    },
    {
      "verse": "34",
      "text": "Some whispered: “He opened the eyes of blind dudes, but couldn’t save His homie?”"
    },
    {
      "verse": "35",
      "text": "Jesus again moved deeply inside."
    },
    {
      "verse": "36",
      "text": "Jews: “How He loved him!”"
    },
    {
      "verse": "37",
      "text": "But some doubted His power."
    },
    {
      "verse": "38",
      "text": "They came to the tomb. Stone blocking entrance."
    },
    {
      "verse": "39",
      "text": "Jesus: “Take the stone away.” Martha: “Lord, he’s been dead 4 days, stench vibes.”"
    },
    {
      "verse": "40",
      "text": "Jesus: “Didn’t I say if you believe, you’ll see God’s glory?”"
    },
    {
      "verse": "41",
      "text": "They removed the stone."
    },
    {
      "verse": "42",
      "text": "Jesus looked up and prayed: “Father, thank You for hearing Me. I knew You always hear Me, but I said this for the crowd right here, so they’d believe You sent Me.”"
    },
    {
      "verse": "43",
      "text": "Then He shouted: “Lazarus, come out!”"
    },
    {
      "verse": "44",
      "text": "Lazarus came out, wrapped in grave clothes. Jesus: “Unwrap him, let him go.”"
    },
    {
      "verse": "45",
      "text": "Many Jews saw and believed in Jesus."
    },
    {
      "verse": "46",
      "text": "But some ran to tell the Pharisees what He did."
    },
    {
      "verse": "47",
      "text": "Pharisees and leaders called a meeting: “This man does signs. We can’t let this slide.”"
    },
    {
      "verse": "48",
      "text": "“If we let Him go, everyone will believe, and Romans might come, take our spot.”"
    },
    {
      "verse": "49",
      "text": "Caiaphas, one of the high priests, lowkey prophet-level: “You all know nothing. Better one die for the nation than the whole nation wiped out.”"
    },
    {
      "verse": "50",
      "text": "Didn’t even realize he prophesied big time."
    },
    {
      "verse": "51",
      "text": "He spoke for the nation, not just for now."
    },
    {
      "verse": "52",
      "text": "That day, plotting to kill Jesus started."
    },
    {
      "verse": "53",
      "text": "Jesus left Judea, went to a town near the desert, called Ephraim, and stayed there with His squad."
    },
    {
      "verse": "54",
      "text": "Many went to Him at the festival, asking where He was hiding."
    },
    {
      "verse": "55",
      "text": "People wanted to see Him, whispered everywhere."
    },
    {
      "verse": "56",
      "text": "Meanwhile, the chief priests and Pharisees dropped an order: anyone knowing where Jesus was had to snitch so they could arrest Him."
    }]},
    {
  "chapter": "12",
  "verses": [
    {
      "verse": "1",
      "text": "Six days before Passover, Jesus pulled up to Bethany—Lazarus’ spot, the dude He just raised from the dead."
    },
    {
      "verse": "2",
      "text": "Dinner happened. Martha served. Lazarus was there. Mary flexed with expensive perfume on Jesus’ feet, wiping with her hair."
    },
    {
      "verse": "3",
      "text": "House filled with the fragrance."
    },
    {
      "verse": "4",
      "text": "Judas Iscariot said, “Yo, why wasn’t this sold for cash and given to the poor?”"
    },
    {
      "verse": "5",
      "text": "He wasn’t caring about the poor—just wanted the bag."
    },
    {
      "verse": "6",
      "text": "Jesus: “Leave her. She’s doing this for My burial.”"
    },
    {
      "verse": "7",
      "text": "“The poor? You’ll always have them. Me? Not always. Appreciate this moment.”"
    },
    {
      "verse": "8",
      "text": "Many knew Lazarus was there, and people started believing in Jesus."
    },
    {
      "verse": "9",
      "text": "Some plotted: “We gotta kill Lazarus too—crowd’s all hyped.”"
    },
    {
      "verse": "10",
      "text": "Next day, a massive crowd heard Jesus was coming to Jerusalem."
    },
    {
      "verse": "11",
      "text": "Took palms, went to meet Him, shouting: “Hosanna! Blessed is He who comes in the Lord’s name!”"
    },
    {
      "verse": "12",
      "text": "“King of Israel!” vibes everywhere."
    },
    {
      "verse": "13",
      "text": "Jesus grabbed a young donkey, sat on it—prophecy confirmed."
    },
    {
      "verse": "14",
      "text": "Disciples didn’t fully get it at first."
    },
    {
      "verse": "15",
      "text": "Many went to see Him and the miracle—believed in His name."
    },
    {
      "verse": "16",
      "text": "Some Greeks there for the festival approached Philip: “Sir, we wanna see Jesus.”"
    },
    {
      "verse": "17",
      "text": "Philip told Andrew. They told Jesus."
    },
    {
      "verse": "18",
      "text": "Jesus: “The hour’s here. Son of Man about to be glorified.”"
    },
    {
      "verse": "19",
      "text": "“Truly, whoever loves life here? Will lose it. Hates it in this world? Wins it forever.”"
    },
    {
      "verse": "20",
      "text": "“Serve Me and get lifted. Eternal respect, big energy.”"
    },
    {
      "verse": "21",
      "text": "“Follow Me—where I’m at, squad’s at.”"
    },
    {
      "verse": "22",
      "text": "My soul? Troubled. I asked: “Father, dodge this hour?”"
    },
    {
      "verse": "23",
      "text": "But nah—I came to glorify You. God’s voice said: “I already glorified it, I’ll do it again.”"
    },
    {
      "verse": "24",
      "text": "Crowd freaked: “Thunder? Angel?”"
    },
    {
      "verse": "25",
      "text": "Jesus: “Nah, this is for y’all.”"
    },
    {
      "verse": "26",
      "text": "“World ruler about to be exposed.”"
    },
    {
      "verse": "27",
      "text": "“Lifted up? Everyone drawn to Me.”"
    },
    {
      "verse": "28",
      "text": "He said this pointing to His death flex."
    },
    {
      "verse": "29",
      "text": "Crowd: “Lifted? Son of David?”"
    },
    {
      "verse": "30",
      "text": "Jesus: “Walk in light now, don’t get caught in dark. Dark vibes = trips.”"
    },
    {
      "verse": "31",
      "text": "“Believe while you got light. Squad up in light.”"
    },
    {
      "verse": "32",
      "text": "Signs? Plenty. Yet some still didn’t believe."
    },
    {
      "verse": "33",
      "text": "Isaiah prophesied: “Who believed our report? To whom was revelation shown?”"
    },
    {
      "verse": "34",
      "text": "Hearts hardened, eyes blinded—lest they see, turn, get healed."
    },
    {
      "verse": "35",
      "text": "Isaiah saw His glory, spoke the vision."
    },
    {
      "verse": "36",
      "text": "Leaders believed secretly, scared of Pharisee clout."
    },
    {
      "verse": "37",
      "text": "Wanted human praise > God’s glory."
    },
    {
      "verse": "38",
      "text": "Reject Me? Reject Him who sent Me."
    },
    {
      "verse": "39",
      "text": "I only speak what Father handed Me."
    },
    {
      "verse": "40",
      "text": "Father’s commandment = eternal life."
    },
    {
      "verse": "41",
      "text": "Came as light so believers won’t trip in darkness."
    },
    {
      "verse": "42",
      "text": "Follow, not for clout, but for God’s glory."
    },
    {
      "verse": "43",
      "text": "Whoever believes in Me, believes the Father."
    },
    {
      "verse": "44",
      "text": "See Me? See the Father."
    },
    {
      "verse": "45",
      "text": "Light came—follow Me, no stumbling."
    },
    {
      "verse": "46",
      "text": "Didn’t come to judge world, but save."
    },
    {
      "verse": "47",
      "text": "“I’m not here to judge y’all right now. I came to save, to give life.”"
    },
    {
      "verse": "48",
      "text": "“But whoever rejects Me? My Word will judge them on the Last Day—no cap.”"
    },
    {
      "verse": "49",
      "text": "“I don’t freestyle. Father told Me exactly what to say—every word straight from Him.”"
    },
    {
      "verse": "50",
      "text": "“The commandment I drop? Eternal life. That’s why I speak Father’s words—so you live forever.”"
    }]},
    {
  "chapter": "13",
  "verses": [
    {
      "verse": "1",
      "text": "Before Passover, Jesus knew His hour to leave this world and return to the Father was near. He loved His squad to the max."
    },
    {
      "verse": "2",
      "text": "During supper, the devil already planted betrayal in Judas Iscariot’s mind."
    },
    {
      "verse": "3",
      "text": "Jesus knew the Father gave everything to Him, and that He came from God and was returning to God."
    },
    {
      "verse": "4",
      "text": "So He got up, dropped His outer clothes, grabbed a towel, and tied it around His waist."
    },
    {
      "verse": "5",
      "text": "Poured water into a basin, started washing the disciples’ feet, wiping them with the towel tied around Him."
    },
    {
      "verse": "6",
      "text": "Came to Simon Peter. Peter said, “Yo, You washing my feet? Nah, never!”"
    },
    {
      "verse": "7",
      "text": "Jesus replied: “Not now, Peter? You won’t get it. Later? You’ll understand.”"
    },
    {
      "verse": "8",
      "text": "Peter: “No way, Lord. Not just my feet—hands and head too!”"
    },
    {
      "verse": "9",
      "text": "Jesus: “If I don’t wash you, you got no part with Me.”"
    },
    {
      "verse": "10",
      "text": "“Everyone clean—but not all of you.” (He knew who’d betray Him.)"
    },
    {
      "verse": "11",
      "text": "After washing their feet, He put His clothes back on and sat down: “You get it? I set an example, so you do the same for each other.”"
    },
    {
      "verse": "12",
      "text": "“I’m not flexing for clout. I came to serve, not be served.”"
    },
    {
      "verse": "13",
      "text": "“If you know this, blessed you are if you act like it.”"
    },
    {
      "verse": "14",
      "text": "“Love each other. Big time. That’s how everyone knows you’re My squad.”"
    },
    {
      "verse": "15",
      "text": "“I’m not giving you random commandments. Follow Me. Example: love each other.”"
    },
    {
      "verse": "16",
      "text": "“The servant isn’t above the master. Remember that. Respect the grind.”"
    },
    {
      "verse": "17",
      "text": "“Do it, and your life? Full of blessed energy.”"
    },
    {
      "verse": "18",
      "text": "“I’m telling you this now, before it goes down, so when it happens, you know it wasn’t random.”"
    },
    {
      "verse": "19",
      "text": "“I’m telling you this now, before it happens, so that when it happens, you believe I am He.”"
    },
    {
      "verse": "20",
      "text": "“Whoever receives anyone I send receives Me, and whoever receives Me receives Him who sent Me.”"
    },
    {
      "verse": "21",
      "text": "After saying this, Jesus was troubled in spirit and openly said, “Yo, real talk, one of you is about to betray Me.”"
    },
    {
      "verse": "22",
      "text": "The disciples looked at each other, confused, trying to figure out who He meant."
    },
    {
      "verse": "23",
      "text": "Simon Peter leaned over to John, the disciple Jesus loved, and whispered: “Yo, ask Him who it is.”"
    },
    {
      "verse": "24",
      "text": "John leaned back to Jesus: “Lord, who’s it?”"
    },
    {
      "verse": "25",
      "text": "Jesus: “It’s the one I give the sop to when I dip the bread.”"
    },
    {
      "verse": "26",
      "text": "He dipped the bread, gave it to Judas Iscariot, son of Simon."
    },
    {
      "verse": "27",
      "text": "As soon as Judas took it, Satan entered him. Jesus said, “Do it fast, Judas.”"
    },
    {
      "verse": "28",
      "text": "No one at the table got why He said this."
    },
    {
      "verse": "29",
      "text": "Some thought Judas was just handling errands, giving to the poor."
    },
    {
      "verse": "30",
      "text": "After taking the bread, Judas dipped and left immediately. It was night."
    },
    {
      "verse": "31",
      "text": "When he left, Jesus said: “Now the Son of Man is glorified, and God is glorified in Him.”"
    },
    {
      "verse": "32",
      "text": "“If God is glorified in Him, God will also glorify Him in Himself and show it quickly.”"
    },
    {
      "verse": "33",
      "text": "Jesus told them: “Little squad, I’m not gonna be with you much longer.”"
    },
    {
      "verse": "34",
      "text": "“New commandment I drop on you: love each other as I loved you. Big energy, no cap.”"
    },
    {
      "verse": "35",
      "text": "“By this, everyone will know you’re My squad—love, not just talk.”"
    },
    {
      "verse": "36",
      "text": "Simon Peter asked: “Lord, where You going?” Jesus replied: “You can’t follow Me now, but later you will.”"
    },
    {
      "verse": "37",
      "text": "Peter: “Why can’t I roll with You now? I’ll die for You!”"
    },
    {
      "verse": "38",
      "text": "Jesus: “Die for Me? Peter, I tell you the truth: before the rooster crows, you’ll deny Me three times.”"
    }]},
    {
  "chapter": "14",
  "verses": [
    {
      "verse": "1",
      "text": "Jesus: “Chill, don’t let your hearts panic. Trust God, trust Me too.”"
    },
    {
      "verse": "2",
      "text": "“In My Father’s house, there’s plenty of room. I’m not capping. I’m going to prep your spot.”"
    },
    {
      "verse": "3",
      "text": "“When I’m done, I’ll come back and take you with Me. You’ll be where I’m at.”"
    },
    {
      "verse": "4",
      "text": "“You already know the way to where I’m going.”"
    },
    {
      "verse": "5",
      "text": "Thomas: “Uh, Lord, we don’t even know where You’re headed. How we supposed to know the way?”"
    },
    {
      "verse": "6",
      "text": "Jesus: “I am the Way, the Truth, and the Life. No one reaches the Father unless they pull up through Me.”"
    },
    {
      "verse": "7",
      "text": "“If you really knew Me, you’d know My Father too. From now on, you do know Him—you’ve seen Him.”"
    },
    {
      "verse": "8",
      "text": "Philip: “Lord, just show us the Father, and we’ll be good.”"
    },
    {
      "verse": "9",
      "text": "Jesus: “Philip… bro. I’ve been with y’all this long and you still don’t recognize Me? If you’ve seen Me, you’ve seen the Father.”"
    },
    {
      "verse": "10",
      "text": "“Don’t you believe I’m in the Father and the Father’s in Me? Every word I’ve said—wasn’t from Me alone. The Father’s been doing His work through Me.”"
    },
    {
      "verse": "11",
      "text": "“Believe Me when I say I’m in the Father and the Father’s in Me—or at least believe ‘cause of the miracles.”"
    },
    {
      "verse": "12",
      "text": "“Anyone who believes in Me will do what I’ve been doing—and even greater things—‘cause I’m heading to the Father.”"
    },
    {
      "verse": "13",
      "text": "“Ask anything in My name, and I’ll do it, so the Father gets flexed up in the Son.”"
    },
    {
      "verse": "14",
      "text": "“You ask anything in My name? I got you.”"
    },
    {
      "verse": "15",
      "text": "“If you love Me, keep My commands. Not hard talk—proof talk.”"
    },
    {
      "verse": "16",
      "text": "“I’ll ask the Father, and He’ll send another Helper—the Holy Spirit—so you’re never alone.”"
    },
    {
      "verse": "17",
      "text": "“The world won’t get Him, ‘cause they don’t see or know Him. But you do. He’s with you—and will live in you.”"
    },
    {
      "verse": "18",
      "text": "“I won’t leave you hanging like orphans. I’m coming back.”"
    },
    {
      "verse": "19",
      "text": "“Soon, the world won’t see Me, but you will. Because I live, you’ll live too.”"
    },
    {
      "verse": "20",
      "text": "“When that day hits, you’ll know I’m in My Father, you’re in Me, and I’m in you.”"
    },
    {
      "verse": "21",
      "text": "“Whoever has My commands and keeps them—yeah, that’s the one who loves Me. And My Father will love them, and I’ll show Myself to them.”"
    },
    {
      "verse": "22",
      "text": "Judas (not Iscariot): “Lord, why You showing Yourself to us but not the world?”"
    },
    {
      "verse": "23",
      "text": "Jesus: “If anyone loves Me, they’ll keep My word. My Father will love them, and We’ll come make Our home with them.”"
    },
    {
      "verse": "24",
      "text": "“Whoever doesn’t love Me won’t keep My words. And the word you’re hearing? Straight from the Father.”"
    },
    {
      "verse": "25",
      "text": "“I’ve said all this while I’m still here with you.”"
    },
    {
      "verse": "26",
      "text": "“But the Helper—the Holy Spirit, whom the Father will send in My name—He’ll teach you everything and remind you of all I said.”"
    },
    {
      "verse": "27",
      "text": "“Peace I leave with you; My peace I give. Not the world’s kind. Don’t let your hearts freak out.”"
    },
    {
      "verse": "28",
      "text": "“You heard Me say I’m leaving and coming back. If you really loved Me, you’d be glad I’m going to the Father—He’s greater than I.”"
    },
    {
      "verse": "29",
      "text": "“I’ve told you this before it happens, so when it does, your faith won’t shake.”"
    },
    {
      "verse": "30",
      "text": "“I won’t be talking much longer—the prince of this world’s coming. But he’s got nothing on Me.”"
    },
    {
      "verse": "31",
      "text": "“So the world knows I love the Father, I’m doing exactly what He commanded. Let’s roll.”"
    }]},
    {
  "chapter": "15",
  "verses": [
    {
      "verse": "1",
      "text": "Jesus: “I’m the real Vine. My Father’s the Gardener—He manages the whole setup.”"
    },
    {
      "verse": "2",
      "text": "“Any branch in Me that doesn’t produce fruit? Snip snip—He cuts it off. But the ones that do bear fruit, He prunes so they can glow harder.”"
    },
    {
      "verse": "3",
      "text": "“You’re already clean ‘cause of the word I dropped on you.”"
    },
    {
      "verse": "4",
      "text": "“Stay locked in with Me, and I’ll stay locked in with you. A branch can’t bear fruit solo—it’s gotta stay connected.”"
    },
    {
      "verse": "5",
      "text": "“I’m the Vine, you’re the branches. Stay connected to Me, and you’ll produce big fruit. Without Me, you’re running on zero battery.”"
    },
    {
      "verse": "6",
      "text": "“Anyone who disconnects from Me is like a dead branch—tossed out, dried up, and burned.”"
    },
    {
      "verse": "7",
      "text": "“If you stay close to Me and My words stay loaded in you, ask whatever you want—it’s done.”"
    },
    {
      "verse": "8",
      "text": "“When you bear fruit, My Father gets glorified—and you prove you’re My squad for real.”"
    },
    {
      "verse": "9",
      "text": "“Just like the Father loved Me, I’ve loved you. So stay locked in that love.”"
    },
    {
      "verse": "10",
      "text": "“If you keep My commands, you’ll stay in My love—same way I kept My Father’s commands and stayed in His.”"
    },
    {
      "verse": "11",
      "text": "“I told y’all this so My joy can fill you up and your joy hits full level.”"
    },
    {
      "verse": "12",
      "text": "“My command’s simple but tough—love each other the way I loved you.”"
    },
    {
      "verse": "13",
      "text": "“Ain’t no deeper love than dying for your friends.”"
    },
    {
      "verse": "14",
      "text": "“You’re My friends if you actually do what I tell you.”"
    },
    {
      "verse": "15",
      "text": "“I’m not calling y’all servants anymore. Servants don’t know what the boss is planning. You’re friends now ‘cause I’ve spilled everything the Father told Me.”"
    },
    {
      "verse": "16",
      "text": "“You didn’t pick Me—I picked you. I set you up to bear fruit that lasts. Then whatever you ask the Father in My name, He’ll back it.”"
    },
    {
      "verse": "17",
      "text": "“So yeah, love each other. That’s the whole point.”"
    },
    {
      "verse": "18",
      "text": "“If the world’s hating on you, chill—they hated Me first.”"
    },
    {
      "verse": "19",
      "text": "“If you were part of the world, they’d vibe with you. But since you’re not and I pulled you out of that, the world’s gonna side-eye you.”"
    },
    {
      "verse": "20",
      "text": "“Remember what I said: no servant’s above his master. If they came for Me, they’ll come for you too. If they kept My word, they’ll keep yours.”"
    },
    {
      "verse": "21",
      "text": "“They’ll do all this ‘cause of My name—‘cause they don’t know the One who sent Me.”"
    },
    {
      "verse": "22",
      "text": "“If I hadn’t shown up and spoken, they wouldn’t know sin like that. But now? They got no excuse.”"
    },
    {
      "verse": "23",
      "text": "“Whoever hates Me hates My Father too.”"
    },
    {
      "verse": "24",
      "text": "“If I hadn’t done what no one else ever did, they wouldn’t be guilty. But now they’ve seen and still hated both Me and My Father.”"
    },
    {
      "verse": "25",
      "text": "“This fulfills what was written: ‘They hated Me for no reason.’”"
    },
    {
      "verse": "26",
      "text": "“But when the Helper comes—the Spirit of Truth who’ll pull up from the Father—He’ll vouch for Me.”"
    },
    {
      "verse": "27",
      "text": "“And you will too, ‘cause you’ve been with Me since day one.”"
    }]},
    {
  "chapter": "16",
  "verses": [
    {
      "verse": "1",
      "text": "“I’m telling y’all this so you don’t fall off the path when stuff gets real.”"
    },
    {
      "verse": "2",
      "text": "“They’ll kick you outta the synagogues. Some’ll even think killing you is doing God a favor.”"
    },
    {
      "verse": "3",
      "text": "“They’ll do it ‘cause they don’t actually know Me or the Father.”"
    },
    {
      "verse": "4",
      "text": "“I’m telling you now so when it happens, you’ll remember I warned you. I didn’t say it before ‘cause I was still here holding it down.”"
    },
    {
      "verse": "5",
      "text": "“But now I’m heading back to the One who sent Me, and none of you asking where I’m going.”"
    },
    {
      "verse": "6",
      "text": "“You’re just sad ‘cause I said I’m leaving.”"
    },
    {
      "verse": "7",
      "text": "“But real talk—it’s better I go. If I don’t, the Helper won’t pull up. But if I bounce, I’ll send Him to you.”"
    },
    {
      "verse": "8",
      "text": "“When He comes, He’ll expose the world about sin, righteousness, and judgment.”"
    },
    {
      "verse": "9",
      "text": "“Sin—‘cause they don’t believe in Me.”"
    },
    {
      "verse": "10",
      "text": "“Righteousness—‘cause I’m going to the Father and you won’t see Me anymore.”"
    },
    {
      "verse": "11",
      "text": "“Judgment—‘cause the ruler of this world already caught his L.”"
    },
    {
      "verse": "12",
      "text": "“I got way more to tell y’all, but you couldn’t handle it right now.”"
    },
    {
      "verse": "13",
      "text": "“When the Spirit of Truth comes, He’ll guide you into all truth. He won’t freestyle—He’ll speak what He hears and tell you what’s next.”"
    },
    {
      "verse": "14",
      "text": "“He’ll glorify Me by passing down what’s Mine.”"
    },
    {
      "verse": "15",
      "text": "“Everything the Father’s got is Mine. That’s why I said the Spirit will take what’s Mine and drop it on you.”"
    },
    {
      "verse": "16",
      "text": "“In a little while, you won’t see Me. Then a little after that—you’ll see Me again.”"
    },
    {
      "verse": "17",
      "text": "The disciples whispered, “What’s He mean, ‘a little while’? What’s He saying?”"
    },
    {
      "verse": "18",
      "text": "“He keeps saying ‘you won’t see Me, then you will.’ Bro, what?”"
    },
    {
      "verse": "19",
      "text": "Jesus saw they were confused: “You’re asking what I meant?”"
    },
    {
      "verse": "20",
      "text": "“Listen—y’all gonna cry and grieve while the world’s celebrating. But your sadness’s gonna flip into joy.”"
    },
    {
      "verse": "21",
      "text": "“It’s like a mom in labor—pain now, but when the baby comes, she forgets the pain ‘cause joy hit different.”"
    },
    {
      "verse": "22",
      "text": "“That’s you. You’re sad now, but I’ll see you again, and your joy? No one’s taking that.”"
    },
    {
      "verse": "23",
      "text": "“When that day hits, you won’t need to ask Me for anything. You’ll ask the Father in My name, and He’ll give it.”"
    },
    {
      "verse": "24",
      "text": "“Till now, you ain’t asked for anything in My name. Start asking—and you’ll receive, joy overflowing.”"
    },
    {
      "verse": "25",
      "text": "“I’ve been talking in parables and riddles, but the time’s coming I’ll speak straight about the Father.”"
    },
    {
      "verse": "26",
      "text": "“On that day, you’ll ask in My name. I won’t need to beg the Father for you—”"
    },
    {
      "verse": "27",
      "text": "“Because the Father Himself loves you since you’ve loved Me and believed I came from Him.”"
    },
    {
      "verse": "28",
      "text": "“I came from the Father, entered the world, and now I’m dipping back to the Father.”"
    },
    {
      "verse": "29",
      "text": "The disciples: “Finally, You’re talking straight! No more riddles!”"
    },
    {
      "verse": "30",
      "text": "“Now we know You know everything and came from God—You’re Him for real.”"
    },
    {
      "verse": "31",
      "text": "Jesus: “Oh, so now you believe?”"
    },
    {
      "verse": "32",
      "text": "“Listen—time’s coming (actually, it’s here) when y’all will scatter, each doing your own thing, leaving Me alone. But I’m not alone—the Father’s with Me.”"
    },
    {
      "verse": "33",
      "text": "“I told you all this so you’ll have peace in Me. Out there? You’ll face pressure, chaos, hate. But chill—I already beat the world.”"
    }]},
    {
  "chapter": "17",
  "verses": [
    {
      "verse": "1",
      "text": "Jesus looked up and said, “Father, the hour’s here. Flex Your glory through Me so I can glorify You back.”"
    },
    {
      "verse": "2",
      "text": "“You gave Me authority over all people, so I could give eternal life to everyone You handed Me.”"
    },
    {
      "verse": "3",
      "text": "“And here’s the whole point of eternal life: knowing You, the one true God, and Jesus Christ, the One You sent.”"
    },
    {
      "verse": "4",
      "text": "“I finished the mission You gave Me, Father. I brought You glory on earth.”"
    },
    {
      "verse": "5",
      "text": "“Now bring Me back to that same glory I had with You before the world even existed.”"
    },
    {
      "verse": "6",
      "text": "“I revealed who You are to the ones You gave Me outta the world. They were Yours first, You gave them to Me, and they’ve kept Your word.”"
    },
    {
      "verse": "7",
      "text": "“Now they finally get it — that everything I’ve got came straight from You.”"
    },
    {
      "verse": "8",
      "text": "“I gave them the words You gave Me. They accepted them and believed I really came from You — that You sent Me.”"
    },
    {
      "verse": "9",
      "text": "“I’m praying for them, not the world. I’m praying for the ones You gave Me, ‘cause they’re Yours.”"
    },
    {
      "verse": "10",
      "text": "“All that’s Mine is Yours, and what’s Yours is Mine. They’re the proof of My glory.”"
    },
    {
      "verse": "11",
      "text": "“I’m not gonna be in the world much longer, but they still will. Holy Father, keep them tight under Your name — the same name You gave Me — so they stay one, just like We’re one.”"
    },
    {
      "verse": "12",
      "text": "“While I was with them, I kept ‘em safe under Your name. None got lost except the one that was destined to dip — just like Scripture said.”"
    },
    {
      "verse": "13",
      "text": "“Now I’m coming back to You. I’m saying this out loud so they’ll have My joy fully loaded inside them.”"
    },
    {
      "verse": "14",
      "text": "“I gave them Your word, and the world hated them for it — ‘cause they’re not part of the world, just like I’m not.”"
    },
    {
      "verse": "15",
      "text": "“I’m not asking You to take them outta the world, but to protect them from the evil one.”"
    },
    {
      "verse": "16",
      "text": "“They don’t belong to this world any more than I do.”"
    },
    {
      "verse": "17",
      "text": "“Make them pure by Your truth — Your word is the truth.”"
    },
    {
      "verse": "18",
      "text": "“Just like You sent Me into the world, I’m sending them in too.”"
    },
    {
      "verse": "19",
      "text": "“And I’m setting Myself apart for their sake, so they can be truly set apart through the truth.”"
    },
    {
      "verse": "20",
      "text": "“I’m not just praying for these here — I’m praying for everyone who’ll believe in Me through their message.”"
    },
    {
      "verse": "21",
      "text": "“That they all may be one, like You, Father, are in Me and I’m in You — so they can be in Us, and the world’ll believe You sent Me.”"
    },
    {
      "verse": "22",
      "text": "“I passed down the same glory You gave Me so they can be united like We are.”"
    },
    {
      "verse": "23",
      "text": "“I’m in them, You’re in Me — perfect unity. Then the world’ll know You sent Me and that You love them just like You love Me.”"
    },
    {
      "verse": "24",
      "text": "“Father, I want those You gave Me to be with Me where I am, so they can see My glory — the glory You gave Me ‘cause You loved Me before creation even started.”"
    },
    {
      "verse": "25",
      "text": "“Righteous Father, the world didn’t know You, but I do — and these ones know You sent Me.”"
    },
    {
      "verse": "26",
      "text": "“I made Your name known to them, and I’ll keep doing it — so Your love for Me lives in them, and I live in them too.”"
    }]},
    {
  "chapter": "18",
  "verses": [
    {
      "verse": "1",
      "text": "After Jesus finished praying, He and His crew crossed the Kidron Valley and entered a garden spot He used to chill at with His disciples."
    },
    {
      "verse": "2",
      "text": "Judas, the one who sold Him out, knew the spot too — Jesus and the gang used to pull up there often."
    },
    {
      "verse": "3",
      "text": "So Judas showed up with soldiers and temple guards, carrying torches, lanterns, and weapons — whole squad ready like it’s a raid."
    },
    {
      "verse": "4",
      "text": "Jesus, already knowing everything that was about to go down, stepped up and asked, “Who y’all looking for?”"
    },
    {
      "verse": "5",
      "text": "They said, “Jesus of Nazareth.” Jesus answered, “That’s Me.” Judas, the betrayer, was standing right there with them."
    },
    {
      "verse": "6",
      "text": "When Jesus said, “That’s Me,” they flinched so hard they fell back. Power move."
    },
    {
      "verse": "7",
      "text": "He asked again, “Who y’all looking for?” They repeated, “Jesus of Nazareth.”"
    },
    {
      "verse": "8",
      "text": "Jesus said, “Told you I’m Him. If it’s Me you want, let these other guys go.”"
    },
    {
      "verse": "9",
      "text": "(That fulfilled what He said before — “I didn’t lose any of the ones You gave Me.”)"
    },
    {
      "verse": "10",
      "text": "Then Simon Peter, always acting before thinking, whipped out a sword and sliced off the right ear of the high priest’s servant — dude’s name was Malchus."
    },
    {
      "verse": "11",
      "text": "Jesus said, “Peter, chill! Put that sword away. Shall I not drink the cup the Father gave Me?”"
    },
    {
      "verse": "12",
      "text": "So the soldiers and guards grabbed Jesus, cuffed Him up, and dragged Him off."
    },
    {
      "verse": "13",
      "text": "They first took Him to Annas, father-in-law of Caiaphas — the high priest that year."
    },
    {
      "verse": "14",
      "text": "Caiaphas was the one who said earlier, “It’s better for one man to die for the people.”"
    },
    {
      "verse": "15",
      "text": "Simon Peter followed Jesus, and another disciple tagged along — that one knew the high priest, so they got Jesus inside the courtyard."
    },
    {
      "verse": "16",
      "text": "Peter had to wait outside for a bit. The other disciple went out, talked to the servant girl at the gate, and got Peter in."
    },
    {
      "verse": "17",
      "text": "The servant girl said, “Aren’t you one of that guy’s followers?” Peter was like, “Nah, not me.”"
    },
    {
      "verse": "18",
      "text": "It was cold, and the servants and guards were warming up by a fire. Peter stood there with them, pretending like he didn’t know what was going on."
    },
    {
      "verse": "19",
      "text": "The high priest started questioning Jesus about His disciples and His teachings."
    },
    {
      "verse": "20",
      "text": "Jesus said, “I’ve spoken openly. Always taught in synagogues or the temple — where everyone gathers. I didn’t hide anything.”"
    },
    {
      "verse": "21",
      "text": "“Why you asking Me? Ask the people who heard Me — they know what I said.”"
    },
    {
      "verse": "22",
      "text": "When He said that, one of the guards smacked Him across the face and said, “That how You talk to the high priest?”"
    },
    {
      "verse": "23",
      "text": "Jesus replied, “If I said something wrong, call it out. If I didn’t, why you hitting Me?”"
    },
    {
      "verse": "24",
      "text": "Then Annas sent Him, still tied up, to Caiaphas the high priest."
    },
    {
      "verse": "25",
      "text": "Meanwhile, Peter was still warming himself. Someone asked, “You’re not one of His followers, right?” Peter denied again: “Nope.”"
    },
    {
      "verse": "26",
      "text": "One of the high priest’s servants — related to the guy Peter sliced — said, “Didn’t I see you in the garden with Him?”"
    },
    {
      "verse": "27",
      "text": "Peter denied it again — and instantly, a rooster crowed."
    },
    {
      "verse": "28",
      "text": "They led Jesus from Caiaphas to the Roman governor’s HQ — it was early morning. The Jews didn’t enter, so they wouldn’t be defiled before Passover."
    },
    {
      "verse": "29",
      "text": "Pilate came out and asked, “What’s the charge against this guy?”"
    },
    {
      "verse": "30",
      "text": "They answered, “If He wasn’t a criminal, we wouldn’t have brought Him here.”"
    },
    {
      "verse": "31",
      "text": "Pilate said, “Then handle it yourselves.” They said, “We can’t legally execute anyone.”"
    },
    {
      "verse": "32",
      "text": "(That fulfilled what Jesus said about the kind of death He’d face.)"
    },
    {
      "verse": "33",
      "text": "Pilate went back in, called Jesus, and asked, “You the King of the Jews?”"
    },
    {
      "verse": "34",
      "text": "Jesus answered, “You asking that ‘cause you believe it, or ‘cause someone told you?”"
    },
    {
      "verse": "35",
      "text": "Pilate said, “I’m not a Jew, am I? Your own people handed You over. What did You do?”"
    },
    {
      "verse": "36",
      "text": "Jesus said, “My kingdom isn’t from this world. If it was, My followers would be fighting to stop this. But My kingdom’s from somewhere else.”"
    },
    {
      "verse": "37",
      "text": "Pilate said, “So You are a king then?” Jesus said, “You said it. I came to speak the truth — that’s what I was born for. Everyone who’s about the truth hears My voice.”"
    },
    {
      "verse": "38",
      "text": "Pilate said, “What even is truth?” Then he walked out again and told the Jews, “I find no fault in Him.”"
    },
    {
      "verse": "39",
      "text": "“But you got a custom — I release one prisoner for Passover. You want me to free the King of the Jews?”"
    },
    {
      "verse": "40",
      "text": "They shouted, “No! Not Him! Give us Barabbas!” (Barabbas was a straight-up rebel.)"
    }]},
    {
  "chapter": "19",
  "verses": [
    {
      "verse": "1",
      "text": "Jesus gets flogged. No mercy, just whips on whips."
    },
    {
      "verse": "2",
      "text": "The soldiers twist a crown out of thorns, jam it on His head, and throw a purple robe on Him like a fake coronation."
    },
    {
      "verse": "3",
      "text": "Then they start fake-bowing, “Hail, King of the Jews,” and keep slapping Him like cowards."
    },
    {
      "verse": "4",
      "text": "Pilate walks out and says, “I’m bringing Him out so y’all can see I find no reason to charge Him.”"
    },
    {
      "verse": "5",
      "text": "Jesus steps out — thorn crown, purple robe — silent, bleeding, regal. Pilate says, “Behold the Man.”"
    },
    {
      "verse": "6",
      "text": "The chief priests and temple squad yell, “Crucify Him! Crucify Him!” Pilate says, “Then do it yourselves. I find no fault in Him.”"
    },
    {
      "verse": "7",
      "text": "They snap back, “We got a law. He said He’s the Son of God. That’s blasphemy.”"
    },
    {
      "verse": "8",
      "text": "Pilate hears that and freezes. Fear finally hits him."
    },
    {
      "verse": "9",
      "text": "He walks back inside. “Where you from?” he asks. Jesus doesn’t respond."
    },
    {
      "verse": "10",
      "text": "Pilate gets cocky. “You not talking? I got the power to free you or kill you.”"
    },
    {
      "verse": "11",
      "text": "Jesus looks at him and says, “You got no power unless Heaven allowed it. The one who handed Me over? He’s catching the heavier sentence.”"
    },
    {
      "verse": "12",
      "text": "From then on, Pilate tries to free Him, but the people keep shouting, “If you let Him go, you’re no friend of Caesar.”"
    },
    {
      "verse": "13",
      "text": "So Pilate drags Jesus out to the judgment seat, the place called Gabbatha. It’s almost noon, Passover prep day."
    },
    {
      "verse": "14",
      "text": "Pilate says, “Here’s your King.”"
    },
    {
      "verse": "15",
      "text": "They yell, “Away with Him! Crucify Him! We have no king but Caesar.”"
    },
    {
      "verse": "16",
      "text": "Pilate folds under pressure and hands Jesus over. The soldiers take Him away."
    },
    {
      "verse": "17",
      "text": "Jesus carries His own cross. Walks out to Skull Hill, also called Golgotha."
    },
    {
      "verse": "18",
      "text": "They crucify Him there with two others — one on each side, Jesus in the middle."
    },
    {
      "verse": "19",
      "text": "Pilate puts a sign on the cross: “Jesus of Nazareth, King of the Jews.”"
    },
    {
      "verse": "20",
      "text": "The spot’s near the city, so everyone sees it. Written in Hebrew, Greek, and Latin."
    },
    {
      "verse": "21",
      "text": "The chief priests tell Pilate, “Say ‘He claimed to be King,’ not ‘He is King.’”"
    },
    {
      "verse": "22",
      "text": "Pilate says, “What’s written stays written.”"
    },
    {
      "verse": "23",
      "text": "The soldiers divide His clothes into four parts — one each. Then they find His tunic’s seamless, woven in one piece."
    },
    {
      "verse": "24",
      "text": "They say, “Let’s not tear it, let’s gamble for it.” That moment fulfills Scripture: They divided My garments and cast lots for My clothing."
    },
    {
      "verse": "25",
      "text": "Jesus’s mother, her sister, Mary wife of Clopas, and Mary Magdalene stand near the cross."
    },
    {
      "verse": "26",
      "text": "Jesus looks at His mother and the disciple He loves. Says, “Woman, look, your son.”"
    },
    {
      "verse": "27",
      "text": "Then to the disciple, “Look, your mother.” From that hour, the disciple takes her into his care."
    },
    {
      "verse": "28",
      "text": "Jesus knows it’s all finished now. He says, “I’m thirsty,” to fulfill Scripture."
    },
    {
      "verse": "29",
      "text": "They soak a sponge in sour wine, put it on a hyssop branch, and raise it to His mouth."
    },
    {
      "verse": "30",
      "text": "When Jesus tastes it, He says, “It is finished.” He bows His head and gives up His spirit."
    },
    {
      "verse": "31",
      "text": "Since it’s preparation day, the Jews ask Pilate to break their legs so the bodies don’t stay up on Sabbath."
    },
    {
      "verse": "32",
      "text": "Soldiers break the legs of the two men beside Him."
    },
    {
      "verse": "33",
      "text": "But when they reach Jesus, He’s already dead. So they don’t break His legs."
    },
    {
      "verse": "34",
      "text": "One of them stabs His side with a spear, and blood and water pour out."
    },
    {
      "verse": "35",
      "text": "The witness who saw it testifies — it’s true. He’s not capping."
    },
    {
      "verse": "36",
      "text": "This fulfills Scripture: Not one of His bones will be broken."
    },
    {
      "verse": "37",
      "text": "And another verse says: They will look on the One they pierced."
    },
    {
      "verse": "38",
      "text": "Later, Joseph of Arimathea — lowkey disciple, afraid of the Jews — asks Pilate for Jesus’s body. Pilate agrees."
    },
    {
      "verse": "39",
      "text": "Nicodemus (yeah, the same one from John 3) comes with a hundred pounds of myrrh and aloes."
    },
    {
      "verse": "40",
      "text": "They wrap Jesus’s body in linen and spices, Jewish burial style."
    },
    {
      "verse": "41",
      "text": "There’s a garden near the place of execution, with a new tomb never used before."
    },
    {
      "verse": "42",
      "text": "Because it’s the Jewish preparation day and the tomb’s close by, they lay Jesus there."
    }]},
    {
  "chapter": "20",
  "verses": [
    {
      "verse": "1",
      "text": "Early Sunday morning — still dark — Mary Magdalene pulls up to the tomb. Rock’s rolled away. She panics."
    },
    {
      "verse": "2",
      "text": "She sprints to Peter and the other disciple (the one Jesus loved) and says, “They took the Lord from the tomb! I don’t know where they put Him!”"
    },
    {
      "verse": "3",
      "text": "Peter and the other disciple start running. It’s basically a footrace."
    },
    {
      "verse": "4",
      "text": "The other disciple outruns Peter and gets there first — man was quick."
    },
    {
      "verse": "5",
      "text": "He looks inside, sees the linen wraps, but doesn’t go in."
    },
    {
      "verse": "6",
      "text": "Peter finally arrives, runs straight in, sees the linen cloths just lying there."
    },
    {
      "verse": "7",
      "text": "The face cloth that covered Jesus’s head is folded separately, neat and intentional."
    },
    {
      "verse": "8",
      "text": "The other disciple finally enters, sees it all, and *believes.*"
    },
    {
      "verse": "9",
      "text": "They didn’t fully get the Scripture yet — that He must rise from the dead."
    },
    {
      "verse": "10",
      "text": "Then the disciples dip, heading back home."
    },
    {
      "verse": "11",
      "text": "But Mary stays outside crying. She bends down to look into the tomb."
    },
    {
      "verse": "12",
      "text": "She sees two angels in white sitting where Jesus’s body had been — one at the head, one at the feet."
    },
    {
      "verse": "13",
      "text": "They ask, “Why you crying?” She says, “They took my Lord, and I don’t know where they put Him.”"
    },
    {
      "verse": "14",
      "text": "She turns around — Jesus standing there, but she doesn’t recognize Him."
    },
    {
      "verse": "15",
      "text": "He says, “Why you crying? Who you looking for?” Thinking He’s the gardener, she says, “Sir, if you moved Him, tell me where You put Him.”"
    },
    {
      "verse": "16",
      "text": "Jesus says, “Mary.” She turns and says, “Rabboni!” (which means Teacher). Recognition hits like thunder."
    },
    {
      "verse": "17",
      "text": "Jesus says, “Don’t hold on to Me. I haven’t gone up to the Father yet. Go tell My brothers I’m going up — to My Father and your Father, My God and your God.”"
    },
    {
      "verse": "18",
      "text": "Mary Magdalene goes and tells the crew, “I’ve seen the Lord,” and shares everything He said."
    },
    {
      "verse": "19",
      "text": "That evening, the disciples are locked in hiding. Jesus shows up — doors still shut — and says, “Peace be with you.”"
    },
    {
      "verse": "20",
      "text": "He shows them His hands and side. Joy overload hits them — the Lord’s alive."
    },
    {
      "verse": "21",
      "text": "Jesus says again, “Peace be with you. As the Father sent Me, I’m sending you.”"
    },
    {
      "verse": "22",
      "text": "Then He breathes on them. “Receive the Holy Spirit.”"
    },
    {
      "verse": "23",
      "text": "“If you forgive anyone’s sins, they’re forgiven. If you hold them, they’re held.”"
    },
    {
      "verse": "24",
      "text": "But Thomas (aka Twin) wasn’t there when Jesus came."
    },
    {
      "verse": "25",
      "text": "The others tell him, “We saw the Lord!” Thomas goes, “Nah. Unless I see the nail marks, touch His hands, and His side, I’m not buying it.”"
    },
    {
      "verse": "26",
      "text": "A week later, the disciples are inside again. Doors locked. Jesus pulls up again, same calm tone, “Peace be with you.”"
    },
    {
      "verse": "27",
      "text": "He turns to Thomas. “Go on, touch My hands. Put your hand in My side. Stop doubting, believe.”"
    },
    {
      "verse": "28",
      "text": "Thomas just says, “My Lord and my God.”"
    },
    {
      "verse": "29",
      "text": "Jesus says, “You believe because you saw Me. Blessed are the ones who haven’t seen yet still believe.”"
    },
    {
      "verse": "30",
      "text": "Jesus did plenty more miracles that didn’t make it into this book."
    },
    {
      "verse": "31",
      "text": "But these were written so you’d believe Jesus is the Messiah, the Son of God — and that by believing, you’d have life in His Name."
    }]},
    {
  "chapter": "21",
  "verses": [
    {
      "verse": "1",
      "text": "Early morning by the Sea of Tiberias, Peter and six other disciples are fishing — night shift grind, nothing biting."
    },
    {
      "verse": "2",
      "text": "The crew: Simon Peter, Thomas (aka Twin), Nathanael from Cana, the sons of Zebedee, and two others."
    },
    {
      "verse": "3",
      "text": "Peter’s like, “I’m going out again. Nothing’s biting.” They all jump in the boat, fishing all night, empty nets."
    },
    {
      "verse": "4",
      "text": "At dawn, Jesus is standing on the shore, but the disciples don’t recognize Him."
    },
    {
      "verse": "5",
      "text": "He calls out, “Yo, y’all catchin’ anything?”"
    },
    {
      "verse": "6",
      "text": "Peter shouts back, “Nope.” Jesus says, “Throw the net on the right side of the boat.” They do it, and boom — net full of fish, so many it can’t even hold."
    },
    {
      "verse": "7",
      "text": "The disciple Jesus loved says to Peter, “Yo, that’s the Lord!” Peter jumps in the water, leaving the net and the boat behind."
    },
    {
      "verse": "8",
      "text": "The other disciples haul the fish to shore — 153 big ones — the net didn’t tear at all."
    },
    {
      "verse": "9",
      "text": "Jesus says, “Come grab breakfast.” They see a charcoal fire, fish laid out, and bread ready."
    },
    {
      "verse": "10",
      "text": "Jesus says, “Bring some of the fish you just caught.”"
    },
    {
      "verse": "11",
      "text": "Simon Peter drags the net full of 153 fish to shore."
    },
    {
      "verse": "12",
      "text": "Jesus says, “Come, eat.” No arguing, just chill, real vibes."
    },
    {
      "verse": "13",
      "text": "None of the disciples dared to ask, “Who are You?” — they knew it was the Lord."
    },
    {
      "verse": "14",
      "text": "Jesus takes the bread and fish, feeds them — full on fellowship breakfast energy."
    },
    {
      "verse": "15",
      "text": "After breakfast, Jesus turns to Peter, “Simon, son of John, do you love Me more than these?” Peter goes, “Yes, Lord. You know I’m loyal.”"
    },
    {
      "verse": "16",
      "text": "Jesus says, “Feed My lambs.”"
    },
    {
      "verse": "17",
      "text": "He asks again, “Simon, son of John, do you love Me?” Peter says, “Yes, Lord. You know I got love.”"
    },
    {
      "verse": "18",
      "text": "Jesus says, “Take care of My sheep.”"
    },
    {
      "verse": "19",
      "text": "Third time: “Simon, son of John, do you love Me?” Peter is hurt, “Lord, You know everything. You know I love You.”"
    },
    {
      "verse": "20",
      "text": "Jesus: “Feed My sheep. Truth: when you were younger, you did what you wanted; now you’ll follow Me where I go.”"
    },
    {
      "verse": "21",
      "text": "Peter wonders about John: “Lord, what about him?”"
    },
    {
      "verse": "22",
      "text": "Jesus says, “Doesn’t matter for you. You follow Me. Don’t get distracted comparing others’ paths.”"
    },
    {
      "verse": "23",
      "text": "This saying spread among the disciples — nobody died about John, but Jesus didn’t tell Peter directly, so rumors circulated."
    },
    {
      "verse": "24",
      "text": "This disciple testifies about these things, and it’s true."
    },
    {
      "verse": "25",
      "text": "There are more things Jesus did — way more than can fit in this book. But these 25 verses are written so that you believe Jesus is the Messiah, the Son of God, and by believing, you get eternal life in His Name."
    }]}

  ]}