{
  "book": "Jonah",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "God hit Jonah with a mission: “Yo, head to Nineveh. That city wildin’. Their sin reached My DMs. Go warn them.”"
    },
    {
      "verse": "2",
      "text": "Jonah was like, “nah, I ain’t built for that smoke.” So he dipped — running the opposite direction."
    },
    {
      "verse": "3",
      "text": "Man booked a one-way ticket to Tarshish like he could hide from God. Bro literally tried to ghost the Almighty."
    },
    {
      "verse": "4",
      "text": "God said, “Aight bet,” and dropped a storm on the sea so hard the ship was doing backflips."
    },
    {
      "verse": "5",
      "text": "The sailors panicked, tossing cargo like, “save the ship!” Meanwhile Jonah? Napping. Man snoring while chaos loading."
    },
    {
      "verse": "6",
      "text": "The captain shook him awake: “Bro, pray to your God! Maybe He’ll notice before we all respawn!”"
    },
    {
      "verse": "7",
      "text": "They cast lots to find who caused this mess — Jonah got picked. God was like, you’re him."
    },
    {
      "verse": "8",
      "text": "They grilled him: “Who are you? What’s your job? Where you from? What you doin’, bro?”"
    },
    {
      "verse": "9",
      "text": "Jonah confessed: “I’m Hebrew. I serve the Lord, the God who made the sea and land you’re drowning in.”"
    },
    {
      "verse": "10",
      "text": "The sailors froze. “You WHAT? You ran from Him?” Fear hit the deck."
    },
    {
      "verse": "11",
      "text": "Storm kept getting angrier. They yelled, “What do we do to stop this?”"
    },
    {
      "verse": "12",
      "text": "Jonah: “Throw me overboard. I’m the reason. You’ll be chill after that.”"
    },
    {
      "verse": "13",
      "text": "They tried to row back to land — man, the sea said “nah.” It got worse."
    },
    {
      "verse": "14",
      "text": "The sailors prayed, “Lord, don’t smoke us for this man’s sins. We innocent!”"
    },
    {
      "verse": "15",
      "text": "Then they yeeted Jonah into the sea — instant calm. Ocean hit mute."
    },
    {
      "verse": "16",
      "text": "The sailors were shook. They started fearing God, offering sacrifices, pledging loyalty."
    },
    {
      "verse": "17",
      "text": "Meanwhile, God summoned a giant fish like an Uber from the deep. Jonah got swallowed and stayed in its belly three days, three nights."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "So yeah, Jonah finally prays — straight from inside the fish. Bro’s in the gut like, “Lord… we need a 1v1.”"
    },
    {
      "verse": "2",
      "text": "“I cried out from the lowest low, drowning in regret — and You actually heard me. Even from this underwater prison.”"
    },
    {
      "verse": "3",
      "text": "“You yeeted me into the deep. Waves kept body-slamming me. Thought that was the end credits.”"
    },
    {
      "verse": "4",
      "text": "“I was like, ‘Welp, God probably ghosted me.’ But nah — I still looked toward Your holy zone.”"
    },
    {
      "verse": "5",
      "text": "“The ocean had me wrapped like a burrito, seaweed crown on my head. Pure humiliation arc.”"
    },
    {
      "verse": "6",
      "text": "“I sank till I hit the mountain roots — locked in darkness, no exit. But You pulled me outta the pit, brought my soul back up.”"
    },
    {
      "verse": "7",
      "text": "“When I was running outta breath, I remembered You. My prayer went straight to Your throne, no delay.”"
    },
    {
      "verse": "8",
      "text": "“People chasing fake gods? They’re dropping real grace for discount fakes. L bozo move.”"
    },
    {
      "verse": "9",
      "text": "“But me? I’m done running. I’ll praise You loud. I’ll do what I promised. Salvation? That’s Your flex, God.”"
    },
    {
      "verse": "10",
      "text": "And then God told the fish, “Spit him out.” And the fish went, “Say less.” Jonah got launched onto the beach, slimy but saved."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Then God hit Jonah again with the same mission: “Yo, get up. Go to Nineveh, that big chaotic city, and tell ‘em what I’m sayin’.”"
    },
    {
      "verse": "2",
      "text": "Jonah didn’t dodge this time. Man got up, hit the road, and pulled up to Nineveh — place was massive, like three days to explore kinda massive."
    },
    {
      "verse": "3",
      "text": "First day in, Jonah stands up and yells, “Forty days from now — Nineveh’s done. Repent or get wrecked.”"
    },
    {
      "verse": "4",
      "text": "And shocker — the people listened. The Ninevites were like, “Nah, we ain’t playin’.” From CEOs to street dudes, everyone went on full fast mode — sackcloth fit, zero food."
    },
    {
      "verse": "5",
      "text": "Word hit the palace. The king himself hopped off his throne, peeled off the royal drip, threw on sackcloth, and sat in ashes like, “We gotta humble up, fr.”"
    },
    {
      "verse": "6",
      "text": "Then he dropped a decree: “Nobody — human, cow, sheep, or goat — eats or drinks. Full repentance lockdown.”"
    },
    {
      "verse": "7",
      "text": "“Everyone wear sackcloth. Cry to God like your life depends on it. Turn from evil, cancel the violence — all of it.”"
    },
    {
      "verse": "8",
      "text": "“Maybe, just maybe, God will cool off His anger and not fry us. Worth the try.”"
    },
    {
      "verse": "9",
      "text": "God peeped what they did — how they actually changed. No cap repentance."
    },
    {
      "verse": "10",
      "text": "So He hit pause on the destruction plan. Didn’t nuke the city. Mercy move unlocked. Grace wins."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "Jonah was mad. Bro salty that God didn’t destroy Nineveh. “I knew You’d be merciful! This ruins the vibe I wanted.”"
    },
    {
      "verse": "2",
      "text": "He prayed extra: “Lord, this is why I ran to Tarshish! I knew You’d pull back — You’re way too chill!”"
    },
    {
      "verse": "3",
      "text": "“Take my life already. I’m done. Can’t handle this mercy flex!”"
    },
    {
      "verse": "4",
      "text": "God hit him: “Yo, is it right for you to be salty like this?”"
    },
    {
      "verse": "5",
      "text": "Jonah left town, pitched a tent outside, and sat to watch what would happen. Maximum petty energy."
    },
    {
      "verse": "6",
      "text": "God grew a plant overnight, gave Jonah shade. Jonah hyped: “Ah, finally, relief from the heat.”"
    },
    {
      "verse": "7",
      "text": "Next morning, God sent a worm to wreck the plant. Shade gone. Jonah roasted under the sun."
    },
    {
      "verse": "8",
      "text": "Jonah sulked and complained: “Bro, I’m literally about to collapse. This is brutal!”"
    },
    {
      "verse": "9",
      "text": "God replied: “You’re mad about a plant you didn’t sweat over?”"
    },
    {
      "verse": "10",
      "text": "“I saved Nineveh — 120k people who don’t know their left from right, plus animals — and you throw a tantrum over a leaf?”"
    },
    {
      "verse": "11",
      "text": "Jonah got the memo: God’s mercy isn’t about fits or ego. Humans, cities, animals — His love flex is ultimate, unarguable, and epic."
    }]}

  ]}