{
  "book": "Jude",
  "chapters": [
    {
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Hey, this is Jude, a servant of Jesus and a sibling of James—sending a shoutout to all the people God has called and are keeping it real in faith."
    },
    {
      "verse": "2",
      "text": "May mercy, peace, and love get poured on you fully."
    },
    {
      "verse": "3",
      "text": "I was planning to write about the salvation we all share, but I felt I had to hit you with a warning instead: you’ve got to fight hard for the faith we were handed."
    },
    {
      "verse": "4",
      "text": "Some people snuck in uninvited—sneaky influencers in the wrong way. They twist God’s grace into an excuse for wild behavior and deny Jesus as their boss."
    },
    {
      "verse": "5",
      "text": "I want to remind you, even though you know it already: God saved His people from Egypt, but later those who didn’t believe got wiped out."
    },
    {
      "verse": "6",
      "text": "Also, angels who didn’t stick to their lane—God locked them up in eternal chains for judgment on the big day."
    },
    {
      "verse": "7",
      "text": "And Sodom and Gomorrah? Total chaos vibes—they went after sexual sins and perversion, and got annihilated as a warning."
    },
    {
      "verse": "8",
      "text": "These people are wild—they complain, argue, and follow their own shady desires. Their energy is all wrong."
    },
    {
      "verse": "9",
      "text": "Even Michael, the archangel, didn’t go off at Satan directly. He said, “God, back off!” instead of throwing shade on him himself."
    },
    {
      "verse": "10",
      "text": "But these people? They throw shade everywhere, spreading gossip, and they act without thinking—no filter."
    },
    {
      "verse": "11",
      "text": "Honestly, they’re like Cain (killed his brother out of jealousy), Balaam (cash-grabbing prophet), and Korah (rebellious leader)—total chaos squad energy."
    },
    {
      "verse": "12",
      "text": "These are the type who stir up drama at feasts, living it up while pretending to be spiritual. Clouds without rain, blown around by the wind."
    },
    {
      "verse": "13",
      "text": "Wild waves of the sea, foaming up their shame; wandering stars, doomed forever. Darkness is their final destination."
    },
    {
      "verse": "14",
      "text": "Enoch, the seventh from Adam, said something about God coming to judge: “Check this—God is coming with a ton of holy people to clap back on everyone.”"
    },
    {
      "verse": "15",
      "text": "He’s ready to throw judgment on all and rebuke the ungodly for all the messed-up stuff they’ve done, including all the harsh words spoken against Him."
    },
    {
      "verse": "16",
      "text": "These people complain constantly, chase after what they want, and boast about empty stuff. They’re hyped up without reason."
    },
    {
      "verse": "17",
      "text": "But you, dear friends, remember what the apostles of our Lord Jesus said—the OG messengers who told you the truth."
    },
    {
      "verse": "18",
      "text": "They warned you that in the last times, some sneaky people would show up, mocking and living off their own desires."
    },
    {
      "verse": "19",
      "text": "These people divide the squad, driven by their own selfishness, without the Spirit."
    },
    {
      "verse": "20",
      "text": "But you? Build yourselves up in your most solid faith, pray in the Spirit,"
    },
    {
      "verse": "21",
      "text": "keep yourselves in God’s love, while waiting for Jesus to come through with mercy for eternal life."
    },
    {
      "verse": "22",
      "text": "Be kind to people who aren’t sure about their faith."
    },
    {
      "verse": "23",
      "text": "Pull back those who are messed up, but do it carefully—don’t get tangled in their mess, and keep hating the sin but loving the person."
    },
    {
      "verse": "24",
      "text": "Now to God, who can keep you from falling, and put you standing strong, blameless, and hyped in front of His glory—"
    },
    {
      "verse": "25",
      "text": "to Him, our Savior, the one who can do it all, be glory, majesty, power, and authority before all time, now, and forever. Amen."
    }]}
]}