{
  "book": "Malachi",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, this the word from God dropped through Malachi — Israel, pay attention."
    },
    {
      "verse": "2",
      "text": "God says, “I’ve loved y’all, but you keep asking, ‘Fr how?’” God’s like, “Wasn’t Esau Jacob’s bro? Yet I picked Jacob. That’s love.”"
    },
    {
      "verse": "3",
      "text": "“But Esau? I curved him. His land? Turned into a wasteland. His hood’s now ghosted by wild beasts.”"
    },
    {
      "verse": "4",
      "text": "If Edom says, “We’ll rebuild,” God’s like, “Go ahead, but I’ll just wreck it again.” They’ll get labeled “The Wicked Nation,” always beefing with God."
    },
    {
      "verse": "5",
      "text": "You’ll see it yourself and say, “God’s name hitting global — way past our borders.”"
    },
    {
      "verse": "6",
      "text": "“A son honors his dad and a servant his boss. But if I’m your Father, where’s the honor? If I’m your Master, where’s the respect?” says the Lord of Armies to the priests throwing shade at His name."
    },
    {
      "verse": "7",
      "text": "“Y’all bring crusty sacrifices and call it worship.” Then you ask, “How we disrespecting You?” By putting garbage on My altar."
    },
    {
      "verse": "8",
      "text": "“Would you offer your governor a blind goat?” Nah. “Would he accept it?” Exactly. So why bring that to Me?” says the Lord."
    },
    {
      "verse": "9",
      "text": "“Now you want Me to bless you? Bro, be serious.”"
    },
    {
      "verse": "10",
      "text": "“Honestly, I wish one of y’all would just lock the temple doors. Stop faking worship. I’m not impressed by half-baked sacrifices,” says the Lord."
    },
    {
      "verse": "11",
      "text": "“From sunrise to sunset, My name’s going global. Pure worship rising from every nation — I’m not local, I’m legendary.”"
    },
    {
      "verse": "12",
      "text": "“But y’all dragging My name through the mud, saying the altar’s mid and the offerings lame.”"
    },
    {
      "verse": "13",
      "text": "“You sigh, ‘This is such a chore,’ and then pull up with stolen, busted animals. You really think that’s okay?” says the Lord."
    },
    {
      "verse": "14",
      "text": "“Cursed is the scammer who vows to bring the best but sacrifices trash instead. Do you forget who I am? I’m the Great King. My name is feared across nations,” says the Lord of Armies."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Yo priests, God’s got a word — and it’s not cute."
    },
    {
      "verse": "2",
      "text": "“If y’all don’t take Me seriously and stop acting like worship’s optional, I’ma flip the blessings into curses. Matter fact, it already happened.”"
    },
    {
      "verse": "3",
      "text": "“I’ma drag your reputation through the mud — literally. You’ll catch the fallout from your own fake sacrifices.”"
    },
    {
      "verse": "4",
      "text": "“Then you’ll know I’m not playing when I said My covenant with Levi still stands.”"
    },
    {
      "verse": "5",
      "text": "“That deal? It was built on life and peace. I gave that to him ‘cause he respected Me — real fear, not fake vibes.”"
    },
    {
      "verse": "6",
      "text": "“His words were truth. He never capped. He walked with Me in peace and integrity, turning people away from sin.”"
    },
    {
      "verse": "7",
      "text": "“A priest’s mouth supposed to drop wisdom — folks should be able to pull up for real knowledge, ‘cause he reppin’ Me.”"
    },
    {
      "verse": "8",
      "text": "“But y’all? You went left. You twisted My word and tripped people up like bad influencers. I’m done with it.”"
    },
    {
      "verse": "9",
      "text": "“That’s why I made y’all look like clowns before the people — ‘cause you ain’t living what you preach.”"
    },
    {
      "verse": "10",
      "text": "“We all got the same Father, right? So why you snaking each other like ops? Breaking covenant like it’s a joke.”"
    },
    {
      "verse": "11",
      "text": "“Judah wildin’. Straight-up disrespected God by linking up with pagan women — blending holy and unholy like a toxic mix.”"
    },
    {
      "verse": "12",
      "text": "“God’s cutting off anyone doing that — no descendants, no blessings, no invites to His presence.”"
    },
    {
      "verse": "13",
      "text": "“And don’t even start crying at the altar thinking that’ll fix it — God ain’t buying it.”"
    },
    {
      "verse": "14",
      "text": "“You ask why? ‘Cause you cheated on your covenant partner — your wife — the one you promised before God.”"
    },
    {
      "verse": "15",
      "text": "“Didn’t God make you one? Yeah. And what’s He looking for? Godly offspring. So protect your marriage like it’s sacred. Don’t cheat, don’t fold.”"
    },
    {
      "verse": "16",
      "text": "“God straight-up says, ‘I hate divorce.’ It covers people with pain and violence. So stay loyal. Don’t ghost your spouse.”"
    },
    {
      "verse": "17",
      "text": "“Y’all been exhausting God with your talk. You keep saying, ‘God’s cool with evil,’ or ‘Where’s God’s justice?’ Bro, He’s right here — He’s just patient. But don’t test Him.”"
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "“Aight, I’m sending My messenger to clear the stage before I pull up,” says the Lord. “Then boom — the Boss Himself (the One you been waiting for) is stepping in.”"
    },
    {
      "verse": "2",
      "text": "“But real talk, who can stand when He shows up? Dude’s pulling up like blazing fire, like bleach for souls.”"
    },
    {
      "verse": "3",
      "text": "“He gon’ refine people like gold, purify the priests till they shine clean again, ready to serve right.”"
    },
    {
      "verse": "4",
      "text": "“Then Judah and Jerusalem’s worship gonna hit different — pleasing again, not empty performance.”"
    },
    {
      "verse": "5",
      "text": "“But I’m also bringing receipts. I’ll testify against fakes — sorcerers, cheaters, liars, exploiters, oppressors — all those who play God’s people and shrug it off.”"
    },
    {
      "verse": "6",
      "text": "“I, the Lord, don’t switch up. That’s the only reason y’all ain’t been deleted.”"
    },
    {
      "verse": "7",
      "text": "“Since day one, y’all been dodging My laws. Come back to Me, and I’ll come back to you — but y’all asking, ‘How we supposed to?’”"
    },
    {
      "verse": "8",
      "text": "“Yo, can a man rob God? Y’all did. You robbed Me in tithes and offerings.”"
    },
    {
      "verse": "9",
      "text": "“That’s why the curse hit the nation — everyone dipping on Me.”"
    },
    {
      "verse": "10",
      "text": "“Bring the full tithe into My house so there’s supply. Test Me — yeah, I said test Me — and see if I don’t open heaven’s floodgates. Blessings too heavy to store.”"
    },
    {
      "verse": "11",
      "text": "“I’ll guard your crops, your hustle, your grind — nothing’s gonna devour your effort anymore.”"
    },
    {
      "verse": "12",
      "text": "“Then all nations will call you blessed, ‘cause your land will hit main-character glow.”"
    },
    {
      "verse": "13",
      "text": "“Y’all been talking reckless, saying, ‘Serving God’s pointless.’”"
    },
    {
      "verse": "14",
      "text": "“You complain, ‘We do right, and still get nothing. The wicked living large.’”"
    },
    {
      "verse": "15",
      "text": "“You watch people doing dirt and think they winning, while they testing God and still breathing easy.”"
    },
    {
      "verse": "16",
      "text": "“But then, the real ones — those who fear God — linked up and spoke truth. God eavesdropped and wrote their names in His book.”"
    },
    {
      "verse": "17",
      "text": "“God said, ‘Those ones? They My jewels. On that day, I’ll flex My loyalty — they’ll be Mine, and I’ll spare them like a dad spares his fave kid.’”"
    },
    {
      "verse": "18",
      "text": "“Then you’ll finally see the difference — between the real ones who serve God and the frauds who don’t.”"
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "“Yo, the day’s coming — hot like an oven. Every arrogant flexer, every evil schemer? Toasted. Burned like dry grass, no roots, no comeback.”"
    },
    {
      "verse": "2",
      "text": "“But for the real ones who stay loyal to Me? The Sun of Righteousness rises with healing rays. Y’all gon’ step out glowing, free, wild like calves breaking outta the pen.”"
    },
    {
      "verse": "3",
      "text": "“You’ll stomp on the ashes of the wicked — they’ll be dust under your sneakers. That’s My Word.”"
    },
    {
      "verse": "4",
      "text": "“Remember the laws I dropped through Moses — all the commands, all the warnings. Don’t play forgetful.”"
    },
    {
      "verse": "5",
      "text": "“Look out — I’m sending Elijah the prophet before the big day hits, the Lord’s final pull-up.”"
    },
    {
      "verse": "6",
      "text": "“He’s gonna reconcile hearts — fathers and kids back on good terms — or else I’ll strike the land with total destruction.”"
    }]}
  ]}