{
  "book": "Obadiah",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Vision from God that Obadiah got about Edom."
    },
    {
      "verse": "2",
      "text": "God’s like, “Edom, you think you’re untouchable? I’m about to humble you.”"
    },
    {
      "verse": "3",
      "text": "Even if you chill in the clouds or hide super high, I’ll pull you down."
    },
    {
      "verse": "4",
      "text": "Mountains, fortresses, high spots—you’re still not safe. Pride’s your downfall."
    },
    {
      "verse": "5",
      "text": "Your neighbors gonna laugh when trouble hits; your allies won’t back you."
    },
    {
      "verse": "6",
      "text": "No one’s coming to help. When trouble strikes, you’re solo."
    },
    {
      "verse": "7",
      "text": "Your violence and schemes? Karma’s real—coming right back at you."
    },
    {
      "verse": "8",
      "text": "Your own fam turns on you; even your closest peeps won’t save you."
    },
    {
      "verse": "9",
      "text": "Your city walls? Useless. You’re about to be roasted."
    },
    {
      "verse": "10",
      "text": "God’s like, “You did dirty to my people. That’s on you.”"
    },
    {
      "verse": "11",
      "text": "Remember sneaking around during your brother’s chaos? That energy is coming back."
    },
    {
      "verse": "12",
      "text": "Don’t flex while others are hurting. God sees everything."
    },
    {
      "verse": "13",
      "text": "Cheering on your neighbor’s loss? Big yikes."
    },
    {
      "verse": "14",
      "text": "The day’s coming when you’ll get served what you dished."
    },
    {
      "verse": "15",
      "text": "The Lord’s day is coming for everyone; your actions catch up, no cap."
    },
    {
      "verse": "16",
      "text": "Those who helped you? They get the same energy you threw at others."
    },
    {
      "verse": "17",
      "text": "God’s people? They get saved and thrive."
    },
    {
      "verse": "18",
      "text": "Edom’s crew is getting wiped out; Jacob’s squad is shining."
    },
    {
      "verse": "19",
      "text": "Israel’s exiles return and reclaim their land."
    },
    {
      "verse": "20",
      "text": "The nations around them get judged; God’s Kingdom rules."
    },
    {
      "verse": "21",
      "text": "And the Kingdom belongs to God—forever lit, always."
    }
  ]
}
  ]}