{
  "book": "Philippians",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Paul and Timothy, locked up but flexing hard for Christ, shoutout to the squad in Philippi—bishops and deacons included."
    },
    {
      "verse": "2",
      "text": "Grace and peace to y’all from God our Father and the Lord Jesus. Stay solid."
    },
    {
      "verse": "3",
      "text": "I thank God every grind day for you, y’all in my prayers, locked in with love."
    },
    {
      "verse": "4",
      "text": "Always hype, praying with joy for y’all, cause you ride with me in this gospel hustle."
    },
    {
      "verse": "5",
      "text": "Y’all partnered from day one in spreading the good news—real MVPs, no cap."
    },
    {
      "verse": "6",
      "text": "And I’m confident God’s gonna finish the work He started in you, full flex mode."
    },
    {
      "verse": "7",
      "text": "Right for me to think of you, cause you’re locked in my heart, riding with me in Christ."
    },
    {
      "verse": "8",
      "text": "God’s witness knows I burn in prayer for y’all, full heart, full vibe."
    },
    {
      "verse": "9",
      "text": "My prayer? Love overflow, knowledge sharp, flexing wisdom with the Lord."
    },
    {
      "verse": "10",
      "text": "So you can peep what’s real, pure, straight-up righteous, ready for every good hustle."
    },
    {
      "verse": "11",
      "text": "Filled with the fruit of righteousness from Jesus, bringing glory to God’s power flex."
    },
    {
      "verse": "12",
      "text": "Don’t stress, y’all—what’s happening in my chains? God’s flexing it for the gospel."
    },
    {
      "verse": "13",
      "text": "My prison? Fuel for the message, chains hype the mission."
    },
    {
      "verse": "14",
      "text": "Most preach Christ outta envy and strife, trying to throw shade."
    },
    {
      "verse": "15",
      "text": "Some preach outta love and goodwill, lifting God’s word."
    },
    {
      "verse": "16",
      "text": "The love crew? They know I’m set for defending the gospel—no cap, full support."
    },
    {
      "verse": "17",
      "text": "The envy/strife crew? They want to add affliction to my chains, but God wins."
    },
    {
      "verse": "18",
      "text": "Either way, Christ is getting the spotlight, that’s the main score."
    },
    {
      "verse": "19",
      "text": "Live in faith, don’t stress the motives—just ride with the gospel, y’all."
    },
    {
      "verse": "20",
      "text": "Rejoice anyway, cause my grind, chains and all, hype Christ being spread."
    },
    {
      "verse": "21",
      "text": "God’s got my back—He’ll deliver me, and do it in style, unstoppable."
    },
    {
      "verse": "22",
      "text": "All of you, stay pumped, keep me honest, so Christ flexes in my body, by life or death."
    },
    {
      "verse": "23",
      "text": "Life is Christ, death is leveling up with Him—both for the win."
    },
    {
      "verse": "24",
      "text": "If I keep grinding alive? Fruit for y’all. If I dip? Gains with Christ."
    },
    {
      "verse": "25",
      "text": "But living? More chance to pump God’s message, grow our squad."
    },
    {
      "verse": "26",
      "text": "Then I can hype you more, and your faith gets mad strong."
    },
    {
      "verse": "27",
      "text": "Stand firm, united vibes, fearless in the gospel, no shame flexing Christ."
    },
    {
      "verse": "28",
      "text": "Let nothing scare you, intimidate you, keep the vibe strong, Spirit-powered."
    },
    {
      "verse": "29",
      "text": "Y’all got the gift—believe AND suffer for Christ. That’s honor unlocked."
    },
    {
      "verse": "30",
      "text": "And the same conflict you see in me? Now ride it, fight the gospel fight with me."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Squad, if there’s any encouragement in Christ, any hype in love, any unity vibes, any comp squad energy—stack it."
    },
    {
      "verse": "2",
      "text": "Make my joy complete: vibe together, same mindset, zero ego flex."
    },
    {
      "verse": "3",
      "text": "Don’t play big; serve each other. Lowkey, humble—don’t chase clout."
    },
    {
      "verse": "4",
      "text": "Don’t just care about your own drip; check on others, too."
    },
    {
      "verse": "5",
      "text": "Think like Christ: He flexed humility, became a servant first."
    },
    {
      "verse": "6",
      "text": "Though He was God, He didn’t cling to the throne like a king wannabe."
    },
    {
      "verse": "7",
      "text": "He emptied Himself, taking the servant vibe, born in human form."
    },
    {
      "verse": "8",
      "text": "He humbled Himself hardcore, obedient to death—yes, even the cross energy."
    },
    {
      "verse": "9",
      "text": "That’s why God flexed Him up: top-tier name above all names."
    },
    {
      "verse": "10",
      "text": "So every knee will bend—sky, earth, and the squad in between."
    },
    {
      "verse": "11",
      "text": "Every tongue will confess: Jesus Christ = Lord, ultimate boss flex."
    },
    {
      "verse": "12",
      "text": "Squad, keep grinding your salvation with respect and lowkey awe—not just autopilot."
    },
    {
      "verse": "13",
      "text": "God’s energy is working through you—so actually walk the talk, not just lip-service."
    },
    {
      "verse": "14",
      "text": "Do everything without whiny vibes, zero complaints, no clout-chasing drama."
    },
    {
      "verse": "15",
      "text": "Stand spotless, pure, like true Gen Z lights in a world gone sus."
    },
    {
      "verse": "16",
      "text": "Hold tight to the Word, no fake flex, so you shine, no cap, in the madness."
    },
    {
      "verse": "17",
      "text": "My grind? Sacrifice your hustle with me; call it a worship flex."
    },
    {
      "verse": "18",
      "text": "I’m hyped, rejoicing with y’all, and y’all should vibe with me too."
    },
    {
      "verse": "19",
      "text": "I hope soon to send Timothy—he’s my true brother, same mind, full trust energy."
    },
    {
      "verse": "20",
      "text": "Everyone else? Lowkey only cares about themselves, chasing ego and clout."
    },
    {
      "verse": "21",
      "text": "But Timothy proves it different: he served me like a son, no self flex, pure loyalty."
    },
    {
      "verse": "22",
      "text": "You know his character; he genuinely checks for your squad’s well-being, not his own."
    },
    {
      "verse": "23",
      "text": "I hope to send him ASAP after my situation is sorted, so he can hype y’all up."
    },
    {
      "verse": "24",
      "text": "And I’m confident he’ll be there soon—true MVP, no cap."
    },
    {
      "verse": "25",
      "text": "Epaphroditus? My bro, real MVP—he risked his life for the mission."
    },
    {
      "verse": "26",
      "text": "God’s love got him close to death, but he came through alive, saving my squad’s slack."
    },
    {
      "verse": "27",
      "text": "Welcome him hype-style, give him full respect."
    },
    {
      "verse": "28",
      "text": "I sent him quick so y’all could rejoice, and my sorrow chills a bit."
    },
    {
      "verse": "29",
      "text": "Treat him with mad respect, top-tier rep, no fake moves."
    },
    {
      "verse": "30",
      "text": "Why? Close to death for Christ, filling the gap where y’all couldn’t ride."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Squad, rejoice in the Lord! Always hype, no cap. Watch out for clout-chasers—they flex with empty vibes."
    },
    {
      "verse": "2",
      "text": "Beware the dogs—fake flexers doing evil, mutilating the truth, trying to cut your squad off from God’s real energy."
    },
    {
      "verse": "3",
      "text": "We? We’re the true squad—real circumcision of heart, Spirit-powered, not just rules on skin. We flex in God, not human badges."
    },
    {
      "verse": "4",
      "text": "Even if you bragged on human credentials, I got more—circumcised on the eighth day, tribe is Israel, Benjamite squad, Pharisee-level grind."
    },
    {
      "verse": "5",
      "text": "Hardcore zeal, law-level perfect, and devout to the law’s rituals—was I flexing? Nah, that’s past life."
    },
    {
      "verse": "6",
      "text": "But all that glory? Garbage. I call it pure sus next to knowing Christ."
    },
    {
      "verse": "7",
      "text": "Everything I once clutched—status, creds, achievements—I count as straight loss for Christ."
    },
    {
      "verse": "8",
      "text": "Why? Knowing Him > everything. I caught the vibes of His resurrection power, death flexed, new life unlocked."
    },
    {
      "verse": "9",
      "text": "Not trying to earn points from the law—just trusting God, faith on fleek, Jesus’ energy imprinted on me."
    },
    {
      "verse": "10",
      "text": "My goal? Know Him fully, feel the power of His resurrection, vibe with His sufferings, level up in His death."
    },
    {
      "verse": "11",
      "text": "Maybe I’ll even reach the ultimate—resurrection from the dead. That’s peak energy."
    },
    {
      "verse": "12",
      "text": "I’m not perfect yet, not fully there, but I chase it, forgetting the past, eyes locked on the prize."
    },
    {
      "verse": "13",
      "text": "Forget what’s behind, bro, reach for what’s ahead—press toward the heavenly flex."
    },
    {
      "verse": "14",
      "text": "I sprint for the finish line, prize of God’s call in Christ Jesus—eternal vibes unlocked."
    },
    {
      "verse": "15",
      "text": "If you’re mature, squad, think this way. If you disagree, God will show you the truth eventually."
    },
    {
      "verse": "16",
      "text": "Whatever we’ve already attained, let’s keep walking by that same standard, no wobble."
    },
    {
      "verse": "17",
      "text": "Squad, imitate me—follow my lead, I follow Christ fully."
    },
    {
      "verse": "18",
      "text": "There’s many haters, lowkey enemies of the cross, living for worldly drip, flexing empty promises."
    },
    {
      "verse": "19",
      "text": "Their end? Hellbound, appetite on Earth only, chasing clout and snacks."
    },
    {
      "verse": "20",
      "text": "But our citizenship? Heaven, fam. From there, we await our Savior—Jesus, Lord, ultimate boss, returning with full power."
    },
    {
      "verse": "21",
      "text": "He’ll flip our mortal drip to immortality, leveling us fully with His power. Squad forever upgraded."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "Yo squad, stand firm in the Lord, I’m hype for you. Tight bond—stand your ground!"
    },
    {
      "verse": "2",
      "text": "Euodia, Syntyche—squad beef? Chill, reconcile, vibe together in the Lord."
    },
    {
      "verse": "3",
      "text": "And yo, my loyal ones, you who grind with me in the gospel—help these ladies out, big flex for teamwork."
    },
    {
      "verse": "4",
      "text": "Rejoice always! Legit, nonstop hype in the Lord. I say again: rejoice."
    },
    {
      "verse": "5",
      "text": "Squad, stay chill, gentleness on fleek. Everyone sees your mood—rep God vibes."
    },
    {
      "verse": "6",
      "text": "Don’t stress, don’t sweat—prayer + gratitude = peace that’s unexplainable, God’s energy guarding your heart & mind."
    },
    {
      "verse": "7",
      "text": "That peace? Full lock. Beyond brainpower, but fully God’s flex, keeping you steady."
    },
    {
      "verse": "8",
      "text": "Squad, think on the real, the clean, the honest, the pure, the praiseworthy, the top-tier, the vibe-worthy."
    },
    {
      "verse": "9",
      "text": "Do what you learned, received, heard, saw in me—God’s energy will secure your flex."
    },
    {
      "verse": "10",
      "text": "I’m lowkey happy, fam. Once stressed, now chill—thanks to your prayers & God’s vibes."
    },
    {
      "verse": "11",
      "text": "I’ve learned to vibe in any state—rich, poor, full, empty—contentment unlocked."
    },
    {
      "verse": "12",
      "text": "Flexed hard, fam. Learned the secret: master contentment in every grind."
    },
    {
      "verse": "13",
      "text": "I can do all things, fam, powered by Christ—strength unlocked."
    },
    {
      "verse": "14",
      "text": "Big flex: your support of me? Major boost, squad love."
    },
    {
      "verse": "15",
      "text": "You Philippians? OG supporters—my gospel grind recognized you from day one."
    },
    {
      "verse": "16",
      "text": "When I dipped from Macedonia, you sent support first—clout unlocked, real MVPs."
    },
    {
      "verse": "17",
      "text": "I’m not flexing for your stash—my goal? Eternal reward, your fruit going straight to God’s account."
    },
    {
      "verse": "18",
      "text": "You sent blessings, fully supplied my needs—fragrance of sacrifice, full-on worship energy."
    },
    {
      "verse": "19",
      "text": "And God? Full send. Fills all your needs, crazy energy, by His glory in Christ Jesus."
    },
    {
      "verse": "20",
      "text": "Big flex to God forever—fam, church, Jesus Christ. Amen."
    },
    {
      "verse": "21",
      "text": "Greet every saint and the brethren with me—holy hugs, clout-free love."
    },
    {
      "verse": "22",
      "text": "Greet all the saints, especially those in Caesar’s household—Gospel big moves, even at the top."
    },
    {
      "verse": "23",
      "text": "The Lord of peace, full-time flex, always be with your spirit—final benediction, no cap. Amen."}]}]}