{
  "book": "Philemon",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, Paul here—locked up for Jesus, rolling with my bro Timothy—sending love to Philemon, our ride-or-die in faith, and to Apphia, Archippus, and your squad who meet at your place."
    },
    {
      "verse": "2",
      "text": "Big vibes of grace and peace from God our Father and Jesus hit you hard."
    },
    {
      "verse": "3",
      "text": "Lowkey, I always thank God when I’m thinking about you,"
    },
    {
      "verse": "4",
      "text": "‘Cause I hear your faith is solid and your love game is strong for Jesus and the crew."
    },
    {
      "verse": "5",
      "text": "Your faith is poppin’ and your love is real—everyone’s talking about it."
    },
    {
      "verse": "6",
      "text": "I pray your faith and knowing God keeps leveling up, so you can flex all the good stuff in Him fully."
    },
    {
      "verse": "7",
      "text": "Your love has seriously hyped up the hearts of God’s squad, Philemon—you’re making moves people notice."
    },
    {
      "verse": "8",
      "text": "So check this: even though I could boss you around in Christ,"
    },
    {
      "verse": "9",
      "text": "I’m keeping it 100 and appealing to you with love. I, Paul, old-timer and now in chains for Jesus, am asking you personally."
    },
    {
      "verse": "10",
      "text": "I’m talking about my kid in faith, Onesimus, who’s like a son to me while I’ve been stuck in here."
    },
    {
      "verse": "11",
      "text": "He was kinda useless before, but now? Total upgrade—he’s useful to both of us, and especially to you."
    },
    {
      "verse": "12",
      "text": "I’m sending him back to you, but real talk—I’m sending my heart with him too."
    },
    {
      "verse": "13",
      "text": "I lowkey wanted to keep him here to help me while I’m chained for the gospel,"
    },
    {
      "verse": "14",
      "text": "but I didn’t want to do anything without your say-so—so your move is fully voluntary, not forced."
    },
    {
      "verse": "15",
      "text": "Honestly, maybe this separation was God’s plan so he could roll back to you forever, not just for a sec."
    },
    {
      "verse": "16",
      "text": "So now he’s not just a servant—he’s more than that. He’s a beloved brother in Christ. He’s mad important to me, and he should be important to you too."
    },
    {
      "verse": "17",
      "text": "If you see me as your partner in faith, welcome him like you’d welcome me."
    },
    {
      "verse": "18",
      "text": "And if he owes you or messed up, don’t stress—count it on me."
    },
    {
      "verse": "19",
      "text": "Yep, I wrote this myself—Paul, pen in hand. I got this."
    },
    {
      "verse": "20",
      "text": "Big ask: refresh my heart in Christ."
    },
    {
      "verse": "21",
      "text": "I’m confident you’ll do even more than I say—your track record is strong."
    },
    {
      "verse": "22",
      "text": "Can’t wait to swing by soon; maybe you can do me a little favor then so we’re both hyped."
    },
    {
      "verse": "23",
      "text": "Epaphras, my teammate in Christ Jesus, says hey."
    },
    {
      "verse": "24",
      "text": "Also sending love from Mark, Aristarchus, Demas, and Luke—my fellow workers."
    },
    {
      "verse": "25",
      "text": "Peace out—may the grace of Jesus Christ be heavy on your spirit."
    }
  ]
}
  ]}