{
  "book": "Proverbs",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, these are Solomon’s proverbs — straight facts from Israel’s king, son of David."
    },
    {
      "verse": "2",
      "text": "They drop wisdom and understanding, so you can know life and make smart moves."
    },
    {
      "verse": "3",
      "text": "They teach right living, fairness, and keeping it real in the world."
    },
    {
      "verse": "4",
      "text": "They give sense to beginners and knowledge to young peeps."
    },
    {
      "verse": "5",
      "text": "Even the wise can hear more and level up."
    },
    {
      "verse": "6",
      "text": "They help understand puzzles, clever sayings, and hidden truths."
    },
    {
      "verse": "7",
      "text": "Respecting God is the start of real wisdom. Ignore Him? You’re just foolish."
    },
    {
      "verse": "8",
      "text": "Listen up, my kid — don’t ghost your father’s advice or skip your mother’s teaching."
    },
    {
      "verse": "9",
      "text": "Their words are like chains of honor — they protect and bless you."
    },
    {
      "verse": "10",
      "text": "If the wrong crowd tries to pull you into shady moves, don’t roll with them."
    },
    {
      "verse": "11",
      "text": "They might say, “Come, let’s lie in wait for someone to steal from them.” Don’t go there."
    },
    {
      "verse": "12",
      "text": "They lie in wait for evil, planning harm."
    },
    {
      "verse": "13",
      "text": "They think, “We’ll get rich by doing wrong.” Don’t follow that path."
    },
    {
      "verse": "14",
      "text": "Stay away — their way ends in disaster."
    },
    {
      "verse": "15",
      "text": "My child, keep your feet clean; don’t step into their mess."
    },
    {
      "verse": "16",
      "text": "Their path is risky, their ways collapse on themselves."
    },
    {
      "verse": "17",
      "text": "Stolen gain is useless — the trap is set in vain."
    },
    {
      "verse": "18",
      "text": "The violent/wicked lie in wait for their own lives — self-destruction comes for them."
    },
    {
      "verse": "19",
      "text": "Greed never wins; it always backfires."
    },
    {
      "verse": "20",
      "text": "Wisdom shouts in the streets, calling out in public squares."
    },
    {
      "verse": "21",
      "text": "She speaks at city gates, calling out to those who lack sense."
    },
    {
      "verse": "22",
      "text": "But fools ignore her, scrolling past, thinking she’s irrelevant."
    },
    {
      "verse": "23",
      "text": "“Turn to me and live,” she says. “Pay attention — blessings follow.”"
    },
    {
      "verse": "24",
      "text": "But they refuse and reject her advice."
    },
    {
      "verse": "25",
      "text": "When trouble comes, they’re shocked: “Where was the warning?”"
    },
    {
      "verse": "26",
      "text": "I called, but they ignored me; their choices trap them."
    },
    {
      "verse": "27",
      "text": "Trouble comes like a storm, and fear won’t save them."
    },
    {
      "verse": "28",
      "text": "They cry for help, but it’s too late — trapped by their own decisions."
    },
    {
      "verse": "29",
      "text": "They hated knowledge and rejected wisdom."
    },
    {
      "verse": "30",
      "text": "So they pay for ignoring her words."
    },
    {
      "verse": "31",
      "text": "Foolishness traps them; consequences are real."
    },
    {
      "verse": "32",
      "text": "Their choices roast them; consequences hit hard."
    },
    {
      "verse": "33",
      "text": "But anyone who listens to Wisdom will live safe, chill, and blessed — no stress, no fear."
    }
  ]
},
{
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, my kid, if you vibe with my words and keep my commands close,"
    },
    {
      "verse": "2",
      "text": "Tune in, pay attention to wisdom, and chase understanding."
    },
    {
      "verse": "3",
      "text": "Call for it like it’s the hottest drop — search for it like you’re hunting treasure."
    },
    {
      "verse": "4",
      "text": "Seek it like rare loot, grinding hard like it’s your main quest."
    },
    {
      "verse": "5",
      "text": "If you do, you’ll finally get the fear of the Lord and find knowledge of God."
    },
    {
      "verse": "6",
      "text": "‘Cause God’s the plug — He drops wisdom, understanding, and insight straight."
    },
    {
      "verse": "7",
      "text": "He keeps the righteous safe, guarding those who walk in integrity."
    },
    {
      "verse": "8",
      "text": "He shields the true-hearted, protecting them from wrong moves."
    },
    {
      "verse": "9",
      "text": "Then you’ll understand righteousness, justice, and fairness — all the real moves."
    },
    {
      "verse": "10",
      "text": "Wisdom slides in, and knowledge vibes with your soul."
    },
    {
      "verse": "11",
      "text": "Discretion guards you, and understanding watches your back."
    },
    {
      "verse": "12",
      "text": "They’ll save you from shady paths, from people walking twisted ways."
    },
    {
      "verse": "13",
      "text": "From those who leave the straight track and wander into darkness."
    },
    {
      "verse": "14",
      "text": "From people acting shady, scheming evil, and rolling in sin."
    },
    {
      "verse": "15",
      "text": "Their path is crooked; their steps collapse on themselves."
    },
    {
      "verse": "16",
      "text": "Wisdom saves you from the smooth talkers who seduce with lies."
    },
    {
      "verse": "17",
      "text": "From those who abandon loyalty and leave their true paths."
    },
    {
      "verse": "18",
      "text": "Their house leads to death; their paths are fatal."
    },
    {
      "verse": "19",
      "text": "Anyone stuck in that chaos won’t return — destruction is waiting."
    },
    {
      "verse": "20",
      "text": "Walk in the way of good people, stick to the path of the righteous."
    },
    {
      "verse": "21",
      "text": "Then you’ll inhabit the land securely; the upright remain planted there."
    },
    {
      "verse": "22",
      "text": "But the wicked? They’re removed from life — their fate ends in ruin."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "My kid, don’t forget my words; keep my commands close to your heart."
    },
    {
      "verse": "2",
      "text": "They’ll add length to your life and bring peace every day."
    },
    {
      "verse": "3",
      "text": "Don’t lose loyalty and love — keep them tight around your neck; they’ll flex honor and respect."
    },
    {
      "verse": "4",
      "text": "Then you’ll gain favor and a solid reputation with God and people."
    },
    {
      "verse": "5",
      "text": "Trust the Lord fully; don’t lean only on your own brain."
    },
    {
      "verse": "6",
      "text": "In everything you do, acknowledge Him, and He’ll make your path straight."
    },
    {
      "verse": "7",
      "text": "Don’t act all wise in your own eyes — fear God, and steer clear of evil."
    },
    {
      "verse": "8",
      "text": "That’ll bring health to your body and strength to your bones."
    },
    {
      "verse": "9",
      "text": "Honor God with your wealth; give your firstfruits of all your crops."
    },
    {
      "verse": "10",
      "text": "Then your barns will overflow, and your vats will run over with juice."
    },
    {
      "verse": "11",
      "text": "My kid, don’t ghost the Lord’s discipline; don’t get mad when He corrects you."
    },
    {
      "verse": "12",
      "text": "God trains the ones He loves, like a coach pushing their star player."
    },
    {
      "verse": "13",
      "text": "Blessed is the one who grabs wisdom — they’re living the dream."
    },
    {
      "verse": "14",
      "text": "She’s more valuable than silver; her reward beats gold."
    },
    {
      "verse": "15",
      "text": "She’s worth more than jewels; nothing you want compares."
    },
    {
      "verse": "16",
      "text": "Long life is in her right hand; wealth and honor in her left."
    },
    {
      "verse": "17",
      "text": "Her ways are pleasant, and all her paths are chill."
    },
    {
      "verse": "18",
      "text": "She’s a tree of life for those who hold her tight; whoever grabs her is blessed."
    },
    {
      "verse": "19",
      "text": "By wisdom, the Lord laid the earth’s foundations and set the skies in place."
    },
    {
      "verse": "20",
      "text": "By His knowledge, the depths split, and clouds drip dew."
    },
    {
      "verse": "21",
      "text": "My kid, keep wisdom and discretion tight; don’t lose them."
    },
    {
      "verse": "22",
      "text": "They’ll be life for your soul and flex for your neck."
    },
    {
      "verse": "23",
      "text": "Then you’ll walk without stress and sleep safe, no nightmares."
    },
    {
      "verse": "24",
      "text": "When you lie down, you won’t fear; you’ll snooze, peaceful."
    },
    {
      "verse": "25",
      "text": "Don’t stress over sudden drama or the chaos of the wicked."
    },
    {
      "verse": "26",
      "text": "God will keep you safe; He’ll guard your life."
    },
    {
      "verse": "27",
      "text": "Don’t hold back good from people who deserve it when you can act."
    },
    {
      "verse": "28",
      "text": "Don’t say, “Go come back tomorrow,” when you can help today."
    },
    {
      "verse": "29",
      "text": "Don’t plot harm against your neighbor — they’re counting on you."
    },
    {
      "verse": "30",
      "text": "Don’t fight over nothing; stay chill with people."
    },
    {
      "verse": "31",
      "text": "Don’t envy violent people; don’t copy their ways."
    },
    {
      "verse": "32",
      "text": "The Lord hates wickedness but loves those who walk right."
    },
    {
      "verse": "33",
      "text": "The Lord blesses the home of the righteous, but the house of the wicked is doomed."
    },
    {
      "verse": "34",
      "text": "He mocks the mockers but gives grace to the humble."
    },
    {
      "verse": "35",
      "text": "The wise inherit glory, but fools get nothing but shame."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "My kids, listen up — tune in to your parents’ teaching; pay attention to get wisdom."
    },
    {
      "verse": "2",
      "text": "These words are life; don’t ghost them."
    },
    {
      "verse": "3",
      "text": "I was a kid too; my father taught me, my mom showed me the ropes."
    },
    {
      "verse": "4",
      "text": "They said, “Hold onto this knowledge — it’s your shield.”"
    },
    {
      "verse": "5",
      "text": "Grab wisdom, level up, don’t let go; get insight and keep it close."
    },
    {
      "verse": "6",
      "text": "Flex it like a chain around your neck; it’ll keep you safe."
    },
    {
      "verse": "7",
      "text": "Wisdom is top-tier — get it, and life is unlocked. Understanding comes with the grind."
    },
    {
      "verse": "8",
      "text": "Keep it high, and it’ll lift you; embrace it, and it’ll protect you."
    },
    {
      "verse": "9",
      "text": "Its glow is like a crown; its shine is like a chain of honor."
    },
    {
      "verse": "10",
      "text": "Listen, my kid, and your life will be lit; years will be added to your grind."
    },
    {
      "verse": "11",
      "text": "I’ll teach you the right path; I’ll guide you on the straight track."
    },
    {
      "verse": "12",
      "text": "Walk it and you won’t trip; step by step, you’ll be safe."
    },
    {
      "verse": "13",
      "text": "Grab wisdom tight; don’t let it go — it’s your life’s main flex."
    },
    {
      "verse": "14",
      "text": "Don’t roll with the wicked; don’t vibe with the shady crowd."
    },
    {
      "verse": "15",
      "text": "Avoid their path; don’t walk where they wander."
    },
    {
      "verse": "16",
      "text": "The wicked can’t chill — they stay up scheming evil, robbed of sleep until someone falls."
    },
    {
      "verse": "17",
      "text": "They live off wickedness and violence; that’s their daily bread and wine."
    },
    {
      "verse": "18",
      "text": "The path of the righteous? Shines brighter and brighter; their grind gets clearer every day."
    },
    {
      "verse": "19",
      "text": "But the wicked? They live in darkness; their path is sketchy and doomed."
    },
    {
      "verse": "20",
      "text": "My kid, pay attention to my words; listen closely to what I say."
    },
    {
      "verse": "21",
      "text": "Don’t let them drift off; keep them in your heart, guard them tight."
    },
    {
      "verse": "22",
      "text": "They’re life for your soul; health for your whole vibe."
    },
    {
      "verse": "23",
      "text": "Above all, guard your heart — it’s the main source of life."
    },
    {
      "verse": "24",
      "text": "Don’t let your mouth slip evil; keep your lips from lying."
    },
    {
      "verse": "25",
      "text": "Eyes forward, straight ahead; watch your path, no side glances."
    },
    {
      "verse": "26",
      "text": "Make level paths for your feet; don’t wobble."
    },
    {
      "verse": "27",
      "text": "Don’t veer left or right; keep moving on the straight track."
    }]},
{
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "My kid, pay attention to my wisdom; lean in to get insight."
    },
    {
      "verse": "2",
      "text": "Guard discretion; keep your lips from shady moves."
    },
    {
      "verse": "3",
      "text": "The lips of the adulterous are honey-sweet, smooth talk."
    },
    {
      "verse": "4",
      "text": "But in the end, they’re bitter as wormwood, sharp like a double-edged sword."
    },
    {
      "verse": "5",
      "text": "Their feet go down to death; their steps run straight to the shades."
    },
    {
      "verse": "6",
      "text": "They don’t even pause to look at the path of life."
    },
    {
      "verse": "7",
      "text": "My kid, listen to me; don’t stray from my words of guidance."
    },
    {
      "verse": "8",
      "text": "Stay clear, don’t wander toward their house."
    },
    {
      "verse": "9",
      "text": "Don’t give your honor to strangers; don’t let your years go to cruel people."
    },
    {
      "verse": "10",
      "text": "Don’t let your cash and grind go to strangers; don’t let your hard work end up in outsiders’ hands."
    },
    {
      "verse": "11",
      "text": "Then you’ll groan when your body and life are wasted,"
    },
    {
      "verse": "12",
      "text": "And you say, “How did I hate instruction? How did I despise correction?”"
    },
    {
      "verse": "13",
      "text": "I didn’t listen to advice; I ignored all warnings."
    },
    {
      "verse": "14",
      "text": "I ended up in the crowd of the foolish, lost in the gang of the wicked."
    },
    {
      "verse": "15",
      "text": "Drink water from your own cistern, fresh water from your own well."
    },
    {
      "verse": "16",
      "text": "Should your fountains be scattered in the streets, streams of your blessing out where they don’t belong?"
    },
    {
      "verse": "17",
      "text": "Let it be only for you; don’t share it with outsiders."
    },
    {
      "verse": "18",
      "text": "Be blessed with the wife of your youth; enjoy her love every day."
    },
    {
      "verse": "19",
      "text": "She’s your charm, your love — never lose sight of her grace."
    },
    {
      "verse": "20",
      "text": "Why be consumed with strangers, the smooth talk of others?"
    },
    {
      "verse": "21",
      "text": "The Lord sees all your ways; He watches every step you take."
    },
    {
      "verse": "22",
      "text": "The wicked are caught by their own sin; they are trapped by the ways of their actions."
    },
    {
      "verse": "23",
      "text": "The consequences of sin? Death, no excuses — the righteous live safe through the fear of God."
    }]},
    {
  "chapter": "6",
  "verses": [
    {
      "verse": "1",
      "text": "My kid, if you co-sign for a friend, you’re basically risking your bag."
    },
    {
      "verse": "2",
      "text": "You’ve trapped yourself; now you’re on the hook."
    },
    {
      "verse": "3",
      "text": "Break free fast — tell them, “Yo, I’m out,” before your wallet gets wrecked."
    },
    {
      "verse": "4",
      "text": "Don’t let them drag you down; save yourself before you fall."
    },
    {
      "verse": "5",
      "text": "Don’t slack, free yourself like a gazelle escaping a trap."
    },
    {
      "verse": "6",
      "text": "Check out the ant, lazybones — no boss, no schedule, still stacking food all summer."
    },
    {
      "verse": "7",
      "text": "They grind hard, no excuses; they prep for tomorrow while you sleep."
    },
    {
      "verse": "8",
      "text": "You should be wise too; stash your moves and prep like the ant."
    },
    {
      "verse": "9",
      "text": "How long will you crash in bed, lazy? When will you actually rise and grind?"
    },
    {
      "verse": "10",
      "text": "A little nap, a little sleep, a little folding of hands to chill —"
    },
    {
      "verse": "11",
      "text": "And boom! Poverty hits you like a hitmarker; want bites, end up broke."
    },
    {
      "verse": "12",
      "text": "A wicked dude? Smooth talker, plotting evil — his words slice deep."
    },
    {
      "verse": "13",
      "text": "He winks, nods, shakes hands, all fake — scheming in silence."
    },
    {
      "verse": "14",
      "text": "He plants trouble everywhere, ready to spark chaos at every turn."
    },
    {
      "verse": "15",
      "text": "Disaster’s coming for him; sudden ruin, no saving."
    },
    {
      "verse": "16",
      "text": "There are six things the Lord hates, seven that He can’t vibe with:"
    },
    {
      "verse": "17",
      "text": "Proud eyes, lying tongue, hands that spill innocent blood,"
    },
    {
      "verse": "18",
      "text": "Heart that plots evil, feet that rush to do wrong,"
    },
    {
      "verse": "19",
      "text": "False witness dropping lies, one who sparks drama between siblings."
    },
    {
      "verse": "20",
      "text": "My kid, keep your father’s command; don’t ghost your mother’s rules."
    },
    {
      "verse": "21",
      "text": "Bind them tight around your neck; carry them wherever you roll."
    },
    {
      "verse": "22",
      "text": "They’ll guide you — wisdom, insight — when the grind gets rough."
    },
    {
      "verse": "23",
      "text": "The command is a lamp; instruction is light; correction is the path to life."
    },
    {
      "verse": "24",
      "text": "They’ll keep you safe from evil moves, protecting your vibe."
    },
    {
      "verse": "25",
      "text": "Don’t cheat on your love, don’t lust after a stranger."
    },
    {
      "verse": "26",
      "text": "For the adultery-seeker? Even the hardest man gets played; they get trapped."
    },
    {
      "verse": "27",
      "text": "Can a fire burn in your lap without roasting your thighs?"
    },
    {
      "verse": "28",
      "text": "Can a wanderer walk on coals and not scorch their feet?"
    },
    {
      "verse": "29",
      "text": "So whoever messes around with another’s spouse ends up burned by their own sin."
    },
    {
      "verse": "30",
      "text": "Thieves? They hate being caught."
    },
    {
      "verse": "31",
      "text": "But if caught, they pay back sevenfold, double the damage."
    },
    {
      "verse": "32",
      "text": "Sleeping with someone else’s spouse? No chill — destroys life, nothing but regret."
    },
    {
      "verse": "33",
      "text": "Wounds and shame hit hard; your reputation gone."
    },
    {
      "verse": "34",
      "text": "Fumes of rage from the betrayed partner, no mercy, no compromise."
    },
    {
      "verse": "35",
      "text": "The one who cheats? They’ll never escape; they’re trapped in their own foolishness."
    }]},
    {
  "chapter": "7",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, guard my words like your ultimate flex; keep my commands locked in your chest."
    },
    {
      "verse": "2",
      "text": "Wear them like a chain around your neck, let them guide every step."
    },
    {
      "verse": "3",
      "text": "They’ll save you from the traps fools lay out for themselves."
    },
    {
      "verse": "4",
      "text": "Tell Wisdom, “You’re my real one; Insight, you’re my squad” — keep her close."
    },
    {
      "verse": "5",
      "text": "They’ll watch over your path, keep you from the schemes of evil."
    },
    {
      "verse": "6",
      "text": "I peeped out my window, late night — streets quiet, but alert."
    },
    {
      "verse": "7",
      "text": "A young man, clueless, heading the wrong way, naive in the game."
    },
    {
      "verse": "8",
      "text": "At the corner, there she was — the woman who’s trouble."
    },
    {
      "verse": "9",
      "text": "He didn’t know; desire blinded him fully."
    },
    {
      "verse": "10",
      "text": "She’s bold, reckless, fully plotting."
    },
    {
      "verse": "11",
      "text": "Up late, looking for someone to snare."
    },
    {
      "verse": "12",
      "text": "Bed ready, fine linens, perfume set — everything prepared."
    },
    {
      "verse": "13",
      "text": "She meets him, moves smooth, eyes on the prize."
    },
    {
      "verse": "14",
      "text": "Words slick, pulling him closer, no hesitation."
    },
    {
      "verse": "15",
      "text": "“I came out to meet you, been seeking your face, and here you are.”"
    },
    {
      "verse": "16",
      "text": "“My bed is ready, linens fresh, perfume on point.”"
    },
    {
      "verse": "17",
      "text": "“Come, let’s enjoy ourselves till morning, let’s go all in.”"
    },
    {
      "verse": "18",
      "text": "“Hubby’s away, long trip, won’t be back soon.”"
    },
    {
      "verse": "19",
      "text": "“No one’s watching; no one will catch us.”"
    },
    {
      "verse": "20",
      "text": "He follows blindly, desire taking the wheel, ignoring danger."
    },
    {
      "verse": "21",
      "text": "Kid, keep your eyes sharp; don’t walk her path."
    },
    {
      "verse": "22",
      "text": "Her house leads down to Sheol, straight to the chambers of death."
    },
    {
      "verse": "23",
      "text": "None who enter her return; her paths destroy."
    },
    {
      "verse": "24",
      "text": "Don’t chase fleeting thrills; avoid her trap."
    },
    {
      "verse": "25",
      "text": "Guard your heart; keep your focus."
    },
    {
      "verse": "26",
      "text": "Don’t get snared by her looks; don’t follow her steps."
    },
    {
      "verse": "27",
      "text": "Her house? The way to Sheol, down to the chambers of death — all who enter it are caught."
    }]},
    {
  "chapter": "8",
  "verses": [
    {
      "verse": "1",
      "text": "Doesn’t wisdom literally call out? And understanding be out here projecting her voice?"
    },
    {
      "verse": "2",
      "text": "She sets up on the highest spots, where everybody passes and nobody can pretend they didn’t hear her."
    },
    {
      "verse": "3",
      "text": "She posts up at city gates and main entrances, calling people out as they walk in."
    },
    {
      "verse": "4",
      "text": "“Yo humanity, I’m talking to all of you — nobody is exempt.”"
    },
    {
      "verse": "5",
      "text": "“If you’re naive, level up. If you lack sense, upgrade your brain.”"
    },
    {
      "verse": "6",
      "text": "“Listen up — I’m dropping straight facts, no confusion.”"
    },
    {
      "verse": "7",
      "text": "“My mouth only speaks truth; no fake, twisted energy allowed.”"
    },
    {
      "verse": "8",
      "text": "“Everything I say is legit and right; nothing is crooked or sketchy.”"
    },
    {
      "verse": "9",
      "text": "“If you’ve got sense, you’ll get it. If your mind is on, it’ll click.”"
    },
    {
      "verse": "10",
      "text": "“Choose my instruction instead of cash, and knowledge over gold — yeah, I said it.”"
    },
    {
      "verse": "11",
      "text": "“Wisdom beats jewels. Anything you hype doesn’t top me.”"
    },
    {
      "verse": "12",
      "text": "“I, wisdom, roll with good judgment. I carry knowledge and strategic thinking.”"
    },
    {
      "verse": "13",
      "text": "“Respect for the LORD means hating evil. I can’t stand pride, arrogance, or shady behavior.”"
    },
    {
      "verse": "14",
      "text": "“I’ve got advice, stability, intelligence, and power — full package.”"
    },
    {
      "verse": "15",
      "text": "“Through me, kings run their kingdoms right.”"
    },
    {
      "verse": "16",
      "text": "“Through me, leaders and rulers make solid laws.”"
    },
    {
      "verse": "17",
      "text": "“I vibe with those who seek me, and those who chase me will definitely find me.”"
    },
    {
      "verse": "18",
      "text": "“Riches and honor hang around me — long-term wealth and the type of success that actually lasts.”"
    },
    {
      "verse": "19",
      "text": "“My rewards beat gold and pure gold; what I bring outshines the best silver.”"
    },
    {
      "verse": "20",
      "text": "“I move on righteous paths and walk in justice that’s actually fair.”"
    },
    {
      "verse": "21",
      "text": "“I bless the ones who stick with me, filling them with real wealth.”"
    },
    {
      "verse": "22",
      "text": "“The LORD made me part of His setup from the very beginning — before everything else existed.”"
    },
    {
      "verse": "23",
      "text": "“I was established before time kicked off, before the world even loaded.”"
    },
    {
      "verse": "24",
      "text": "“Before oceans existed, before springs burst out, I was already here.”"
    },
    {
      "verse": "25",
      "text": "“Before mountains and hills were built up, I was present.”"
    },
    {
      "verse": "26",
      "text": "“Before land, fields, and even the first dust of the earth — I was in the mix.”"
    },
    {
      "verse": "27",
      "text": "“When He set up the sky, I was there. When He drew the horizon over the waters, I was there too.”"
    },
    {
      "verse": "28",
      "text": "“When He established the clouds above and locked the springs deep below…”"
    },
    {
      "verse": "29",
      "text": "“When He gave the sea its boundary so it wouldn’t cross the line, and when He shaped the foundations of the earth…”"
    },
    {
      "verse": "30",
      "text": "“I was right beside Him, like a constant worker, rejoicing with Him every day.”"
    },
    {
      "verse": "31",
      "text": "“I celebrated His whole creation and found joy with the human race.”"
    },
    {
      "verse": "32",
      "text": "“So listen up, children: stay locked in with me and you’ll be blessed.”"
    },
    {
      "verse": "33",
      "text": "“Grab instruction and don’t ignore it — be wise.”"
    },
    {
      "verse": "34",
      "text": "“Blessed is the one who listens to me daily, watching for me like it’s a routine.”"
    },
    {
      "verse": "35",
      "text": "“Whoever finds me finds life and gains favor from the LORD.”"
    },
    {
      "verse": "36",
      "text": "“But whoever ignores me harms themselves — choosing me or rejecting me is literally choosing life or losing it.”"
    }]},
    {
  "chapter": "9",
  "verses": [
    {
      "verse": "1",
      "text": "Wisdom built her house and set up her seven solid pillars."
    },
    {
      "verse": "2",
      "text": "She prepped her food, mixed her drink, and laid out the table like she’s hosting a whole event."
    },
    {
      "verse": "3",
      "text": "She sent out her servants and shouted from the highest spots in the city."
    },
    {
      "verse": "4",
      "text": "“If you’re naive, pull up here.” To the one lacking sense she says,"
    },
    {
      "verse": "5",
      "text": "“Come eat what I’ve prepared and drink what I’ve mixed.”"
    },
    {
      "verse": "6",
      "text": "“Drop the foolish lifestyle and live. Walk in the path that actually makes sense.”"
    },
    {
      "verse": "7",
      "text": "Whoever tries to correct a mocker just ends up catching trouble; calling out a wicked person gets you dragged."
    },
    {
      "verse": "8",
      "text": "Don’t waste correction on a mocker — they’ll just hate you for it. But correct a wise person, and they’ll appreciate it."
    },
    {
      "verse": "9",
      "text": "Teach a wise person and they level up even more. Teach a righteous person and they get even sharper."
    },
    {
      "verse": "10",
      "text": "Respect for the LORD is where wisdom starts, and knowing Him is where real understanding begins."
    },
    {
      "verse": "11",
      "text": "Through wisdom, your days increase and your life gains more weight."
    },
    {
      "verse": "12",
      "text": "If you’re wise, it benefits you. If you’re foolish, you hurt yourself — nobody else takes the fall for your choices."
    },
    {
      "verse": "13",
      "text": "Folly is loud, chaotic, and clueless."
    },
    {
      "verse": "14",
      "text": "She sits at her doorway, chilling on the high places where people walk by."
    },
    {
      "verse": "15",
      "text": "She calls out to the ones passing by minding their business."
    },
    {
      "verse": "16",
      "text": "“If you’re naive, pull up here.” And to the one lacking sense she says,"
    },
    {
      "verse": "17",
      "text": "“Stolen stuff tastes sweet, and secret bread hits different.”"
    },
    {
      "verse": "18",
      "text": "But the person who listens to her doesn’t realize the place she leads to is full of the dead — her guests are in the depths."
    }]},
    {
  "chapter": "10",
  "verses": [
    {
      "verse": "1",
      "text": "A wise child makes their parent proud; a foolish one brings heaviness."
    },
    {
      "verse": "2",
      "text": "Shady money doesn’t help, but doing what’s right saves your life."
    },
    {
      "verse": "3",
      "text": "The LORD won’t let the righteous starve, but He shuts down the cravings of the wicked."
    },
    {
      "verse": "4",
      "text": "Lazy hands make you broke; hardworking hands secure the bag."
    },
    {
      "verse": "5",
      "text": "A wise person works while it’s time; a foolish one wastes the season and brings shame."
    },
    {
      "verse": "6",
      "text": "Blessings land on the righteous, but the wicked’s words hide trouble."
    },
    {
      "verse": "7",
      "text": "The memory of the righteous hits different, but the wicked’s name fades."
    },
    {
      "verse": "8",
      "text": "The wise accept instruction; the foolish talk and trip over their own words."
    },
    {
      "verse": "9",
      "text": "Whoever walks straight is safe; whoever moves shady gets exposed."
    },
    {
      "verse": "10",
      "text": "Winking to deceive causes trouble; foolish talk destroys."
    },
    {
      "verse": "11",
      "text": "The righteous speak life like a fountain; the wicked hide harmful intentions."
    },
    {
      "verse": "12",
      "text": "Hate stirs drama; love shuts drama down."
    },
    {
      "verse": "13",
      "text": "Wisdom sits naturally on the wise, but foolish people get corrected the hard way."
    },
    {
      "verse": "14",
      "text": "The wise store knowledge; the foolish talk too much and get ruined."
    },
    {
      "verse": "15",
      "text": "The wealthy’s resources are their stronghold; poverty crushes the poor."
    },
    {
      "verse": "16",
      "text": "The righteous earn outcomes that lead to life; the wicked chase things that lead to sin."
    },
    {
      "verse": "17",
      "text": "Whoever takes correction stays on the right track; whoever ignores it leads others off it."
    },
    {
      "verse": "18",
      "text": "Hiding hatred and spreading lies both bring trouble; slander is foolish."
    },
    {
      "verse": "19",
      "text": "Too much talking always leads to mistakes; the wise keep their words tight."
    },
    {
      "verse": "20",
      "text": "The words of the righteous are like premium silver; the wicked’s words barely count."
    },
    {
      "verse": "21",
      "text": "The righteous feed many with wisdom; foolish people destroy themselves because they won’t learn."
    },
    {
      "verse": "22",
      "text": "The LORD’s blessing makes you rich, and He doesn’t attach sorrow to it."
    },
    {
      "verse": "23",
      "text": "Foolish people treat evil like entertainment; wise people enjoy doing what’s right."
    },
    {
      "verse": "24",
      "text": "The wicked get the very thing they fear; the righteous receive what they desire."
    },
    {
      "verse": "25",
      "text": "When storms hit, the wicked get swept away; the righteous stay standing."
    },
    {
      "verse": "26",
      "text": "A lazy person is like smoke to the eyes or vinegar to the teeth — just irritating."
    },
    {
      "verse": "27",
      "text": "Respect for the LORD extends your life; wicked living cuts it short."
    },
    {
      "verse": "28",
      "text": "The righteous expect good outcomes; the wicked have hopes that collapse."
    },
    {
      "verse": "29",
      "text": "The LORD’s way is strength for the upright, but ruins those who do evil."
    },
    {
      "verse": "30",
      "text": "The righteous will not be removed; the wicked won’t stay in the land."
    },
    {
      "verse": "31",
      "text": "The mouth of the righteous speaks wisdom; the twisted tongue gets cut off."
    },
    {
      "verse": "32",
      "text": "The righteous know what fits and is good to say; the wicked only speak what’s off."
    }]},
    {
  "chapter": "11",
  "verses": [
    {
      "verse": "1",
      "text": "Fake scales disgust the LORD, but accurate weights make Him pleased."
    },
    {
      "verse": "2",
      "text": "When pride shows up, disgrace follows; humility brings wisdom."
    },
    {
      "verse": "3",
      "text": "The integrity of the upright guides them; the unfaithful get ruined by their own crookedness."
    },
    {
      "verse": "4",
      "text": "Riches can’t save you on the day of judgment, but doing what’s right delivers you."
    },
    {
      "verse": "5",
      "text": "The righteousness of the upright clears their path; the wicked fall because of their own wickedness."
    },
    {
      "verse": "6",
      "text": "Doing right saves the honest; the unfaithful get trapped by their own desires."
    },
    {
      "verse": "7",
      "text": "When the wicked die, their expectations collapse; their hopes vanish instantly."
    },
    {
      "verse": "8",
      "text": "The righteous get rescued from trouble, and the wicked take the hit instead."
    },
    {
      "verse": "9",
      "text": "A hypocrite destroys others with their words, but the righteous escape through knowledge."
    },
    {
      "verse": "10",
      "text": "When the righteous thrive, a city celebrates; when the wicked fall, there’s relief."
    },
    {
      "verse": "11",
      "text": "Upright people lift a city up; wicked mouths tear it down."
    },
    {
      "verse": "12",
      "text": "Anyone who lacks sense insults their neighbor; the wise stay quiet."
    },
    {
      "verse": "13",
      "text": "A gossip leaks secrets; a trustworthy person keeps things covered."
    },
    {
      "verse": "14",
      "text": "Without guidance, a community collapses; with many wise voices, there’s safety."
    },
    {
      "verse": "15",
      "text": "Putting yourself on the line for someone recklessly leads to trouble; refusing that stays safe."
    },
    {
      "verse": "16",
      "text": "A gracious person gains honor; violent people gain only empty wins."
    },
    {
      "verse": "17",
      "text": "A kind person benefits themselves; a cruel person harms their own life."
    },
    {
      "verse": "18",
      "text": "The wicked earn deceptive results; the one who does right gets a real reward."
    },
    {
      "verse": "19",
      "text": "Living rightly leads to life; chasing evil leads to death."
    },
    {
      "verse": "20",
      "text": "Those with twisted hearts disgust the LORD; those who walk straight bring Him delight."
    },
    {
      "verse": "21",
      "text": "Count on this: evil will not go unpunished, but the children of the righteous will be delivered."
    },
    {
      "verse": "22",
      "text": "Beauty without discretion is like a gold ring in a pig’s snout."
    },
    {
      "verse": "23",
      "text": "The desires of the righteous aim toward good; the expectations of the wicked end in anger."
    },
    {
      "verse": "24",
      "text": "One person gives freely and ends up with more; another hoards and becomes poorer."
    },
    {
      "verse": "25",
      "text": "The generous become refreshed; those who refresh others get refreshed themselves."
    },
    {
      "verse": "26",
      "text": "People curse those who hoard grain, but bless the one who sells it openly."
    },
    {
      "verse": "27",
      "text": "Whoever seeks good finds favor; whoever looks for trouble gets it."
    },
    {
      "verse": "28",
      "text": "Those who trust in wealth fall; the righteous flourish like healthy leaves."
    },
    {
      "verse": "29",
      "text": "Whoever brings disturbance on their household inherits nothing; the foolish end up serving the wise."
    },
    {
      "verse": "30",
      "text": "The fruit of the righteous is life-giving, and the one who wins souls is wise."
    },
    {
      "verse": "31",
      "text": "If the righteous receive consequences on earth, the wicked and the sinner will definitely face theirs."
    }]},
    {
  "chapter": "12",
  "verses": [
    {
      "verse": "1",
      "text": "Loving correction makes you wise; ignoring it is straight-up foolish."
    },
    {
      "verse": "2",
      "text": "The LORD blesses people who do right, but He smashes the plans of the schemers."
    },
    {
      "verse": "3",
      "text": "No one standing crooked will last; the upright stay solid."
    },
    {
      "verse": "4",
      "text": "A good wife? She’s a crown on her husband. A worthless one? Straight chaos."
    },
    {
      "verse": "5",
      "text": "The plans of the righteous are solid; the advice of the wicked? Pure nonsense."
    },
    {
      "verse": "6",
      "text": "The words of the wicked are traps; the speech of the upright saves."
    },
    {
      "verse": "7",
      "text": "The wicked get cut off and gone; the righteous stick around like solid roots."
    },
    {
      "verse": "8",
      "text": "A wise person’s heart keeps them alive; a fool gets destroyed by their own vibes."
    },
    {
      "verse": "9",
      "text": "Laziness makes you wish you had clothes; hard work makes you rich."
    },
    {
      "verse": "10",
      "text": "The righteous care for animals; the wicked are straight-up cruel."
    },
    {
      "verse": "11",
      "text": "Working the land pays off; just sitting around dreaming gets you nothing."
    },
    {
      "verse": "12",
      "text": "The wicked chase the sinful crowd; the upright chase truth."
    },
    {
      "verse": "13",
      "text": "Bad talk leads to trouble; righteous speech saves."
    },
    {
      "verse": "14",
      "text": "Words can feed you good things; life is in the words of the wise."
    },
    {
      "verse": "15",
      "text": "Fools think they’re always right; the wise listen before moving."
    },
    {
      "verse": "16",
      "text": "Fools get hot-headed; the prudent stay calm."
    },
    {
      "verse": "17",
      "text": "Honest people speak the truth; liars spread chaos."
    },
    {
      "verse": "18",
      "text": "Reckless words can slice like swords; the wise speak carefully."
    },
    {
      "verse": "19",
      "text": "Truthful lips last forever; lying lips are just temporary."
    },
    {
      "verse": "20",
      "text": "The wicked are trapped by their own evil; the upright enjoy security."
    },
    {
      "verse": "21",
      "text": "Trouble sticks to the wicked; blessings hug the righteous."
    },
    {
      "verse": "22",
      "text": "Lying lips? Total disgust to the LORD; honest talk? Full delight."
    },
    {
      "verse": "23",
      "text": "Clever people hide what they know; fools shout out what they shouldn’t."
    },
    {
      "verse": "24",
      "text": "Hardworking hands rule; lazy ones get dragged."
    },
    {
      "verse": "25",
      "text": "Worries weigh people down; kind words lift them up."
    },
    {
      "verse": "26",
      "text": "True friends guide the righteous; the wicked get dragged by false friends."
    },
    {
      "verse": "27",
      "text": "Laziness rots your plans; energy brings profit."
    },
    {
      "verse": "28",
      "text": "Righteousness leads straight to life; wickedness is a dead-end street."
    }]},
    {
  "chapter": "13",
  "verses": [
    {
      "verse": "1",
      "text": "A wise kid listens to correction; a fool ignores it and keeps messing up."
    },
    {
      "verse": "2",
      "text": "Good words bring life; bad talk pulls people down."
    },
    {
      "verse": "3",
      "text": "Guard your mouth and stay safe; careless words get you in trouble."
    },
    {
      "verse": "4",
      "text": "Lazy people want big things but get nothing; the hardworking always get results."
    },
    {
      "verse": "5",
      "text": "The righteous avoid drama; the wicked are full of shady vibes."
    },
    {
      "verse": "6",
      "text": "Righteousness protects; wickedness sets traps."
    },
    {
      "verse": "7",
      "text": "Some pretend to be rich but got nothing; the wise know their real value."
    },
    {
      "verse": "8",
      "text": "Wealth can save lives, but the poor’s hope dies fast."
    },
    {
      "verse": "9",
      "text": "Honest light shines bright; the wicked’s lamp goes out."
    },
    {
      "verse": "10",
      "text": "Pride sparks fights; wisdom comes with humility."
    },
    {
      "verse": "11",
      "text": "Quick riches vanish; hard-earned wealth grows."
    },
    {
      "verse": "12",
      "text": "Hope delayed hurts, but fulfilled desires are sweet."
    },
    {
      "verse": "13",
      "text": "Ignoring correction brings destruction; accepting advice is life."
    },
    {
      "verse": "14",
      "text": "Wise people live on knowledge; fools get snared by stupidity."
    },
    {
      "verse": "15",
      "text": "Good sense leads to life; fools go the wrong way."
    },
    {
      "verse": "16",
      "text": "Every move has consequences; fools act without thinking."
    },
    {
      "verse": "17",
      "text": "Bad messengers get caught in trouble; trustworthy ones deliver safely."
    },
    {
      "verse": "18",
      "text": "Poverty hits those who ignore correction; listening to instruction brings honor."
    },
    {
      "verse": "19",
      "text": "Longing fulfilled is sweet to the soul; fools chase temporary thrills."
    },
    {
      "verse": "20",
      "text": "Walk with wise people and level up; hang with fools and fall."
    },
    {
      "verse": "21",
      "text": "Trouble chases the wicked; blessings hug the righteous."
    },
    {
      "verse": "22",
      "text": "Good people leave inheritances for their fam; the sinner’s wealth disappears."
    },
    {
      "verse": "23",
      "text": "Fodder feeds the poor; foolish talk can ruin your plans."
    },
    {
      "verse": "24",
      "text": "Discipline is love for your kids; ignoring them is hate."
    },
    {
      "verse": "25",
      "text": "The righteous are satisfied with good; the wicked crave trouble."
    }]},
    {
  "chapter": "14",
  "verses": [
    {
      "verse": "1",
      "text": "A wise woman builds her house; a foolish one tears it down herself."
    },
    {
      "verse": "2",
      "text": "Walking right pleases the LORD; following shady paths makes Him annoyed."
    },
    {
      "verse": "3",
      "text": "Fools talk too much and annoy everyone; the wise hold back words."
    },
    {
      "verse": "4",
      "text": "Lazy hands make chaos; hard work keeps things in order."
    },
    {
      "verse": "5",
      "text": "Honest witnesses speak truth; liars deceive."
    },
    {
      "verse": "6",
      "text": "Fools think they know everything; the wise ask and learn."
    },
    {
      "verse": "7",
      "text": "Step back from drama; fools get caught in it."
    },
    {
      "verse": "8",
      "text": "The wise value knowledge; fools get destroyed by stupidity."
    },
    {
      "verse": "9",
      "text": "Fools laugh at sin; wise people take it seriously."
    },
    {
      "verse": "10",
      "text": "The heart carries its own pain; words can’t always fix it."
    },
    {
      "verse": "11",
      "text": "The LORD destroys the wicked’s home; He supports the righteous."
    },
    {
      "verse": "12",
      "text": "Some roads seem right but lead to death; check your steps."
    },
    {
      "verse": "13",
      "text": "Laugh now, cry later; joy ignored can turn to pain."
    },
    {
      "verse": "14",
      "text": "Living right satisfies the soul; chasing evil destroys it."
    },
    {
      "verse": "15",
      "text": "Simple people believe everything; the prudent test everything."
    },
    {
      "verse": "16",
      "text": "Wise people fear and plan; fools are reckless."
    },
    {
      "verse": "17",
      "text": "Quick anger leads to trouble; patience saves."
    },
    {
      "verse": "18",
      "text": "Fools get caught by their own mistakes; knowledge protects."
    },
    {
      "verse": "19",
      "text": "Evil people bow to good; the upright stand strong."
    },
    {
      "verse": "20",
      "text": "Poor people struggle with friends; rich have lots, but God remains the ultimate helper."
    },
    {
      "verse": "21",
      "text": "Treating others badly hurts you; showing kindness pays back."
    },
    {
      "verse": "22",
      "text": "People plan evil but fail; wise plans succeed."
    },
    {
      "verse": "23",
      "text": "Hard work brings profit; idle talk brings poverty."
    },
    {
      "verse": "24",
      "text": "The wise build their houses with knowledge; fools destroy theirs with folly."
    },
    {
      "verse": "25",
      "text": "Truth rescues; lying words trap."
    },
    {
      "verse": "26",
      "text": "Fear of the LORD keeps you safe; trusting yourself blindly is risky."
    },
    {
      "verse": "27",
      "text": "Fear of the LORD gives life; lazy people face hunger."
    },
    {
      "verse": "28",
      "text": "The righteous have lasting hope; the wicked fade."
    },
    {
      "verse": "29",
      "text": "Patient people calm fights; hotheads stir them up."
    },
    {
      "verse": "30",
      "text": "Health and peace keep life strong; fools ruin theirs."
    },
    {
      "verse": "31",
      "text": "Oppressing the poor is disrespecting God; helping them honors Him."
    },
    {
      "verse": "32",
      "text": "The wicked fall into traps; the righteous rise above."
    },
    {
      "verse": "33",
      "text": "Wisdom is deep in hearts; fools can’t reach it."
    },
    {
      "verse": "34",
      "text": "Righteousness brings glory; sin shames."
    },
    {
      "verse": "35",
      "text": "Honest rulers bless their people; wicked rulers curse."
    }]},
    {
  "chapter": "15",
  "verses": [
    {
      "verse": "1",
      "text": "Chill words calm fights; harsh words just stir drama."
    },
    {
      "verse": "2",
      "text": "Honest talk feeds the soul; lying lips destroy it."
    },
    {
      "verse": "3",
      "text": "The LORD sees everything, everywhere—nothing hides from Him."
    },
    {
      "verse": "4",
      "text": "Gentle words bring life; foolish words crush spirits."
    },
    {
      "verse": "5",
      "text": "Rejecting correction makes fools; taking advice makes you wise."
    },
    {
      "verse": "6",
      "text": "Wealth can fill a house, but the LORD’s favor fills it better."
    },
    {
      "verse": "7",
      "text": "The wise speak knowledge; fools spout nonsense."
    },
    {
      "verse": "8",
      "text": "The LORD hates fake offerings; He loves what’s right."
    },
    {
      "verse": "9",
      "text": "The wicked hate Him; those who follow Him love Him."
    },
    {
      "verse": "10",
      "text": "Harsh discipline comes to those who ignore correction; avoiding it hurts you."
    },
    {
      "verse": "11",
      "text": "Sheol and Abaddon are exposed before the LORD; He knows everything, even the hidden realms."
    },
    {
      "verse": "12",
      "text": "Fools hate advice; the wise accept correction."
    },
    {
      "verse": "13",
      "text": "Joy lights up the face; sadness crushes the spirit."
    },
    {
      "verse": "14",
      "text": "Fools think understanding is impossible; the wise value knowledge."
    },
    {
      "verse": "15",
      "text": "A simple life looks good to the upright; fools complain constantly."
    },
    {
      "verse": "16",
      "text": "Better little with the LORD than lots without Him."
    },
    {
      "verse": "17",
      "text": "It’s better to eat veggies in peace than feast with drama."
    },
    {
      "verse": "18",
      "text": "Quick tempers start fights; patience stops them."
    },
    {
      "verse": "19",
      "text": "Lazy people struggle; hard workers get results."
    },
    {
      "verse": "20",
      "text": "Wise friends lift you up; fools drag you down."
    },
    {
      "verse": "21",
      "text": "Acting dumb keeps people in trouble; planning wisely saves you."
    },
    {
      "verse": "22",
      "text": "Plans succeed with advice; going solo often fails."
    },
    {
      "verse": "23",
      "text": "Right words at the right time are pure gold; fools talk and trip."
    },
    {
      "verse": "24",
      "text": "The path of life goes up; it leads away from death."
    },
    {
      "verse": "25",
      "text": "The LORD lifts the humble; He brings down the proud."
    },
    {
      "verse": "26",
      "text": "Wicked people hate good; honest people love truth."
    },
    {
      "verse": "27",
      "text": "Greedy people hate the poor; generous hearts get blessings."
    },
    {
      "verse": "28",
      "text": "Patient people think first; fools explode."
    },
    {
      "verse": "29",
      "text": "The LORD listens to those who care; stubborn people get ignored."
    },
    {
      "verse": "30",
      "text": "A happy heart gives health to the body; a sad heart drains it."
    },
    {
      "verse": "31",
      "text": "The LORD listens to the faithful and punishes the proud."
    },
    {
      "verse": "32",
      "text": "Accepting correction grows life; ignoring it brings harm."
    },
    {
      "verse": "33",
      "text": "Respecting the LORD teaches wisdom; pride leads to shame."
    }]},
    {
  "chapter": "16",
  "verses": [
    {
      "verse": "1",
      "text": "People plan their moves, but the LORD decides how it all goes down."
    },
    {
      "verse": "2",
      "text": "We can think we’re pure, but the LORD checks our motives."
    },
    {
      "verse": "3",
      "text": "Commit your plans to the LORD, and He makes them succeed."
    },
    {
      "verse": "4",
      "text": "The LORD has set everything up, even the wicked, for His purposes."
    },
    {
      "verse": "5",
      "text": "Pride turns into trouble; the LORD despises arrogant vibes."
    },
    {
      "verse": "6",
      "text": "Love and loyalty cancel out sins; respecting the LORD is key."
    },
    {
      "verse": "7",
      "text": "When people follow God, He sets their steps straight—even enemies chill."
    },
    {
      "verse": "8",
      "text": "A little done right is better than huge gains through cheating."
    },
    {
      "verse": "9",
      "text": "People can make plans in their hearts, but the LORD guides the steps."
    },
    {
      "verse": "10",
      "text": "Kings speak judgment; wise rulers weigh every word."
    },
    {
      "verse": "11",
      "text": "Honest scales and balances are God’s standard; He sees every transaction."
    },
    {
      "verse": "12",
      "text": "It’s wrong to love evil; God loves justice and honesty."
    },
    {
      "verse": "13",
      "text": "The right words from a ruler bring joy; dishonest talk brings anger."
    },
    {
      "verse": "14",
      "text": "Anger of the king is scary; wise people know how to cool it."
    },
    {
      "verse": "15",
      "text": "A king’s favor is like sunshine—brightens your path; his wrath is stormy."
    },
    {
      "verse": "16",
      "text": "Wisdom is more valuable than gold; understanding is better than silver."
    },
    {
      "verse": "17",
      "text": "The path of the upright keeps you safe; the one who strays gets caught."
    },
    {
      "verse": "18",
      "text": "Pride leads to a fall; humility leads to honor."
    },
    {
      "verse": "19",
      "text": "It’s better to live humble with others than fight for power with fools."
    },
    {
      "verse": "20",
      "text": "Paying attention to words brings success; trusting the wrong lips can fail you."
    },
    {
      "verse": "21",
      "text": "Wise hearts bring understanding; clever mouths multiply learning."
    },
    {
      "verse": "22",
      "text": "Knowledge brings life to those who have it; foolishness destroys fools."
    },
    {
      "verse": "23",
      "text": "Wise people speak right; fools’ mouths bring trouble."
    },
    {
      "verse": "24",
      "text": "Kind words are like honey—sweet, healing, and good for the soul."
    },
    {
      "verse": "25",
      "text": "Some paths look easy but lead to death; check the way you choose."
    },
    {
      "verse": "26",
      "text": "Work tires the body, but the soul gains from effort."
    },
    {
      "verse": "27",
      "text": "Evil people plot trouble; violent ones spread chaos."
    },
    {
      "verse": "28",
      "text": "Gossip and lies stir fights; truth brings peace."
    },
    {
      "verse": "29",
      "text": "A violent person gets trapped; a wise peacemaker avoids it."
    },
    {
      "verse": "30",
      "text": "Even blind people avoid disaster if they have sense; fools stumble all the way."
    },
    {
      "verse": "31",
      "text": "Gray hair is a crown of glory; it’s found on the path of righteousness."
    },
    {
      "verse": "32",
      "text": "Patience beats pride; controlling your spirit wins over taking cities."
    },
    {
      "verse": "33",
      "text": "The lot is cast, but the LORD decides every outcome."
    }]},
    {
  "chapter": "17",
  "verses": [
    {
      "verse": "1",
      "text": "Living simple with peace is better than a feast full of drama."
    },
    {
      "verse": "2",
      "text": "Honest words from a servant are more valuable than lies from a fool."
    },
    {
      "verse": "3",
      "text": "Testing metals shows their quality; testing people shows their hearts."
    },
    {
      "verse": "4",
      "text": "Wicked people love drama; the honest care about truth."
    },
    {
      "verse": "5",
      "text": "Mocking the poor is shameful; honoring the humble brings respect."
    },
    {
      "verse": "6",
      "text": "Grandkids are like a crown for grandparents; kids are the pride of parents."
    },
    {
      "verse": "7",
      "text": "Wise words suit a wise person; fools don’t get good advice."
    },
    {
      "verse": "8",
      "text": "Bribes can make a fool do wrong; honesty brings justice."
    },
    {
      "verse": "9",
      "text": "Forgiving wipes out offenses; repeating them ruins friendships."
    },
    {
      "verse": "10",
      "text": "Angry words hit harder than punishment; a sharp tongue hurts."
    },
    {
      "verse": "11",
      "text": "Evil people chase trouble; disaster finds them like a magnet."
    },
    {
      "verse": "12",
      "text": "Crossing a fool is like grabbing a mad bear by the paws—pure danger."
    },
    {
      "verse": "13",
      "text": "The wicked repay evil for good; fools destroy themselves that way."
    },
    {
      "verse": "14",
      "text": "The start of a quarrel is like a broken dam; stop before chaos floods in."
    },
    {
      "verse": "15",
      "text": "Wrong judgment makes everyone happy except justice; right judgment protects."
    },
    {
      "verse": "16",
      "text": "Fools think they’re clever; the wise plan and think ahead."
    },
    {
      "verse": "17",
      "text": "Loyal friends stick through thick and thin; fair-weather friends vanish."
    },
    {
      "verse": "18",
      "text": "Fools act reckless and pay the price; wisdom slows the steps."
    },
    {
      "verse": "19",
      "text": "Fighting with friends breaks bonds; patience keeps relationships strong."
    },
    {
      "verse": "20",
      "text": "A twisted heart brings disaster; the mouth of the wise brings healing."
    },
    {
      "verse": "21",
      "text": "Fools are trapped by their own choices; the upright avoid harm."
    },
    {
      "verse": "22",
      "text": "A joyful heart is good medicine; a crushed spirit dries up the bones."
    },
    {
      "verse": "23",
      "text": "The wicked hide bribes to do evil; the righteous live honestly."
    },
    {
      "verse": "24",
      "text": "Wisdom crowns the wise; fools wander in the dark."
    },
    {
      "verse": "25",
      "text": "Children’s folly can bring grief; careful parenting brings respect."
    },
    {
      "verse": "26",
      "text": "Even rulers are judged by their actions; justice applies to all."
    },
    {
      "verse": "27",
      "text": "Quiet people are thoughtful; fools speak before thinking."
    },
    {
      "verse": "28",
      "text": "Even fools seem smart if they stay calm; controlling yourself beats chaos."
    }]},
    {
  "chapter": "18",
  "verses": [
    {
      "verse": "1",
      "text": "Doing your own thing without friends is selfish; seeking company wisely brings success."
    },
    {
      "verse": "2",
      "text": "Fools chase only their own vibes; the wise listen for insight."
    },
    {
      "verse": "3",
      "text": "Wicked people throw chaos everywhere; fools get caught in it."
    },
    {
      "verse": "4",
      "text": "Words from the mouth are like deep waters; wisdom is like a flowing river."
    },
    {
      "verse": "5",
      "text": "Doing wrong for justice is fake; the upright judge fairly."
    },
    {
      "verse": "6",
      "text": "Foolish talk brings fights; careless words stir drama."
    },
    {
      "verse": "7",
      "text": "Fools’ mouths ruin them; they can’t control what comes out."
    },
    {
      "verse": "8",
      "text": "Gossip is like tasty snacks that go straight to the bones—hard to resist but dangerous."
    },
    {
      "verse": "9",
      "text": "Lazy people make life crooked; careful people walk straight."
    },
    {
      "verse": "10",
      "text": "The LORD’s name is like a strong fortress; righteous run into it and are safe."
    },
    {
      "verse": "11",
      "text": "Wealth can feel like a tower, giving confidence; only the LORD keeps you truly safe."
    },
    {
      "verse": "12",
      "text": "Pride comes before disaster; humility comes before honor."
    },
    {
      "verse": "13",
      "text": "Fools answer before hearing; smart people listen first."
    },
    {
      "verse": "14",
      "text": "The spirit may feel crushed, but a strong heart keeps going; sickness drags down the body."
    },
    {
      "verse": "15",
      "text": "Fools think they know everything; the wise gather knowledge."
    },
    {
      "verse": "16",
      "text": "Planning with money opens doors; cleverness wins respect."
    },
    {
      "verse": "17",
      "text": "First to speak seems right, until arguments reveal the truth."
    },
    {
      "verse": "18",
      "text": "Casting lots settles disputes; decisions come from the LORD."
    },
    {
      "verse": "19",
      "text": "Friend fights are tough to fix; loyalty keeps bonds strong."
    },
    {
      "verse": "20",
      "text": "Words are powerful; what you say can satisfy or destroy."
    },
    {
      "verse": "21",
      "text": "Death and life are in the tongue; choosing wisely changes everything."
    },
    {
      "verse": "22",
      "text": "Finding a good spouse brings joy; it’s a blessing from the LORD."
    },
    {
      "verse": "23",
      "text": "The poor beg for favors; the rich give generously."
    },
    {
      "verse": "24",
      "text": "Friends come and go; a true friend sticks closer than family."
    }]},
    {
  "chapter": "19",
  "verses": [
    {
      "verse": "1",
      "text": "Life’s simple and honest is better than being rich and shady."
    },
    {
      "verse": "2",
      "text": "Loyalty matters more than money; disloyal people cause drama."
    },
    {
      "verse": "3",
      "text": "Fools ruin themselves with their own mistakes; their sin bites back."
    },
    {
      "verse": "4",
      "text": "Riches attract friends; poverty drives them away."
    },
    {
      "verse": "5",
      "text": "False witnesses bring trouble; liars get caught."
    },
    {
      "verse": "6",
      "text": "Lazy people beg and struggle; the diligent earn their way."
    },
    {
      "verse": "7",
      "text": "Poor relatives may ignore you; rich ones can demand favors."
    },
    {
      "verse": "8",
      "text": "Listening to advice makes you smarter; ignoring correction hurts you."
    },
    {
      "verse": "9",
      "text": "False witnesses fail; the truthful can always stand."
    },
    {
      "verse": "10",
      "text": "Luxury isn’t worth a fool’s companionship; character matters more."
    },
    {
      "verse": "11",
      "text": "Wisdom gives patience; fools explode and cause fights."
    },
    {
      "verse": "12",
      "text": "A king’s anger is scary; a wise person calms things down."
    },
    {
      "verse": "13",
      "text": "Children who misbehave are like disaster; discipline saves them."
    },
    {
      "verse": "14",
      "text": "A home and wealth are inherited from the LORD; a wise spouse is a true blessing."
    },
    {
      "verse": "15",
      "text": "Laziness makes you hungry; hard work fills your plate."
    },
    {
      "verse": "16",
      "text": "Following God’s commands keeps you alive; ignoring them brings death."
    },
    {
      "verse": "17",
      "text": "Helping the poor is like lending to the LORD; He rewards generosity."
    },
    {
      "verse": "18",
      "text": "Using discipline on your kid prevents disaster later."
    },
    {
      "verse": "19",
      "text": "Punishment seems harsh but saves from future trouble."
    },
    {
      "verse": "20",
      "text": "Listen to advice and plan; fools don’t, and they fall."
    },
    {
      "verse": "21",
      "text": "People plan, but the LORD decides the outcome."
    },
    {
      "verse": "22",
      "text": "Loyal hearts make life sweet; cheating hearts destroy."
    },
    {
      "verse": "23",
      "text": "Respecting the LORD keeps you safe; ignoring Him brings danger."
    },
    {
      "verse": "24",
      "text": "Lazy people walk crooked paths; diligence keeps you straight."
    },
    {
      "verse": "25",
      "text": "Anger of a king is like danger from a lion; patience saves you."
    },
    {
      "verse": "26",
      "text": "Punishing the wicked keeps the upright safe; fools create chaos."
    },
    {
      "verse": "27",
      "text": "Kids, don’t ignore correction; wisdom protects you."
    },
    {
      "verse": "28",
      "text": "Honest witnesses preserve truth; liars cause chaos."
    },
    {
      "verse": "29",
      "text": "Punishment is prepared for the proud; humility protects you."
    }]},
    {
  "chapter": "20",
  "verses": [
    {
      "verse": "1",
      "text": "Wine can make you wild; fools get extra reckless—self-control matters."
    },
    {
      "verse": "2",
      "text": "The king’s authority is scary; fools mess with it at their own risk."
    },
    {
      "verse": "3",
      "text": "Avoid fights; they make you look dumb and waste time."
    },
    {
      "verse": "4",
      "text": "Lazy people struggle in harvest; the diligent get fed."
    },
    {
      "verse": "5",
      "text": "True wisdom is deep; fools spill what they barely know."
    },
    {
      "verse": "6",
      "text": "Many claim loyalty; the real ones show it."
    },
    {
      "verse": "7",
      "text": "Walking straight keeps your family safe; integrity matters."
    },
    {
      "verse": "8",
      "text": "Kings judge with justice; their eyes see everything."
    },
    {
      "verse": "9",
      "text": "People may think they’re clean, but the LORD checks motives."
    },
    {
      "verse": "10",
      "text": "Fake scales and weights are trash; honesty is God-approved."
    },
    {
      "verse": "11",
      "text": "Kids can show their character early; their actions reveal them."
    },
    {
      "verse": "12",
      "text": "The LORD knows the heart; human eyes can’t catch everything."
    },
    {
      "verse": "13",
      "text": "Don’t love sleep too much; lazy hands get nothing."
    },
    {
      "verse": "14",
      "text": "Dishonest bargains look good at first; greed bites back."
    },
    {
      "verse": "15",
      "text": "Precious treasure is in wise words; fools ignore the value."
    },
    {
      "verse": "16",
      "text": "Testing someone with promises traps them; cleverness protects you."
    },
    {
      "verse": "17",
      "text": "Food eaten too soon tastes sweet but leaves regret; patience wins."
    },
    {
      "verse": "18",
      "text": "Make plans and get advice; rushing leads to mistakes."
    },
    {
      "verse": "19",
      "text": "Gossip spreads fast; fools get caught in it."
    },
    {
      "verse": "20",
      "text": "Curses cling to careless words; wise lips save."
    },
    {
      "verse": "21",
      "text": "Plans may look good, but the LORD decides the result."
    },
    {
      "verse": "22",
      "text": "Don’t envy the wicked; the LORD blesses the upright."
    },
    {
      "verse": "23",
      "text": "The LORD hates fake scales; He delights in honest dealings."
    },
    {
      "verse": "24",
      "text": "Humans may plan, but the LORD guides every step."
    },
    {
      "verse": "25",
      "text": "Vows made rashly can trap you; think before speaking."
    },
    {
      "verse": "26",
      "text": "The king’s wrath is fierce; wise people calm things."
    },
    {
      "verse": "27",
      "text": "The LORD’s spirit gives life; ignoring Him destroys."
    },
    {
      "verse": "28",
      "text": "Loyal hearts guide life; cheating hearts ruin."
    },
    {
      "verse": "29",
      "text": "Courage and strength are gifts from the LORD; He rewards effort."
    },
    {
      "verse": "30",
      "text": "Punishment for wrongs is prepared; God’s justice never fails."
    }]},
    {
  "chapter": "21",
  "verses": [
    {
      "verse": "1",
      "text": "The king’s heart is like a river in God’s hand; He directs it wherever He wants."
    },
    {
      "verse": "2",
      "text": "People may think their own ways are right, but the LORD checks their hearts."
    },
    {
      "verse": "3",
      "text": "Doing what’s right pleases God more than flashy rituals."
    },
    {
      "verse": "4",
      "text": "Pride and haughty eyes? God can’t stand them."
    },
    {
      "verse": "5",
      "text": "Plans made carefully bring wealth; rushing gets you nowhere."
    },
    {
      "verse": "6",
      "text": "Greedy schemes vanish; honest work builds real gains."
    },
    {
      "verse": "7",
      "text": "The wicked trap themselves; their own choices hurt them."
    },
    {
      "verse": "8",
      "text": "Running from evil seems risky, but the upright stay safe."
    },
    {
      "verse": "9",
      "text": "Living at peace is better than squabbling in a crooked home."
    },
    {
      "verse": "10",
      "text": "God hates evil hearts; He loves those who are loyal."
    },
    {
      "verse": "11",
      "text": "Correcting a fool hits harder than a slap; they learn the hard way."
    },
    {
      "verse": "12",
      "text": "God sees the wicked plotting; He’s ready to execute justice."
    },
    {
      "verse": "13",
      "text": "Ignoring the poor? They cry out, and God hears."
    },
    {
      "verse": "14",
      "text": "Wise counsel in secret keeps trouble away; clever plans prevent fights."
    },
    {
      "verse": "15",
      "text": "Justice and fairness bring joy; fools get destroyed by lies."
    },
    {
      "verse": "16",
      "text": "Fools zig when they should zag; the wise choose their path."
    },
    {
      "verse": "17",
      "text": "Loving fun too much drains life; following the LORD keeps it full."
    },
    {
      "verse": "18",
      "text": "The wicked trap themselves; their evil plans backfire."
    },
    {
      "verse": "19",
      "text": "Fighting with friends splits homes; patience preserves bonds."
    },
    {
      "verse": "20",
      "text": "The rich may have provisions; the wise treasure understanding."
    },
    {
      "verse": "21",
      "text": "Following God = straight path; chasing wild schemes = trap."
    },
    {
      "verse": "22",
      "text": "Courageous hearts bring victory; fools brag and get wrecked."
    },
    {
      "verse": "23",
      "text": "Guard your mouth; speaking wisely keeps you safe."
    },
    {
      "verse": "24",
      "text": "Hotheads get crushed; patience brings success."
    },
    {
      "verse": "25",
      "text": "Laziness starves the soul; diligent work satisfies."
    },
    {
      "verse": "26",
      "text": "Kings judge with fairness; fools ignore justice."
    },
    {
      "verse": "27",
      "text": "Making promises? Keep them; rash vows trap you."
    },
    {
      "verse": "28",
      "text": "God watches everything; nothing hidden escapes Him."
    },
    {
      "verse": "29",
      "text": "Bragging fools are exposed; the humble walk strong."
    },
    {
      "verse": "30",
      "text": "Doing right brings honor; wicked moves lead to collapse."
    }]},
    {
  "chapter": "22",
  "verses": [
    {
      "verse": "1",
      "text": "A good name is more valuable than tons of cash; respect > flex."
    },
    {
      "verse": "2",
      "text": "Wealth may bring power, but God’s favor matters most."
    },
    {
      "verse": "3",
      "text": "Wise people see danger and dodge it; fools stumble and crash."
    },
    {
      "verse": "4",
      "text": "Humility + respect for God = long life, wealth, and honor."
    },
    {
      "verse": "5",
      "text": "Walking in wicked ways = disaster; staying righteous protects you."
    },
    {
      "verse": "6",
      "text": "Train your kids right; they’ll keep it real even when grown."
    },
    {
      "verse": "7",
      "text": "The rich rule the poor; debt can trap you."
    },
    {
      "verse": "8",
      "text": "The person sowing evil reaps trouble; the LORD knows the deal."
    },
    {
      "verse": "9",
      "text": "Being generous = blessed by God; selfish hearts get nothing."
    },
    {
      "verse": "10",
      "text": "Remove the mocker; quarrels end, peace stays."
    },
    {
      "verse": "11",
      "text": "Loving God keeps your eyes focused; life gets guided."
    },
    {
      "verse": "12",
      "text": "Listening to wise words = life; ignoring advice = harm."
    },
    {
      "verse": "13",
      "text": "Lazy people complain all day; work brings reward."
    },
    {
      "verse": "14",
      "text": "The lazy hide from work like a snake in the grass; nothing good comes."
    },
    {
      "verse": "15",
      "text": "Foolishness sticks in a kid’s heart; discipline wipes it out."
    },
    {
      "verse": "16",
      "text": "Wronged people may get cursed; God judges fairness."
    },
    {
      "verse": "17",
      "text": "Pay attention to advice; your ear will grab knowledge."
    },
    {
      "verse": "18",
      "text": "Saving wise words = life; fools ignore them and flop."
    },
    {
      "verse": "19",
      "text": "Planning and strategy give hope; fools stumble in chaos."
    },
    {
      "verse": "20",
      "text": "Counsel + advice = protection; the LORD guides outcomes."
    },
    {
      "verse": "21",
      "text": "Receive God’s commands; they’ll make you strong and honored."
    },
    {
      "verse": "22",
      "text": "Don’t cheat the poor; God defends them."
    },
    {
      "verse": "23",
      "text": "God saves the poor from the wicked; He’s the ultimate defender."
    },
    {
      "verse": "24",
      "text": "Don’t hang with hotheads; don’t roll with angry people."
    },
    {
      "verse": "25",
      "text": "Fear of people can trap you; trusting God frees you."
    },
    {
      "verse": "26",
      "text": "Don’t co-sign for strangers; avoid traps and debt."
    },
    {
      "verse": "27",
      "text": "Don’t pledge what’s not yours; you could lose it all."
    },
    {
      "verse": "28",
      "text": "Don’t move ancient boundary markers; keep fairness in place."
    },
    {
      "verse": "29",
      "text": "See someone skilled in their work? They’ll serve kings; they won’t serve nobodies."
    }]},
    {
  "chapter": "23",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, don’t chow down with rich folks too fast; keep your cool, control that appetite."
    },
    {
      "verse": "2",
      "text": "Put a knife on your throat if your hunger makes you reckless—self-control is key."
    },
    {
      "verse": "3",
      "text": "Don’t crave their fancy meals; they can trap you if you’re careless."
    },
    {
      "verse": "4",
      "text": "Don’t grind just to get rich; chill and focus on wisdom."
    },
    {
      "verse": "5",
      "text": "Wealth can vanish quick; it’s like your eyes chasing a mirage—don’t get blinded."
    },
    {
      "verse": "6",
      "text": "Don’t eat with stingy people; they might hate you even if you’re polite."
    },
    {
      "verse": "7",
      "text": "Watch their vibe—they think thoughts you can’t see."
    },
    {
      "verse": "8",
      "text": "Their heart’s bitter; you’ll pay for their attitude if you’re careless."
    },
    {
      "verse": "9",
      "text": "Don’t waste words on fools; they won’t get wisdom anyway."
    },
    {
      "verse": "10",
      "text": "Don’t move the ancient boundary lines; keep fairness locked."
    },
    {
      "verse": "11",
      "text": "God defends the poor; justice is real and active."
    },
    {
      "verse": "12",
      "text": "Listen to your parents’ instruction; it shapes life and keeps you grounded."
    },
    {
      "verse": "13",
      "text": "Don’t spare the rod; discipline your kids so they grow right."
    },
    {
      "verse": "14",
      "text": "Correcting them saves their soul from death; use it wisely, not harshly."
    },
    {
      "verse": "15",
      "text": "Smart kids make their parents proud; fools bring grief."
    },
    {
      "verse": "16",
      "text": "Don’t envy sinners; their end is disaster."
    },
    {
      "verse": "17",
      "text": "Don’t be jealous of rebels; their vibe fades fast."
    },
    {
      "verse": "18",
      "text": "Look ahead; plan for the future—it matters."
    },
    {
      "verse": "19",
      "text": "Don’t let anger control your heart; discipline yourself before it explodes."
    },
    {
      "verse": "20",
      "text": "Don’t hang with drunk people or gluttons; they mess life up."
    },
    {
      "verse": "21",
      "text": "Being lazy or greedy ruins you; avoid bad flexes."
    },
    {
      "verse": "22",
      "text": "Listen to your dad; don’t ignore your mom."
    },
    {
      "verse": "23",
      "text": "Buy truth and wisdom; don’t sell them just to survive."
    },
    {
      "verse": "24",
      "text": "Don’t envy rebels; their hype fades; God’s favor lasts."
    },
    {
      "verse": "25",
      "text": "Parents’ pride = their joy; keep God first, always."
    },
    {
      "verse": "26",
      "text": "My kid, give me your heart; your choices matter."
    },
    {
      "verse": "27",
      "text": "Don’t let lust trap you; it devours."
    },
    {
      "verse": "28",
      "text": "The sinner hoards loot for friends, but honesty lasts forever."
    },
    {
      "verse": "29",
      "text": "Who has trouble? Who fights? Who complains? Avoid them."
    },
    {
      "verse": "30",
      "text": "Who schemes? Who lies? Stay clear of these moves."
    },
    {
      "verse": "31",
      "text": "Don’t get wasted on wine; it blinds, tricks, and ruins you."
    },
    {
      "verse": "32",
      "text": "Don’t chase fancy drinks; they bite back hard."
    },
    {
      "verse": "33",
      "text": "Eyes see, heart feels; drunkenness fools both."
    },
    {
      "verse": "34",
      "text": "Being drunk turns you into a clown; leaders laugh at chaos."
    },
    {
      "verse": "35",
      "text": "The drunk may stumble, but life keeps moving; stay wise and keep your eyes open."
    }]},
    {
  "chapter": "24",
  "verses": [
    {
      "verse": "1",
      "text": "Don’t vibe with haters or envy evil peeps; their hype fades fast."
    },
    {
      "verse": "2",
      "text": "Their heart plans trouble, but God sees through it all."
    },
    {
      "verse": "3",
      "text": "Houses stand strong through wisdom; foundations are built with understanding."
    },
    {
      "verse": "4",
      "text": "Knowledge fills rooms with treasures; wise choices protect the crib."
    },
    {
      "verse": "5",
      "text": "Wise people flex strength; understanding peeps plan right."
    },
    {
      "verse": "6",
      "text": "Strategy wins battles; counsel + advice = ultimate power."
    },
    {
      "verse": "7",
      "text": "Fools bring chaos; they flop and destroy themselves."
    },
    {
      "verse": "8",
      "text": "Planning evil? You’ll get caught; justice doesn’t sleep."
    },
    {
      "verse": "9",
      "text": "Fools’ schemes are stupid; pride blinds them completely."
    },
    {
      "verse": "10",
      "text": "Weak knees in hard times? Stay strong, or fail."
    },
    {
      "verse": "11",
      "text": "Save those being dragged to death; pull them out—they deserve rescue."
    },
    {
      "verse": "12",
      "text": "God sees the heart; reward those who live righteously."
    },
    {
      "verse": "13",
      "text": "Eat your honey, kid; sweet words give life and energy."
    },
    {
      "verse": "14",
      "text": "Knowledge is the ultimate reward; it brings long life and peace."
    },
    {
      "verse": "15",
      "text": "Don’t sneak into the wicked’s crib; chill outside their trap."
    },
    {
      "verse": "16",
      "text": "Even the upright stumble sometimes; getting back up counts."
    },
    {
      "verse": "17",
      "text": "Don’t gloat when your enemy trips; stay humble."
    },
    {
      "verse": "18",
      "text": "Don’t get wild when they fall; God will handle the rest."
    },
    {
      "verse": "19",
      "text": "Don’t get mad at evil people; stay patient and wise."
    },
    {
      "verse": "20",
      "text": "Fools complain about everything; wise stay chill."
    },
    {
      "verse": "21",
      "text": "Fear God and kings; rules matter for safety."
    },
    {
      "verse": "22",
      "text": "Don’t envy rebels; evil peeps fade fast."
    },
    {
      "verse": "23",
      "text": "God hates perjury; fairness wins."
    },
    {
      "verse": "24",
      "text": "Don’t push the lazy; they’ll fail if you don’t guide."
    },
    {
      "verse": "25",
      "text": "Rescue the upright; God blesses those who help."
    },
    {
      "verse": "26",
      "text": "Help the poor speak up; their cries reach God fast."
    },
    {
      "verse": "27",
      "text": "Get your house in order; prep your work outside too."
    },
    {
      "verse": "28",
      "text": "Don’t lie about your neighbor; keep truth locked."
    },
    {
      "verse": "29",
      "text": "Don’t plot revenge; chill and stay honest."
    },
    {
      "verse": "30",
      "text": "Learn from the field of the lazy; watch their ways crumble."
    },
    {
      "verse": "31",
      "text": "One year of watching them? Take notes—they slump in harvest."
    },
    {
      "verse": "32",
      "text": "Observe their ways; laziness destroys, teach yourself the lesson."
    },
    {
      "verse": "33",
      "text": "Don’t be reckless; little discipline prevents big disaster."
    },
    {
      "verse": "34",
      "text": "Wise hearts stay alert; fools trip over small stuff."
    }]},
    {
  "chapter": "25",
  "verses": [
    {
      "verse": "1",
      "text": "God’s secrets and rules? Keep them low-key; don’t flex them too soon."
    },
    {
      "verse": "2",
      "text": "Glory belongs to God, not humans; He handles big flexes."
    },
    {
      "verse": "3",
      "text": "Heaven’s depth, Earth’s height, and kings’ hearts? God knows them all."
    },
    {
      "verse": "4",
      "text": "Remove dross from silver; testing reveals true value."
    },
    {
      "verse": "5",
      "text": "Remove wicked rulers from the king’s presence; justice keeps the kingdom tight."
    },
    {
      "verse": "6",
      "text": "Don’t claim the top seat at the table; humble yourself, avoid embarrassment."
    },
    {
      "verse": "7",
      "text": "Let others praise you; don’t self-flex or look desperate."
    },
    {
      "verse": "8",
      "text": "Don’t rush into fights; God’s justice handles the heat."
    },
    {
      "verse": "9",
      "text": "Settle disputes quietly; don’t air dirt in front of everyone."
    },
    {
      "verse": "10",
      "text": "Doing that can shame you; keep it low-key."
    },
    {
      "verse": "11",
      "text": "Words spoken right are like apples of gold in silver frames."
    },
    {
      "verse": "12",
      "text": "Wise correction = chill vibes; fools ignore it."
    },
    {
      "verse": "13",
      "text": "Loyal messengers bring refreshment; bad news burns."
    },
    {
      "verse": "14",
      "text": "Fake praise is like clouds with no rain; unreliable and empty."
    },
    {
      "verse": "15",
      "text": "Gentle patience can move a king; harshness triggers anger."
    },
    {
      "verse": "16",
      "text": "Don’t overdo honey; moderation keeps it sweet."
    },
    {
      "verse": "17",
      "text": "Avoid visiting enemies too often; you’ll get trapped."
    },
    {
      "verse": "18",
      "text": "Fake friends spreading lies? Like stabbing in secret."
    },
    {
      "verse": "19",
      "text": "Fools’ anger burns like fire; it destroys the stupid."
    },
    {
      "verse": "20",
      "text": "Cold hands? Heat them; cold words? Heal with kindness."
    },
    {
      "verse": "21",
      "text": "Feed your enemy if they’re hungry; God sees and blesses."
    },
    {
      "verse": "22",
      "text": "Don’t let bitterness dwell; God will handle vengeance."
    },
    {
      "verse": "23",
      "text": "A north wind brings rain; secrets revealed at the right time hit harder."
    },
    {
      "verse": "24",
      "text": "Better live on the roof than share space with a nagging spouse."
    },
    {
      "verse": "25",
      "text": "Good news from afar? Like cold water on a hot day."
    },
    {
      "verse": "26",
      "text": "Lazy hearts? Trouble; upright stay firm."
    },
    {
      "verse": "27",
      "text": "Eat just enough honey; overdoing makes it bitter."
    },
    {
      "verse": "28",
      "text": "Hearts without self-control? Like a city with no walls—defenseless."
    }]},
    {
  "chapter": "26",
  "verses": [
    {
      "verse": "1",
      "text": "Like snow in summer or rain in harvest, a fool’s praise is pointless."
    },
    {
      "verse": "2",
      "text": "A curse on the wrong person bounces back like arrows in the air."
    },
    {
      "verse": "3",
      "text": "Fools are like whips—useless unless someone handles them."
    },
    {
      "verse": "4",
      "text": "Don’t answer a fool in their way; it makes you look dumb too."
    },
    {
      "verse": "5",
      "text": "But if you answer rightly, you can teach them; timing matters."
    },
    {
      "verse": "6",
      "text": "Sending a fool with a message? That’s like cutting off your own foot."
    },
    {
      "verse": "7",
      "text": "Fools’ lips speak nonsense; it can’t hold weight."
    },
    {
      "verse": "8",
      "text": "Like tying a stone in a sling, fools’ schemes backfire."
    },
    {
      "verse": "9",
      "text": "Like sparks flying, fools stir fights with dumb words."
    },
    {
      "verse": "10",
      "text": "Arming fools? They start fights and get wrecked themselves."
    },
    {
      "verse": "11",
      "text": "A fool repeating mistakes? Like a dog returning to vomit."
    },
    {
      "verse": "12",
      "text": "Think you’re wise? Fools think the same; humility wins."
    },
    {
      "verse": "13",
      "text": "Lazy person says, “I’ll sleep later,” but never gets up."
    },
    {
      "verse": "14",
      "text": "Sluggards dream of food; nothing comes without work."
    },
    {
      "verse": "15",
      "text": "The lazy stretch patience like a rope but won’t finish."
    },
    {
      "verse": "16",
      "text": "Fools think they’re smart; even many of them cause harm."
    },
    {
      "verse": "17",
      "text": "Getting involved in someone else’s fight? You’ll get dragged down."
    },
    {
      "verse": "18",
      "text": "Like a madman tossing firebrands, arrows, and death, so is a deceiver."
    },
    {
      "verse": "19",
      "text": "Like a man saying, “I’m just joking,” a deceiver still brings harm."
    },
    {
      "verse": "20",
      "text": "Gossip burns like fire; it spreads constantly."
    },
    {
      "verse": "21",
      "text": "Fire needs wood; words of fools spark trouble."
    },
    {
      "verse": "22",
      "text": "Lies seem sweet but kill like poison."
    },
    {
      "verse": "23",
      "text": "Friendly smiles can hide hate; masks deceive."
    },
    {
      "verse": "24",
      "text": "Enemies flatter you; watch their vibe—they plot."
    },
    {
      "verse": "25",
      "text": "If you repay evil, don’t rejoice; leave vengeance to God."
    },
    {
      "verse": "26",
      "text": "Fools hate correction; wise hearts listen and grow."
    },
    {
      "verse": "27",
      "text": "Lazy hands = empty plate; diligent hands = full plate."
    },
    {
      "verse": "28",
      "text": "Like a city with broken walls, fools’ hearts are defenseless; chaos comes."
    }]},
    {
  "chapter": "27",
  "verses": [
    {
      "verse": "1",
      "text": "Don’t flex about tomorrow; nobody’s guaranteed the W yet."
    },
    {
      "verse": "2",
      "text": "Let others hype you; self-praise = weak energy."
    },
    {
      "verse": "3",
      "text": "A fool’s provocation weighs more than stones or sand—seriously, it’s heavy."
    },
    {
      "verse": "4",
      "text": "Wrath hits like fire; anger burns harder than the hottest drip."
    },
    {
      "verse": "5",
      "text": "True friends call you out; fake loyalty hides daggers."
    },
    {
      "verse": "6",
      "text": "Honest burns sting, but love stays real; lies only soothe for a sec."
    },
    {
      "verse": "7",
      "text": "Hunger kills passion; food satisfies, but drive keeps you alive."
    },
    {
      "verse": "8",
      "text": "Like a bird leaving its nest, a person straying from home loses balance."
    },
    {
      "verse": "9",
      "text": "Perfume + oil is sweet, but wise advice hits deeper."
    },
    {
      "verse": "10",
      "text": "Don’t ditch your squad; family + loyalty = lifetime buffs."
    },
    {
      "verse": "11",
      "text": "Be wise, kid; sharp brains keep you winning."
    },
    {
      "verse": "12",
      "text": "Spot trouble early; seeing danger = survival mode activated."
    },
    {
      "verse": "13",
      "text": "If someone puts up security, watch carefully; protect yourself financially."
    },
    {
      "verse": "14",
      "text": "Hugs from friends are nice, but sincere care = true power-up."
    },
    {
      "verse": "15",
      "text": "Nagging rain = spouse drama; constant drip wears down even the strongest."
    },
    {
      "verse": "16",
      "text": "Repeated quarrels erode peace like water wearing stone."
    },
    {
      "verse": "17",
      "text": "Iron sharpens iron; friends sharpen friends."
    },
    {
      "verse": "18",
      "text": "Like a madman tossing firebrands, deceivers destroy neighbors with lies."
    },
    {
      "verse": "19",
      "text": "Saying “I’m joking” after deceit? Still hurts; truth matters."
    },
    {
      "verse": "20",
      "text": "Gossip burns like fire; it spreads fast and wide."
    },
    {
      "verse": "21",
      "text": "Fire needs wood; fools’ words spark nonstop trouble."
    },
    {
      "verse": "22",
      "text": "Lies taste sweet but kill like venom—don’t bite."
    },
    {
      "verse": "23",
      "text": "A sly smile can hide hate; masks deceive."
    },
    {
      "verse": "24",
      "text": "Enemies flattering you? Watch closely; they plot."
    },
    {
      "verse": "25",
      "text": "Don’t rejoice in paying back evil; leave vengeance to God."
    },
    {
      "verse": "26",
      "text": "Fools hate correction; wise hearts level up from feedback."
    },
    {
      "verse": "27",
      "text": "There’ll be enough goats’ milk for your food, household, and girls—God keeps provision real."
    }]},
    {
  "chapter": "28",
  "verses": [
    {
      "verse": "1",
      "text": "Rebels run wild, but the righteous bounce back like bosses."
    },
    {
      "verse": "2",
      "text": "When law is ignored, chaos pops off; wise hearts stay chill."
    },
    {
      "verse": "3",
      "text": "Robbing the poor = stacking trouble; justice will clap back."
    },
    {
      "verse": "4",
      "text": "Blessings follow the righteous; they’ll never lack for real gain."
    },
    {
      "verse": "5",
      "text": "Evil folks hate the right vibes; their heart seeks trouble."
    },
    {
      "verse": "6",
      "text": "Rich + wicked = broke in soul; poor + righteous = true flex."
    },
    {
      "verse": "7",
      "text": "Whoever ignores wisdom? They stumble; whoever follows God? Solid."
    },
    {
      "verse": "8",
      "text": "Bribery = fake power; the upright live on real respect."
    },
    {
      "verse": "9",
      "text": "Lying lips hate honesty; truth seekers keep it 100."
    },
    {
      "verse": "10",
      "text": "Evil leaders terrify their people; righteous guidance = peace."
    },
    {
      "verse": "11",
      "text": "Rich think they’re smart, but the poor with insight see true vision."
    },
    {
      "verse": "12",
      "text": "When righteous triumph, the people celebrate; when wicked rise, people hide."
    },
    {
      "verse": "13",
      "text": "Hiding sin? God sees; confess and get mercy."
    },
    {
      "verse": "14",
      "text": "The righteous chill under God’s protection; evil hearts face fear."
    },
    {
      "verse": "15",
      "text": "A ruler without law = people suffer; order + justice = security."
    },
    {
      "verse": "16",
      "text": "A ruler greedy for gain? Bad vibes; one who hates bribes = stable kingdom."
    },
    {
      "verse": "17",
      "text": "The one chasing blood? They catch evil on themselves."
    },
    {
      "verse": "18",
      "text": "Whoever walks righteously = life; the perverse = danger."
    },
    {
      "verse": "19",
      "text": "Hardworking poor beats lazy rich—grind > clout."
    },
    {
      "verse": "20",
      "text": "Trustworthy wages = secure; perverse gain = unstable."
    },
    {
      "verse": "21",
      "text": "Fear God = life stays solid; God’s love = shield."
    },
    {
      "verse": "22",
      "text": "Greedy folks chase coins; lose soul in the process."
    },
    {
      "verse": "23",
      "text": "The proud hate truth; humble hearts listen and rise."
    },
    {
      "verse": "24",
      "text": "Lazy peeps = poor; diligent folks = rich in blessings."
    },
    {
      "verse": "25",
      "text": "Fear God = stability; pride = downfall."
    },
    {
      "verse": "26",
      "text": "Those trusting themselves = dumb; whoever walks wisely = safe."
    },
    {
      "verse": "27",
      "text": "Giving to poor = never lack; turning away = curses."
    },
    {
      "verse": "28",
      "text": "Righteous never ashamed; wicked = full of shame and regret."
    }]},
    {
  "chapter": "29",
  "verses": [
    {
      "verse": "1",
      "text": "Keep ignoring correction and acting hard? Eventually you break with no fix patch."
    },
    {
      "verse": "2",
      "text": "When righteous people lead, the streets celebrate; when wicked rule, vibes collapse."
    },
    {
      "verse": "3",
      "text": "A wisdom-lover brings peace; a wild-child chasing nonsense stresses the fam."
    },
    {
      "verse": "4",
      "text": "Just rulers build nations; corrupt ones tear everything down."
    },
    {
      "verse": "5",
      "text": "Hyping someone with fake compliments? You're setting them up for a fall."
    },
    {
      "verse": "6",
      "text": "Evil traps themselves; the righteous walk in freedom like it’s nothing."
    },
    {
      "verse": "7",
      "text": "Righteous care about justice for the poor; wicked don’t even notice."
    },
    {
      "verse": "8",
      "text": "Mockers light drama everywhere; wise people calm the chaos."
    },
    {
      "verse": "9",
      "text": "Arguing with a fool = wasted airtime; you get noise, rage, or both."
    },
    {
      "verse": "10",
      "text": "Murder-haters target the blameless; upright ones protect life."
    },
    {
      "verse": "11",
      "text": "A fool vents everything; the wise filter their thoughts."
    },
    {
      "verse": "12",
      "text": "If a ruler loves lies, their whole squad becomes corrupt."
    },
    {
      "verse": "13",
      "text": "God made both oppressor and poor—He gives sight to both sides."
    },
    {
      "verse": "14",
      "text": "A king who judges fairly keeps his throne steady."
    },
    {
      "verse": "15",
      "text": "Discipline + correction = wisdom; untreated rebellion = shame."
    },
    {
      "verse": "16",
      "text": "When wicked thrive, sin multiplies; the righteous will eventually watch their fall."
    },
    {
      "verse": "17",
      "text": "Correct your child and you’ll get peace instead of stress."
    },
    {
      "verse": "18",
      "text": "Without God’s vision, people run wild; following His word = stability."
    },
    {
      "verse": "19",
      "text": "A servant doesn’t learn just from talking; discipline seals the lesson."
    },
    {
      "verse": "20",
      "text": "See someone talking too quick? There’s more hope for a fool."
    },
    {
      "verse": "21",
      "text": "Pamper a servant too much and they’ll act entitled later."
    },
    {
      "verse": "22",
      "text": "Angry people stir beef; hotheads cause sin spikes."
    },
    {
      "verse": "23",
      "text": "Pride drags people down; humility lifts them up."
    },
    {
      "verse": "24",
      "text": "Partnering with a thief? You hate your own life—fear the truth and still lie."
    },
    {
      "verse": "25",
      "text": "Fear of people traps you; trusting God secures you."
    },
    {
      "verse": "26",
      "text": "Many seek leaders’ approval, but real justice comes from God."
    },
    {
      "verse": "27",
      "text": "Righteous and wicked clash naturally—opposite vibes can’t mix."
    }]},
    {
  "chapter": "30",
  "verses": [
    {
      "verse": "1",
      "text": "These are the words of Agur son of Jakeh—real talk, I ain’t claiming to be smart."
    },
    {
      "verse": "2",
      "text": "I’m too clueless to be human-wise; I don’t even fully get people."
    },
    {
      "verse": "3",
      "text": "I don’t know God like I should; humans? Even less."
    },
    {
      "verse": "4",
      "text": "Who went up to heaven? Who went down to the abyss? Who caught God’s vibe? Who knows His full squad? None but God."
    },
    {
      "verse": "5",
      "text": "Every word from God is pure, no cap; He shields those who trust Him."
    },
    {
      "verse": "6",
      "text": "Don’t add lies to His words; keep it real and listen."
    },
    {
      "verse": "7",
      "text": "Don’t give me fake bread or empty hype; just keep me humble and balanced."
    },
    {
      "verse": "8",
      "text": "Keep me from cheating, lying, or stealing vibes that ain’t mine."
    },
    {
      "verse": "9",
      "text": "Don’t accuse your homies for no reason; speak only truth."
    },
    {
      "verse": "10",
      "text": "Don’t curse someone for no reason; it comes back on you."
    },
    {
      "verse": "11",
      "text": "There’s a generation that curses their parents and thinks it’s funny."
    },
    {
      "verse": "12",
      "text": "There’s a generation that’s pure in their own eyes but never really clean."
    },
    {
      "verse": "13",
      "text": "There’s a generation too quick to bite; hotheads everywhere."
    },
    {
      "verse": "14",
      "text": "There’s a generation that’s arrogant and doesn’t listen to wisdom."
    },
    {
      "verse": "15",
      "text": "There are four things that are never satisfied: the grave, the womb, the barren land, and the fire."
    },
    {
      "verse": "16",
      "text": "The leech, the womb, the barren land, and fire—nothing ever full."
    },
    {
      "verse": "17",
      "text": "There are three things too awesome to understand: the way of an eagle in the sky, the way of a lion on the prowl, and the way of a ship in the sea."
    },
    {
      "verse": "18",
      "text": "Four things too fierce to control: a lion hunting, a raven soaring, a serpent sneaking, and a bad human flex."
    },
    {
      "verse": "19",
      "text": "There are four small but wise creatures: ants, hyraxes, locusts, and spiders."
    },
    {
      "verse": "20",
      "text": "Ants hustle in summer, prepping like pros."
    },
    {
      "verse": "21",
      "text": "Hyraxes chill in rocks, smart and safe."
    },
    {
      "verse": "22",
      "text": "Locusts swarm, always ready for the grind."
    },
    {
      "verse": "23",
      "text": "Spiders spin nets patiently, catching their prize."
    },
    {
      "verse": "24",
      "text": "There are four things stately and strong: a lion, an eagle, a warrior king, and a ruler who slays his enemies."
    },
    {
      "verse": "25",
      "text": "Pride will wreck you; humility is the real flex."
    },
    {
      "verse": "26",
      "text": "Don’t start fights you can’t finish; wisdom always wins."
    },
    {
      "verse": "27",
      "text": "Leave vengeance to God; He handles the score perfectly."
    },
    {
      "verse": "28",
      "text": "There’s a way of an adulterous woman: she eats and wipes her mouth, says, “I did nothing wrong,” yet she destroys lives."
    },
    {
      "verse": "29",
      "text": "The man who stays loyal to God avoids traps; his heart is steady."
    },
    {
      "verse": "30",
      "text": "A man’s eye can’t see every scam; God spots it all."
    },
    {
      "verse": "31",
      "text": "God balances everything; the world stays real because He keeps it."
    },
    {
      "verse": "32",
      "text": "Don’t lie or overhype yourself; integrity is king."
    },
    {
      "verse": "33",
      "text": "Don’t be arrogant or boast; pride comes before a fall."
    }]},
    {
  "chapter": "31",
  "verses": [
    {
      "verse": "1",
      "text": "The words of King Lemuel, inspired by his mom—she schooled him right."
    },
    {
      "verse": "2",
      "text": "My son, my advice? Don’t get wasted; alcohol clouds the mind."
    },
    {
      "verse": "3",
      "text": "Don’t be caught flexing with women that destroy lives; guard your heart."
    },
    {
      "verse": "4",
      "text": "Kings and rulers, listen: don’t let booze make your moves dumb."
    },
    {
      "verse": "5",
      "text": "Don’t drown in wine or your judgments will slip."
    },
    {
      "verse": "6",
      "text": "Give the drunk what they need, and the poor their potion—but don’t go overboard."
    },
    {
      "verse": "7",
      "text": "Let strong drink settle souls, not make them dumb."
    },
    {
      "verse": "8",
      "text": "Speak up for those who can’t; defend the rights of the weak."
    },
    {
      "verse": "9",
      "text": "Stand strong for justice; be the voice when no one else speaks."
    },
    {
      "verse": "10",
      "text": "A good woman? Hard to find, she’s priceless."
    },
    {
      "verse": "11",
      "text": "Her man trusts her fully; she vibes loyalty and skill."
    },
    {
      "verse": "12",
      "text": "She blesses her man, never bringing stress."
    },
    {
      "verse": "13",
      "text": "She works hard—grabs wool and flax, grinds her grind."
    },
    {
      "verse": "14",
      "text": "She’s like a trader ship—she brings food from afar, keeping the household solid."
    },
    {
      "verse": "15",
      "text": "Up at sunrise, planning the day; late to bed, still grinding."
    },
    {
      "verse": "16",
      "text": "She handles investments, flips it smart; her lamp never goes out."
    },
    {
      "verse": "17",
      "text": "She’s strong in her hustle; her arms stay ready."
    },
    {
      "verse": "18",
      "text": "She’s clutch—her work ain’t random; she’s strategic, like a queen boss."
    },
    {
      "verse": "19",
      "text": "She spins and weaves; her creativity never quits."
    },
    {
      "verse": "20",
      "text": "She helps the poor; her hands never idle."
    },
    {
      "verse": "21",
      "text": "She’s prepped for storms; her household is safe."
    },
    {
      "verse": "22",
      "text": "She’s stylish in her drip; her vibe is strong and respectful."
    },
    {
      "verse": "23",
      "text": "Her man? Known at the gate, respected by the city, all thanks to her."
    },
    {
      "verse": "24",
      "text": "She designs clothes, sells them; her hustle never sleeps."
    },
    {
      "verse": "25",
      "text": "Strength and dignity? That’s her drip; she laughs at the future—no stress."
    },
    {
      "verse": "26",
      "text": "Words are wise; she teaches, not scolds."
    },
    {
      "verse": "27",
      "text": "She keeps her home in check; nothing falls apart on her watch."
    },
    {
      "verse": "28",
      "text": "Her kids respect her; her man praises her loudly."
    },
    {
      "verse": "29",
      "text": "Many women flex, but she’s unmatched; she’s the real deal."
    },
    {
      "verse": "30",
      "text": "Charm is fake, beauty fades, but a God-fearing woman? Eternal flex."
    },
    {
      "verse": "31",
      "text": "Give her props—she earned it; let her works shine in the streets."
    }]}



  ]}