{
  "book": "Psalms",
  "chapters": [
    {
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Blessed is the one who dodges bad vibes, haters, and toxic crowds; they don’t roll with sinners or join the gossip squad."
    },
    {
      "verse": "2",
      "text": "Instead, they vibe fully with God’s word, meditating on it day and night."
    },
    {
      "verse": "3",
      "text": "They’re like a tree planted by streams of water—always nourished, always thriving, never dry."
    },
    {
      "verse": "4",
      "text": "Whatever they do? It pops off—they succeed in all their moves."
    },
    {
      "verse": "5",
      "text": "The wicked? Nah, they’re like chaff the wind blows away—no roots, no staying power."
    },
    {
      "verse": "6",
      "text": "God watches the path of the righteous, but the wicked? Their way crashes and burns."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Why are the nations wildin’ and plotting nonsense like they can outplay God?"
    },
    {
      "verse": "2",
      "text": "Earth’s leaders link up, forming “Anti-God Alliance,” trying to go against the Lord and His chosen King."
    },
    {
      "verse": "3",
      "text": "They say, “Let’s break free from God’s rules; we don’t want His control.”"
    },
    {
      "verse": "4",
      "text": "Meanwhile, God in heaven is literally laughing—He’s unbothered."
    },
    {
      "verse": "5",
      "text": "Then He speaks, and His words shake them—He shuts them down real quick."
    },
    {
      "verse": "6",
      "text": "“I already crowned My King on Zion, My holy hill.”"
    },
    {
      "verse": "7",
      "text": "The King says, “Let me tell you what God said: ‘You are My Son; today I declare You Mine.’”"
    },
    {
      "verse": "8",
      "text": "“Ask Me, and I’ll hand you the nations; the whole world is yours.”"
    },
    {
      "verse": "9",
      "text": "“You’ll break rebellious nations like pottery smashed with an iron rod.”"
    },
    {
      "verse": "10",
      "text": "So, kings—be smart. Leaders—take this seriously."
    },
    {
      "verse": "11",
      "text": "Serve the Lord with reverence; tremble but obey Him."
    },
    {
      "verse": "12",
      "text": "Honor the Son, or chaos will catch you slipping; His anger fires up fast. Blessed are the ones who take refuge in Him."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Lord, my ops are multiplying—whole crowd rising up against me."
    },
    {
      "verse": "2",
      "text": "They’re out here saying, “God ain’t saving him fr.”"
    },
    {
      "verse": "3",
      "text": "But You, Lord, are my shield—my glow-up, the One who lifts my head back up."
    },
    {
      "verse": "4",
      "text": "I cried out to You, and You answered me straight from Your holy mountain."
    },
    {
      "verse": "5",
      "text": "I lay down, slept, and woke up again—’cause You kept me alive."
    },
    {
      "verse": "6",
      "text": "I won’t stress even if ten thousand mobs pull up against me."
    },
    {
      "verse": "7",
      "text": "Rise up, Lord! Save me! You’re the One who claps my enemies and breaks their power."
    },
    {
      "verse": "8",
      "text": "Salvation belongs to You, Lord—let Your blessing rest on Your people."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "God of my righteousness, pick up my call—You’ve pulled me out of tight spaces before, so show me mercy again and hear me out."
    },
    {
      "verse": "2",
      "text": "Yo people, how long you gonna drag my name and chase lies like it’s a hobby?"
    },
    {
      "verse": "3",
      "text": "Just know this: the Lord sets apart His people for Himself—when I call Him, He actually answers."
    },
    {
      "verse": "4",
      "text": "Chill out and stop wilding—think deeply on your actions when you’re quiet on your bed."
    },
    {
      "verse": "5",
      "text": "Offer the right sacrifices and put real trust in the Lord."
    },
    {
      "verse": "6",
      "text": "Everybody’s asking, “Who gonna bless us? Who gonna give us light?” Lord, shine Your face on us."
    },
    {
      "verse": "7",
      "text": "You’ve put more joy in my heart than people get when their bag is overflowing."
    },
    {
      "verse": "8",
      "text": "I can lie down and sleep in full peace—’cause You alone, Lord, lock in my safety."
    }]},
    {
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "Lord, hear me out — catch my words and peep my heart’s whispers."
    },
    {
      "verse": "2",
      "text": "My King and my God, You’re the One I pray to, so yeah, I’m calling on You."
    },
    {
      "verse": "3",
      "text": "Every morning I pull up with my prayers; I lay everything out and wait on You like refresh-loading."
    },
    {
      "verse": "4",
      "text": "You’re not a God who vibes with wickedness — evil can’t sit near You."
    },
    {
      "verse": "5",
      "text": "Arrogant people won’t survive in Your presence; You hate every move evil folks make."
    },
    {
      "verse": "6",
      "text": "You destroy liars; violent and deceitful people? The Lord detests them."
    },
    {
      "verse": "7",
      "text": "But me? I step into Your house by Your mercy — I bow down in awe toward Your holy temple."
    },
    {
      "verse": "8",
      "text": "Lord, lead me in Your righteousness because of my enemies; make Your path straight ahead of me."
    },
    {
      "verse": "9",
      "text": "Their words can’t be trusted — their insides are a whole disaster; their throats are like open graves, and their tongues just smooth-talk lies."
    },
    {
      "verse": "10",
      "text": "Rain judgment on them, O God — let their own schemes trap them. Kick them out for their many sins, ’cause they rebel against You."
    },
    {
      "verse": "11",
      "text": "But let everyone who trusts in You be hype and joyful — let them shout for joy forever, ‘cause You protect them."
    },
    {
      "verse": "12",
      "text": "For You, Lord, bless the righteous and cover them with favor like armor."
    }]},
    {
  "chapter": "6",
  "verses": [
    {
      "verse": "1",
      "text": "LORD, don’t stay angry; don’t punish me too hard."
    },
    {
      "verse": "2",
      "text": "Heal me, LORD; I’m weak, my bones ache."
    },
    {
      "verse": "3",
      "text": "My soul is in distress; how long will this last?"
    },
    {
      "verse": "4",
      "text": "Turn, LORD, save me; show your mercy."
    },
    {
      "verse": "5",
      "text": "In death, no one remembers you; the grave can’t give thanks."
    },
    {
      "verse": "6",
      "text": "I’m full of tears; I weep all night."
    },
    {
      "verse": "7",
      "text": "My eyes are drained from constant crying."
    },
    {
      "verse": "8",
      "text": "Depart from me, all who do evil; the LORD heard my cries."
    },
    {
      "verse": "9",
      "text": "The LORD has heard my prayer; He accepts it."
    },
    {
      "verse": "10",
      "text": "Let all my enemies be ashamed and turned back."
    }]},
    {
  "chapter": "7",
  "verses": [
    {
      "verse": "1",
      "text": "LORD my God, I run to you; save me from my haters."
    },
    {
      "verse": "2",
      "text": "Save me or I’ll get shredded; don’t let my soul get wrecked."
    },
    {
      "verse": "3",
      "text": "LORD my God, if I did wrong, if there’s guilt in my hands—"
    },
    {
      "verse": "4",
      "text": "If I returned evil for evil, or crushed my foes instead of mercy—"
    },
    {
      "verse": "5",
      "text": "Let my enemy chase me, but never get the win; let justice hit them."
    },
    {
      "verse": "6",
      "text": "The LORD judges right; He’s furious with the wicked every day."
    },
    {
      "verse": "7",
      "text": "If they won’t repent, He sharpens His sword; readies His bow, armed and ready."
    },
    {
      "verse": "8",
      "text": "He’s ready; He’s plotting doom for the nations who stand against Him."
    },
    {
      "verse": "9",
      "text": "The LORD’s wrath reaches the wicked, He’s the ultimate defender."
    },
    {
      "verse": "10",
      "text": "My shield is God, who saves the pure of heart."
    },
    {
      "verse": "11",
      "text": "God is righteous; He loves right living; the upright can trust Him."
    },
    {
      "verse": "12",
      "text": "God’s eye sees everyone; the wicked can’t hide."
    },
    {
      "verse": "13",
      "text": "If they turn evil, He readies His sword; His bow is strung, arrows fly."
    },
    {
      "verse": "14",
      "text": "The wicked dig their own pit; they fall into the trap they made."
    },
    {
      "verse": "15",
      "text": "God’s wrath is real; it burns those who plot injustice."
    },
    {
      "verse": "16",
      "text": "The LORD is my shield; He saves the good, judges the wrong."
    },
    {
      "verse": "17",
      "text": "I’ll give thanks to the LORD for His righteousness; I’ll sing for the name of the LORD Most High."
    }]},
    {
  "chapter": "8",
  "verses": [
    {
      "verse": "1",
      "text": "LORD, your name is huge, way above earth and sky, your glory shows everywhere."
    },
    {
      "verse": "2",
      "text": "Babies and kids shut up your enemies, God, that’s wild."
    },
    {
      "verse": "3",
      "text": "When I look at the sky, your fingers made the moon and stars."
    },
    {
      "verse": "4",
      "text": "Humans? You even notice us? Crazy that you care."
    },
    {
      "verse": "5",
      "text": "You made us just below angels, crowned us with honor."
    },
    {
      "verse": "6",
      "text": "You gave us rule over your works, everything under our feet."
    },
    {
      "verse": "7",
      "text": "All the animals—sheep, oxen, and wild beasts."
    },
    {
      "verse": "8",
      "text": "Birds in the sky, fish in the sea, everything swimming its lane."
    },
    {
      "verse": "9",
      "text": "LORD, your name is massive, your glory is above all."
    }]},
    {
  "chapter": "9",
  "verses": [
    {
      "verse": "1",
      "text": "Lord, I’m giving you full praise — whole heart in. I’m talking about everything you’ve done."
    },
    {
      "verse": "2",
      "text": "I’m rejoicing in you; your name stays honored on my lips."
    },
    {
      "verse": "3",
      "text": "My enemies pull up, but they trip and fall because you back me."
    },
    {
      "verse": "4",
      "text": "You sit on the throne and judge right — my case is safe with you."
    },
    {
      "verse": "5",
      "text": "You call out the nations doing evil; you shut down the wicked and erase their name for good."
    },
    {
      "verse": "6",
      "text": "Their cities? Gone. Their plans? Finished. Memory deleted."
    },
    {
      "verse": "7",
      "text": "But you, Lord, stay forever; your throne stands solid in justice."
    },
    {
      "verse": "8",
      "text": "You judge the whole world with truth and rule the nations with fairness."
    },
    {
      "verse": "9",
      "text": "You’re a refuge for the oppressed — a safe spot in hard times."
    },
    {
      "verse": "10",
      "text": "Anyone who knows your name trusts you, because you never ignore the ones who seek you."
    },
    {
      "verse": "11",
      "text": "Sing to the Lord who rules from Zion; let the world know what He’s done."
    },
    {
      "verse": "12",
      "text": "He remembers the cries of the harmed; He doesn’t forget them."
    },
    {
      "verse": "13",
      "text": "Lord, be gracious to me. Look at the trouble I’m in from those who hate me — lift me from death’s edge."
    },
    {
      "verse": "14",
      "text": "I’ll praise you openly and rejoice in your rescue."
    },
    {
      "verse": "15",
      "text": "The nations fall into the traps they made; their own plans catch them."
    },
    {
      "verse": "16",
      "text": "The Lord shows Himself through righteous judgment; the wicked get caught in their own works."
    },
    {
      "verse": "17",
      "text": "The wicked head toward the grave — the same for nations that forget God."
    },
    {
      "verse": "18",
      "text": "But the needy aren’t forgotten; their hope won’t die out."
    },
    {
      "verse": "19",
      "text": "Rise up, Lord. Don’t let humans act like they run the world; let the nations face your justice."
    },
    {
      "verse": "20",
      "text": "Put them in place, Lord, so they finally learn they’re just human."
    }]},
    {
  "chapter": "10",
  "verses": [
    {
      "verse": "1",
      "text": "Lord, why do you feel far? Why hide when things get rough?"
    },
    {
      "verse": "2",
      "text": "The wicked flex on the weak; let their own schemes hit them back."
    },
    {
      "verse": "3",
      "text": "The wicked brag on their desires and disrespect you."
    },
    {
      "verse": "4",
      "text": "Pride blinds them — they don’t seek you, and you’re not in their thoughts."
    },
    {
      "verse": "5",
      "text": "Their ways look smooth for now; your judgments seem far to them. They look down on others."
    },
    {
      "verse": "6",
      "text": "They think, “I’ll never fall; nothing bad will touch me.”"
    },
    {
      "verse": "7",
      "text": "Their mouth stays full of cursing, lies, and trouble."
    },
    {
      "verse": "8",
      "text": "They hide waiting to ambush the helpless; they target the vulnerable."
    },
    {
      "verse": "9",
      "text": "They lurk like a lion in hiding, ready to drag the poor into their traps."
    },
    {
      "verse": "10",
      "text": "The helpless get crushed and fall under their pressure."
    },
    {
      "verse": "11",
      "text": "They think, “God forgot; He won’t notice.”"
    },
    {
      "verse": "12",
      "text": "Rise up, Lord; lift your hand. Don’t forget the afflicted."
    },
    {
      "verse": "13",
      "text": "Why does the wicked think you won’t call them out?"
    },
    {
      "verse": "14",
      "text": "But you *do* see it — the trouble, the grief — and you handle it. The weak trust you; you defend the fatherless."
    },
    {
      "verse": "15",
      "text": "Break the power of the wicked; expose every evil they’ve done."
    },
    {
      "verse": "16",
      "text": "The Lord is King forever; evil nations vanish from His land."
    },
    {
      "verse": "17",
      "text": "You hear the cries of the humble; you give them strength and listen closely."
    },
    {
      "verse": "18",
      "text": "You defend the fatherless and the oppressed, so people of the earth won’t keep terrifying others."
    }]},
    {
  "chapter": "11",
  "verses": [
    {
      "verse": "1",
      "text": "I take refuge in the Lord. So why you telling me, “Run to the mountains like a scared bird”?"
    },
    {
      "verse": "2",
      "text": "Look — the wicked got their bow pulled back, aiming in the dark at people with clean hearts."
    },
    {
      "verse": "3",
      "text": "If the foundations break down, what can the righteous even do?"
    },
    {
      "verse": "4",
      "text": "The Lord is in His holy temple; His throne is in heaven. He sees everything; His eyes test everyone."
    },
    {
      "verse": "5",
      "text": "The Lord checks the righteous, but He hates those who love violence."
    },
    {
      "verse": "6",
      "text": "He’ll rain fire and scorching wind on the wicked — that’s their portion."
    },
    {
      "verse": "7",
      "text": "Because the Lord is righteous; He loves righteousness. The upright will see His face."
    }]},
    {
  "chapter": "12",
  "verses": [
    {
      "verse": "1",
      "text": "Help, LORD — the faithful are disappearing; loyal ones are hard to find."
    },
    {
      "verse": "2",
      "text": "Everybody talks fake, smooth words, double-minded energy."
    },
    {
      "verse": "3",
      "text": "LORD, cut off the lying lips and the braggy tongues."
    },
    {
      "verse": "4",
      "text": "Those who say, “Our words run things; nobody can check us.”"
    },
    {
      "verse": "5",
      "text": "“Because the poor are pressed and the needy cry out, I will rise,” says the LORD. “I’ll protect them.”"
    },
    {
      "verse": "6",
      "text": "The LORD’s words are pure — like silver refined seven times."
    },
    {
      "verse": "7",
      "text": "You, LORD, will guard them; You’ll keep them safe forever."
    },
    {
      "verse": "8",
      "text": "The wicked roam everywhere when evil is praised."
    }]},
    {
  "chapter": "13",
  "verses": [
    {
      "verse": "1",
      "text": "LORD, how long will You forget me? How long will You hide Your face?"
    },
    {
      "verse": "2",
      "text": "How long will I wrestle with myself and feel sorrow all day? How long will my enemy stay ahead?"
    },
    {
      "verse": "3",
      "text": "Look at me, LORD my God; answer me. Give light to my eyes or I’ll fall."
    },
    {
      "verse": "4",
      "text": "My enemy will say, “I beat him,” and my foes will celebrate when I slip."
    },
    {
      "verse": "5",
      "text": "But I trust Your mercy; my heart rejoices in Your salvation."
    },
    {
      "verse": "6",
      "text": "I’ll praise You, LORD, because You’ve been good to me."
    }]},
    {
  "chapter": "14",
  "verses": [
    {
      "verse": "1",
      "text": "The fool says in his heart, “There’s no God.” People acting corrupted; nobody’s doing right."
    },
    {
      "verse": "2",
      "text": "The LORD looked down to see if anyone seeks Him."
    },
    {
      "verse": "3",
      "text": "All turned aside; all messed up. No one does good — not even one."
    },
    {
      "verse": "4",
      "text": "Do the evil ones not get it? They consume My people like bread and don’t call on the LORD."
    },
    {
      "verse": "5",
      "text": "They’ll shake with fear, because God stands with the righteous crew."
    },
    {
      "verse": "6",
      "text": "You shame the poor, but the LORD is their refuge."
    },
    {
      "verse": "7",
      "text": "Oh that salvation for Israel would come from Zion! When the LORD restores His people, let Jacob rejoice; let Israel be glad."
    }]},
    {
  "chapter": "14",
  "verses": [
    {
      "verse": "1",
      "text": "The fool says in his heart, “There’s no God.” People acting corrupted; nobody’s doing right."
    },
    {
      "verse": "2",
      "text": "The LORD looked down to see if anyone seeks Him."
    },
    {
      "verse": "3",
      "text": "All turned aside; all messed up. No one does good — not even one."
    },
    {
      "verse": "4",
      "text": "Do the evil ones not get it? They consume My people like bread and don’t call on the LORD."
    },
    {
      "verse": "5",
      "text": "They’ll shake with fear, because God stands with the righteous crew."
    },
    {
      "verse": "6",
      "text": "You shame the poor, but the LORD is their refuge."
    },
    {
      "verse": "7",
      "text": "Oh that salvation for Israel would come from Zion! When the LORD restores His people, let Jacob rejoice; let Israel be glad."
    }]},
    {
  "chapter": "15",
  "verses": [
    {
      "verse": "1",
      "text": "LORD, who may stay in your tabernacle? Who may dwell on your holy hill?"
    },
    {
      "verse": "2",
      "text": "The one who walks right, does what’s true, and speaks truth from the heart."
    },
    {
      "verse": "3",
      "text": "Doesn’t slander, doesn’t harm others, doesn’t insult their neighbor."
    },
    {
      "verse": "4",
      "text": "Honors those who fear you; rejects what’s evil; keeps their word even when it hurts."
    },
    {
      "verse": "5",
      "text": "Doesn’t cheat people, doesn’t take bribes. This one stands firm and won’t be moved."
      }]},
      {
  "chapter": "16",
  "verses": [
    {
      "verse": "1",
      "text": "Keep me safe, O God; I run to you for refuge."
    },
    {
      "verse": "2",
      "text": "I said to the LORD, “You’re my Lord; every good thing I have comes from you.”"
    },
    {
      "verse": "3",
      "text": "The people who follow you are the ones I delight in."
    },
    {
      "verse": "4",
      "text": "Those who chase other gods only multiply pain; I won’t join them or call on their names."
    },
    {
      "verse": "5",
      "text": "LORD, you’re my portion and my cup; you hold my future steady."
    },
    {
      "verse": "6",
      "text": "You placed me in good territory; the inheritance you gave me is solid."
    },
    {
      "verse": "7",
      "text": "I bless you for guiding me; even at night, you correct my thoughts."
    },
    {
      "verse": "8",
      "text": "I keep you before me always; because you’re at my right hand, I won’t be shaken."
    },
    {
      "verse": "9",
      "text": "My heart is glad, my soul rests, my body lives secure."
    },
    {
      "verse": "10",
      "text": "You won’t abandon me to the grave; you won’t let your holy one see decay."
    },
    {
      "verse": "11",
      "text": "You show me the path of life; in your presence is fullness of joy, and at your right hand are eternal pleasures."
    }]},
    {
  "chapter": "17",
  "verses": [
    {
      "verse": "1",
      "text": "Lord, hear me — my request is honest. My lips aren’t playing fake."
    },
    {
      "verse": "2",
      "text": "Let my verdict come straight from You; You see everything clearly."
    },
    {
      "verse": "3",
      "text": "You checked my heart, You watched me at night, You tested me — I’m not out here plotting wrong."
    },
    {
      "verse": "4",
      "text": "I’ve kept away from shady paths; Your words kept me steady."
    },
    {
      "verse": "5",
      "text": "Keep my steps firm on Your road so I don’t slip."
    },
    {
      "verse": "6",
      "text": "I call on You ’cause You always answer — listen to me, Lord."
    },
    {
      "verse": "7",
      "text": "Show me Your amazing love, the kind that saves those who trust in You."
    },
    {
      "verse": "8",
      "text": "Keep me as Your “eye-apple” — hide me under Your wings."
    },
    {
      "verse": "9",
      "text": "Protect me from the enemies hunting me down."
    },
    {
      "verse": "10",
      "text": "They’re heartless; their mouths talk big."
    },
    {
      "verse": "11",
      "text": "They surround me, watching every move."
    },
    {
      "verse": "12",
      "text": "They’re like a lion ready to pounce."
    },
    {
      "verse": "13",
      "text": "Rise up, Lord — stop them. Bring them down by Your hand."
    },
    {
      "verse": "14",
      "text": "Save me from people who live for this world only."
    },
    {
      "verse": "15",
      "text": "But me? I’ll see Your face in righteousness; when I wake, I’ll be satisfied with being like You."
    }]},
    {
  "chapter": "18",
  "verses": [
    {
      "verse": "1",
      "text": "God’s my rock, my shield, my ultimate backup."
    },
    {
      "verse": "2",
      "text": "My fortress, my safe spot, my stronghold."
    },
    {
      "verse": "3",
      "text": "I shout to Him, He always listens."
    },
    {
      "verse": "4",
      "text": "Trouble surrounds me, waves of chaos everywhere."
    },
    {
      "verse": "5",
      "text": "I call for help, He pulls through instantly."
    },
    {
      "verse": "6",
      "text": "Darkness tried to trap me, He lights the way."
    },
    {
      "verse": "7",
      "text": "The earth shook, mountains trembled—His power showed."
    },
    {
      "verse": "8",
      "text": "Skies flashed, storms shook, His presence is real."
    },
    {
      "verse": "9",
      "text": "The ground moved, hills wobbled, God’s wrath was clear."
    },
    {
      "verse": "10",
      "text": "He came fast, untouchable, swooping through."
    },
    {
      "verse": "11",
      "text": "Enemies attacked, arrows flew, He shielded me."
    },
    {
      "verse": "12",
      "text": "He trained my hands, gave me strength to fight."
    },
    {
      "verse": "13",
      "text": "Enemy defenses broke, I stood unshaken."
    },
    {
      "verse": "14",
      "text": "He leveled me up, gave me skill and courage."
    },
    {
      "verse": "15",
      "text": "I moved safely, path clear, fear gone."
    },
    {
      "verse": "16",
      "text": "My foes stumbled, couldn’t touch me."
    },
    {
      "verse": "17",
      "text": "They tried, they fell, justice served."
    },
    {
      "verse": "18",
      "text": "God kept me safe, my peace secure."
    },
    {
      "verse": "19",
      "text": "He punished the wicked, exposed their plans."
    },
    {
      "verse": "20",
      "text": "They were humbled, saw His hand."
    },
    {
      "verse": "21",
      "text": "My crown secure, His faithfulness unmatched."
    },
    {
      "verse": "22",
      "text": "He rewards the ones who walk true."
    },
    {
      "verse": "23",
      "text": "He guides my steps, keeps me aligned."
    },
    {
      "verse": "24",
      "text": "Strength from Him, I stand firm."
    },
    {
      "verse": "25",
      "text": "My path straight, no detours, no lies."
    },
    {
      "verse": "26",
      "text": "God matches my energy—pure and real."
    },
    {
      "verse": "27",
      "text": "He shields me, keeps me on track."
    },
    {
      "verse": "28",
      "text": "I shout, He backs me, full confidence."
    },
    {
      "verse": "29",
      "text": "Storms obey His name."
    },
    {
      "verse": "30",
      "text": "Ground steady, I move strong."
    },
    {
      "verse": "31",
      "text": "He’s my ultimate support, never fails."
    },
    {
      "verse": "32",
      "text": "Ready for battle, powered by Him."
    },
    {
      "verse": "33",
      "text": "He equips me with wisdom, skill, focus."
    },
    {
      "verse": "34",
      "text": "Barriers break, doors open by His hand."
    },
    {
      "verse": "35",
      "text": "Light guides me, no darkness blocks."
    },
    {
      "verse": "36",
      "text": "Enemies exposed, powerless."
    },
    {
      "verse": "37",
      "text": "Their plans collapse, they stumble."
    },
    {
      "verse": "38",
      "text": "I move sure, His strength in me."
    },
    {
      "verse": "39",
      "text": "Respect comes, His name honored."
    },
    {
      "verse": "40",
      "text": "I dodge traps, nothing sticks."
    },
    {
      "verse": "41",
      "text": "Life’s chaos? Handled, confidence solid."
    },
    {
      "verse": "42",
      "text": "He levels me up, keeps me strong."
    },
    {
      "verse": "43",
      "text": "Focused, precise, moving with skill."
    },
    {
      "verse": "44",
      "text": "Obstacles cleared, path ready."
    },
    {
      "verse": "45",
      "text": "My steps swift, foes fall behind."
    },
    {
      "verse": "46",
      "text": "Sure-footed, stable, grounded in Him."
    },
    {
      "verse": "47",
      "text": "God’s my MVP, always reliable."
    },
    {
      "verse": "48",
      "text": "Victory is His, I give Him praise."
    },
    {
      "verse": "49",
      "text": "His power eternal, mercy never ends."
    },
    {
      "verse": "50",
      "text": "Forever grateful, His love sustains me."
    }]},
    {
  "chapter": "19",
  "verses": [
    {
      "verse": "1",
      "text": "Look up—the sky’s showing off God’s epic power, clear for everyone to see."
    },
    {
      "verse": "2",
      "text": "Every day speaks His story, every night whispers His wisdom."
    },
    {
      "verse": "3",
      "text": "No words needed—the universe itself tells the truth."
    },
    {
      "verse": "4",
      "text": "His message travels everywhere, reaching everyone without fail."
    },
    {
      "verse": "5",
      "text": "The sun comes out like a champion on a mission, spreading warmth and energy."
    },
    {
      "verse": "6",
      "text": "It doesn’t miss a beat, lighting up the earth from corner to corner."
    },
    {
      "verse": "7",
      "text": "God’s law is perfect—guiding souls, giving life, leveling us up in the right way."
    },
    {
      "verse": "8",
      "text": "His rules are trustworthy, clear, and just—they make simple hearts wise."
    },
    {
      "verse": "9",
      "text": "Respecting God? Eternal power, lasting forever."
    },
    {
      "verse": "10",
      "text": "His commands are priceless, sweeter than honey, more valuable than gold."
    },
    {
      "verse": "11",
      "text": "Following them keeps you safe and wise; ignoring them is a trap."
    },
    {
      "verse": "12",
      "text": "Help me notice my mistakes, even the ones I can’t see."
    },
    {
      "verse": "13",
      "text": "Keep me from messing up badly—protect me from sin’s traps."
    },
    {
      "verse": "14",
      "text": "Let my words and thoughts honor You, God—my strength and my guide."
    }]},
    {
  "chapter": "20",
  "verses": [
    {
      "verse": "1",
      "text": "May the Lord notice you instantly in your bad days and may the God of Jacob pull up for you when life swings."
    },
    {
      "verse": "2",
      "text": "May He send you backup from His throne and may His strength hold you steady from Zion."
    },
    {
      "verse": "3",
      "text": "May He remember every sacrifice you’ve made and may He honor every offering you’ve placed before Him."
    },
    {
      "verse": "4",
      "text": "May He give you the exact desires He Himself shaped in your heart and help all your plans line up with His will."
    },
    {
      "verse": "5",
      "text": "We will celebrate when He comes through and lift His name like a banner after the victory. May the Lord fulfill every request that lines up with Him."
    },
    {
      "verse": "6",
      "text": "Now I know this for real: The Lord rescues His chosen one. He answers from heaven with power only He owns."
    },
    {
      "verse": "7",
      "text": "Some people trust systems and strength, but we trust the name of the Lord our God."
    },
    {
      "verse": "8",
      "text": "They trip and collapse, but we stay standing because He keeps us standing."
    },
    {
      "verse": "9",
      "text": "Lord, save us. And let the king You’ve placed hear us when we cry out."
    }]},
    {
  "chapter": "21",
  "verses": [
    {
      "verse": "1",
      "text": "Lord, the king celebrates Your strength, and he’s hyped because You give real victories."
    },
    {
      "verse": "2",
      "text": "You didn’t ignore what he wanted — You actually handed him the desires he prayed for."
    },
    {
      "verse": "3",
      "text": "You blessed him with goodness straight from You and placed a crown on his head — one that actually means something."
    },
    {
      "verse": "4",
      "text": "He asked for life, and You gave him long years that stretch beyond what he imagined."
    },
    {
      "verse": "5",
      "text": "Your victories made him shine, and You dressed him with honor and glory that only You can give."
    },
    {
      "verse": "6",
      "text": "You put him in blessings that don’t expire, and Your presence makes him overflow with joy."
    },
    {
      "verse": "7",
      "text": "Because the king trusts You, Your unfailing love keeps him steady and unshaken."
    },
    {
      "verse": "8",
      "text": "Your hand finds every enemy, Your right hand catches anyone standing against You."
    },
    {
      "verse": "9",
      "text": "You burn through opposition like fire, and Your presence wipes out wicked plans."
    },
    {
      "verse": "10",
      "text": "You remove their influence from earth, and their legacy fades — they won’t get to continue their damage."
    },
    {
      "verse": "11",
      "text": "They try to plan evil against You, but their schemes can’t survive Your power."
    },
    {
      "verse": "12",
      "text": "You make them turn back in fear because Your arrows hit what they aim at."
    },
    {
      "verse": "13",
      "text": "Lord, rise up in Your strength; we’ll praise You for the power You keep showing."
    }]},
    {
  "chapter": "22",
  "verses": [
    {
      "verse": "1",
      "text": "God… why do You feel far? I’m crying out but it’s like You’re silent."
    },
    {
      "verse": "2",
      "text": "Day and night I call, but it feels like no answer is landing."
    },
    {
      "verse": "3",
      "text": "But You’re still holy, and Your people praise You nonstop."
    },
    {
      "verse": "4",
      "text": "Our ancestors trusted You, and You came through for them."
    },
    {
      "verse": "5",
      "text": "They cried to You and got saved; they trusted, and You didn’t embarrass them."
    },
    {
      "verse": "6",
      "text": "But right now I feel small — like people see me as nothing."
    },
    {
      "verse": "7",
      "text": "Everyone watching mocks me, shaking their heads like they already know my story."
    },
    {
      "verse": "8",
      "text": "“Let his God save him,” they say — “since he claims God likes him.”"
    },
    {
      "verse": "9",
      "text": "But You’re the One who brought me out safely from birth; You’ve been with me since day one."
    },
    {
      "verse": "10",
      "text": "From my first breath, You’ve been my God — I’ve always been dependent on You."
    },
    {
      "verse": "11",
      "text": "So don’t stay far — trouble is close and there’s no human help."
    },
    {
      "verse": "12",
      "text": "People surround me like strong bulls, trying to pressure me."
    },
    {
      "verse": "13",
      "text": "They open their mouths at me like lions ready to strike."
    },
    {
      "verse": "14",
      "text": "I feel like I’m melting inside; my strength is leaking away."
    },
    {
      "verse": "15",
      "text": "My energy is dried out, and my tongue sticks like I'm dehydrated. You’ve let me hit the ground."
    },
    {
      "verse": "16",
      "text": "Enemies surround me like wild dogs; they pierce my hands and feet."
    },
    {
      "verse": "17",
      "text": "I can see all my bones; people stare at me with zero mercy."
    },
    {
      "verse": "18",
      "text": "They divide my clothes and cast lots for what I’m wearing."
    },
    {
      "verse": "19",
      "text": "But Lord, don’t stay distant — You’re my strength, hurry to help me."
    },
    {
      "verse": "20",
      "text": "Save my life from the sword; save me from the danger right in front of me."
    },
    {
      "verse": "21",
      "text": "Rescue me from the lions’ mouths and the horns of wild animals."
    },
    {
      "verse": "22",
      "text": "I’ll tell my brothers about You; I’ll praise You in the assembly."
    },
    {
      "verse": "23",
      "text": "All who respect God — praise Him. Everyone connected to Jacob — honor Him."
    },
    {
      "verse": "24",
      "text": "God didn’t ignore the suffering one. He didn’t hide. He heard the cry."
    },
    {
      "verse": "25",
      "text": "My praise comes from You, and I’ll keep honoring You publicly."
    },
    {
      "verse": "26",
      "text": "The humble will eat and be filled; those who seek the Lord will live in joy."
    },
    {
      "verse": "27",
      "text": "The whole world will remember God and come back to worship Him."
    },
    {
      "verse": "28",
      "text": "Because the kingdom belongs to the Lord — He’s the One ruling every nation."
    },
    {
      "verse": "29",
      "text": "All people — strong and weak — will bow before Him."
    },
    {
      "verse": "30",
      "text": "Future generations will serve Him; they’ll hear about what He’s done."
    },
    {
      "verse": "31",
      "text": "They’ll pass down the story: “God did this. He finished it.”"
    }]},
    {
  "chapter": "23",
  "verses": [
    {
      "verse": "1",
      "text": "The Lord is my Shepherd — I’m fully covered. I’m not lacking anything."
    },
    {
      "verse": "2",
      "text": "He settles me in calm places and leads me where my soul can breathe again."
    },
    {
      "verse": "3",
      "text": "He restores my whole vibe and guides me into the right path ’cause His name stays pure."
    },
    {
      "verse": "4",
      "text": "Even when I walk straight into dark seasons, I’m not shaking — ’cause You’re right there with me. Your protection keeps me stable."
    },
    {
      "verse": "5",
      "text": "You set a whole table for me right in front of the people betting on my downfall. You refresh me, and Your blessings stay overflowing."
    },
    {
      "verse": "6",
      "text": "Your goodness and mercy are basically stalking me for life — and I’m staying in Your house forever."
    }]},
    {
  "chapter": "24",
  "verses": [
    {
      "verse": "1",
      "text": "The earth and everything in it? Yeah, that’s all God’s — He runs the whole system."
    },
    {
      "verse": "2",
      "text": "He built it from the ground up, set it steady on the waters."
    },
    {
      "verse": "3",
      "text": "Who can step into God’s space? Who can stand where He is?"
    },
    {
      "verse": "4",
      "text": "Only the one with clean hands and a clean heart — no idols, no fake vibes, no deceit."
    },
    {
      "verse": "5",
      "text": "That person gets blessing from the Lord and approval from the God who saves."
    },
    {
      "verse": "6",
      "text": "That’s the squad of people who seek Him — the ones who chase after His presence."
    },
    {
      "verse": "7",
      "text": "Lift up your heads, gates; open wide, ancient doors — the King of Glory is stepping in."
    },
    {
      "verse": "8",
      "text": "And who’s this King of Glory? The Lord — strong and unstoppable in battle."
    },
    {
      "verse": "9",
      "text": "Lift your heads again, gates; open up, ancient doors — the King of Glory is entering."
    },
    {
      "verse": "10",
      "text": "Who is this King of Glory? The Lord of hosts — yeah, that’s Him."
    }]},
    {
  "chapter": "25",
  "verses": [
    {
      "verse": "1",
      "text": "Lord, I lift my whole life to You — You’re the One I’m banking on."
    },
    {
      "verse": "2",
      "text": "I trust You fully; don’t let me get clowned or end up ashamed."
    },
    {
      "verse": "3",
      "text": "Anyone who waits on You won’t be disappointed — only the ones wilding out in rebellion get exposed."
    },
    {
      "verse": "4",
      "text": "Show me Your paths, Lord; teach me how You move."
    },
    {
      "verse": "5",
      "text": "Guide me in Your truth — You’re my God and my Savior; I’m waiting on You all day."
    },
    {
      "verse": "6",
      "text": "Remember Your mercy and love — they’ve been Your style since forever."
    },
    {
      "verse": "7",
      "text": "Don’t pull up my past mistakes or teen-level foolishness — look at me through Your mercy, ’cause You’re good."
    },
    {
      "verse": "8",
      "text": "God is solid and upright — that’s why He teaches sinners the right path."
    },
    {
      "verse": "9",
      "text": "He guides the humble step-by-step and shows them His way."
    },
    {
      "verse": "10",
      "text": "Every path He leads is full of love and truth for the ones keeping His covenant."
    },
    {
      "verse": "11",
      "text": "For Your name’s sake, forgive my mess — yeah, it’s a lot."
    },
    {
      "verse": "12",
      "text": "Whoever reveres the Lord? He gets shown the best route for his life."
    },
    {
      "verse": "13",
      "text": "He’ll live in goodness, and his children will inherit the land."
    },
    {
      "verse": "14",
      "text": "The Lord shares His secrets with those who fear Him — He lets them in on His covenant."
    },
    {
      "verse": "15",
      "text": "My eyes stay locked on Him ’cause He’s the One who pulls me out of traps."
    },
    {
      "verse": "16",
      "text": "Turn to me, Lord — I’m feeling lonely and stressed."
    },
    {
      "verse": "17",
      "text": "My problems are stacking — pull me out before they bury me."
    },
    {
      "verse": "18",
      "text": "Look at my pain and struggles and wipe out all my sins."
    },
    {
      "verse": "19",
      "text": "See how many enemies I’ve got and how they hate me for no reason."
    },
    {
      "verse": "20",
      "text": "Guard me and save me — I’m trusting You, don’t let me be ashamed."
    },
    {
      "verse": "21",
      "text": "Let integrity and uprightness protect me because my hope is in You."
    },
    {
      "verse": "22",
      "text": "Redeem Israel, God — step in for Your people."
    }]},
    {
  "chapter": "26",
  "verses": [
    {
      "verse": "1",
      "text": "Lord, check my case — I’ve walked straight. I’ve been trusting You without switching sides."
    },
    {
      "verse": "2",
      "text": "Run the diagnostics on my heart and mind — test me for real."
    },
    {
      "verse": "3",
      "text": "Your love stays in front of me, and I move according to Your truth."
    },
    {
      "verse": "4",
      "text": "I don’t link up with fakes, and I’m not vibing with shady people."
    },
    {
      "verse": "5",
      "text": "I literally can’t stand gatherings of wickedness — I’m not sitting at their table."
    },
    {
      "verse": "6",
      "text": "I keep my hands clean, and I come to Your altar ready."
    },
    {
      "verse": "7",
      "text": "So I can shout Your praise and talk about all the wild, awesome things You’ve done."
    },
    {
      "verse": "8",
      "text": "Lord, I love Your house — the space where Your presence pulls up."
    },
    {
      "verse": "9",
      "text": "Don’t count me in with the sinners, or lump me in with people who love violence."
    },
    {
      "verse": "10",
      "text": "Their hands stay full of evil schemes, and their right hands are loaded with bribes."
    },
    {
      "verse": "11",
      "text": "But me? I’m walking straight. Save me, show me grace, and keep me steady."
    },
    {
      "verse": "12",
      "text": "My feet are planted on solid ground — and in the whole assembly, I’m praising You loud."
    }]}



  ]}