{
  "book": "Ruth",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Back in the day, when Israel had no king and vibes were chaotic, there was a famine. So a dude from Bethlehem, Judah packed up and dipped to Moab with his fam to survive."
    },
    {
      "verse": "2",
      "text": "The man's name? Elimelek. His wife? Naomi. And their sons were Mahlon and Kilion — all Bethlehem boys, Ephrathite gang. They pulled up to Moab and started living there."
    },
    {
      "verse": "3",
      "text": "But then bro Elimelek died, and Naomi was left with her two sons."
    },
    {
      "verse": "4",
      "text": "The sons took Moabite baddies as wives — one named Orpah, the other Ruth. They stayed about 10 years."
    },
    {
      "verse": "5",
      "text": "Then both Mahlon and Kilion died too. Naomi was left solo — no husband, no sons, just vibes and pain."
    },
    {
      "verse": "6",
      "text": "Later, Naomi heard the Lord came through for His people in Judah with food again. So she packed her bags to bounce back home with her daughters-in-law."
    },
    {
      "verse": "7",
      "text": "The three of them hit the road heading back to Judah."
    },
    {
      "verse": "8",
      "text": "But Naomi told her daughters-in-law, \"Go home, babes. Stay with your moms. May the Lord bless y'all for the kindness you showed my sons and me.\""
    },
    {
      "verse": "9",
      "text": "\"May God give y'all new husbands and peace.\" Then she kissed them goodbye, and they cried hard."
    },
    {
      "verse": "10",
      "text": "They said, \"Nah Naomi, we'll roll with you to your people.\""
    },
    {
      "verse": "11",
      "text": "Naomi said, \"Girls, why follow me? I got no more sons in the pipeline for y'all to marry.\""
    },
    {
      "verse": "12",
      "text": "\"Even if I got married tonight and had twin boys, y'all gon' wait till they grow? Nah, be for real.\""
    },
    {
      "verse": "13",
      "text": "\"The Lord's hand been heavy on me, fam... I'm in my suffering arc.\""
    },
    {
      "verse": "14",
      "text": "They all cried again. Orpah gave one last hug and went back, but Ruth? Ruth locked in."
    },
    {
      "verse": "15",
      "text": "Naomi said, \"Look, your sis-in-law went back to her people and her gods. You should too.\""
    },
    {
      "verse": "16",
      "text": "But Ruth said, \"Don't even try to make me leave. Where you go, I go. Where you stay, I stay. Your people are my people. Your God my God.\""
    },
    {
      "verse": "17",
      "text": "\"Where you die, I'll die. Where you're buried, I'm buried. May God deal with me if I ever ditch you. Only death's got the key to separate us.\""
    },
    {
      "verse": "18",
      "text": "Naomi saw Ruth wasn't playing around — shorty was loyal for real — so she stopped talking."
    },
    {
      "verse": "19",
      "text": "They both arrived in Bethlehem, and the whole town went, \"Yo, is that Naomi?!\""
    },
    {
      "verse": "20",
      "text": "She said, \"Don't call me Naomi (which means pleasant). Call me Mara (means bitter), 'cause the Almighty really humbled me.\""
    },
    {
      "verse": "21",
      "text": "\"I left full, but I'm back empty. The Lord humbled me, so why y'all calling me 'pleasant'?\""
    },
    {
      "verse": "22",
      "text": "So Naomi came back from Moab with Ruth the Moabite. They arrived in Bethlehem just as the barley harvest was starting — new season, new chapter."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Naomi had a relative from her late husband’s side — an elite man named Boaz, from Elimelech’s fam. Certified noble."
    },
    {
      "verse": "2",
      "text": "Ruth said to Naomi, “Let me hit the fields and pick up leftover grain from anyone who vibes kindly.” Naomi said, “Go ahead, queen.”"
    },
    {
      "verse": "3",
      "text": "So Ruth went out and started gleaning. Divine plot twist: the field she landed in belonged to Boaz. God’s setup, no accident."
    },
    {
      "verse": "4",
      "text": "Boaz rolled up from Bethlehem like, “The Lord bless y’all.” The workers replied, “The Lord bless you too, boss.”"
    },
    {
      "verse": "5",
      "text": "Boaz clocked Ruth and asked his foreman, “Yo, who’s that girl?”"
    },
    {
      "verse": "6",
      "text": "The foreman said, “That’s the Moabite girl who came with Naomi from Moab.”"
    },
    {
      "verse": "7",
      "text": "“She asked if she could glean. She’s been grinding all day — barely took a break.”"
    },
    {
      "verse": "8",
      "text": "Boaz went over and said, “Listen up, daughter. Don’t hit other fields. Stay close to my workers here.”"
    },
    {
      "verse": "9",
      "text": "“Keep your eyes on my field and follow the girls. If you’re thirsty, drink from my guys’ water jars.”"
    },
    {
      "verse": "10",
      "text": "Ruth bowed down and said, “Why show me this kind of favor when I’m not even from here?”"
    },
    {
      "verse": "11",
      "text": "Boaz said, “I’ve heard all about what you did for Naomi — leaving your family and homeland for people you didn’t know.”"
    },
    {
      "verse": "12",
      "text": "“May the Lord pay you back big time. You came under His wings — He’ll cover you.”"
    },
    {
      "verse": "13",
      "text": "Ruth said, “You’ve comforted me, sir. You talk kindly to me, though I’m not one of your servants.”"
    },
    {
      "verse": "14",
      "text": "Later, Boaz told her at mealtime, “Come eat some bread, dip it in the sauce.” She sat with his crew, ate, and got full."
    },
    {
      "verse": "15",
      "text": "When she got up to glean again, Boaz told his guys, “Let her gather even among the bundles. Don’t check her.”"
    },
    {
      "verse": "16",
      "text": "“Actually, drop some stalks on purpose for her. Let her pick them up — don’t be petty.”"
    },
    {
      "verse": "17",
      "text": "Ruth gleaned till evening, then threshed her grain — came up with a whole basket of barley."
    },
    {
      "verse": "18",
      "text": "She carried it back to Naomi, showed her the grain, and even gave her leftovers from lunch."
    },
    {
      "verse": "19",
      "text": "Naomi said, “Girl, where’d you work today? Who noticed you? That’s a lot of grain!”"
    },
    {
      "verse": "20",
      "text": "Ruth said, “The man’s name is Boaz.” Naomi’s eyes lit up: “Bless the Lord! That man’s one of our close relatives — a family redeemer.”"
    },
    {
      "verse": "21",
      "text": "Ruth added, “He even told me to stay close to his workers till the whole harvest ends.”"
    },
    {
      "verse": "22",
      "text": "Naomi said, “Good move. You’ll be safe in his field and won’t get harassed elsewhere.”"
    },
    {
      "verse": "23",
      "text": "So Ruth stayed in Boaz’s field, gleaning through the barley and wheat harvest — working by day, staying with Naomi by night."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "One night, Naomi—Ruth’s OG guardian—was like, “Girl, time we lock in your destiny. You deserve peace and a good man who got you.”"
    },
    {
      "verse": "2",
      "text": "“Now listen, Boaz—the boss farmer you been working for—is family. Tonight, he’s out at the threshing floor handling grain like a pro.”"
    },
    {
      "verse": "3",
      "text": "“So here’s the plan: shower, glow up, put on your good fit, smell nice. Then slide to the floor, but don’t make a move till he’s done eating and chilling.”"
    },
    {
      "verse": "4",
      "text": "“When he knocks out, peep where he’s lying. Then go uncover his feet and crash there. He’ll know what to do next.”"
    },
    {
      "verse": "5",
      "text": "Ruth said, “Say less. I’ll do exactly what you said.”"
    },
    {
      "verse": "6",
      "text": "So she pulled up to the threshing floor and ran the whole play just like Naomi said."
    },
    {
      "verse": "7",
      "text": "When Boaz finished eating and drinking and was all happy-vibes, he laid down by his grain pile. Then Ruth snuck up, uncovered his feet, and laid down too."
    },
    {
      "verse": "8",
      "text": "Around midnight, the dude got shook—like “whoa what’s that”—and realized a woman was laying there."
    },
    {
      "verse": "9",
      "text": "He said, “Who you?” She replied, “It’s me, Ruth, your maid. Spread your cloak over me—basically cover me—‘cause you’re my guardian-redeemer.”"
    },
    {
      "verse": "10",
      "text": "Boaz said, “Yo, bless you for that, girl. You could’ve chased young guys, broke or rich, but you chose honor. Respect.”"
    },
    {
      "verse": "11",
      "text": "“Don’t stress. Everyone in town knows you’re a real one—classy and loyal.”"
    },
    {
      "verse": "12",
      "text": "“True talk though, I am a guardian, but there’s another dude closer in line than me.”"
    },
    {
      "verse": "13",
      "text": "“Crash here tonight, and in the morning, if he steps up, fine. If not, I swear before God, I got you. Sleep tight till morning.”"
    },
    {
      "verse": "14",
      "text": "So she stayed by his feet till dawn, but dipped early before anyone could clock who she was."
    },
    {
      "verse": "15",
      "text": "Then Boaz said, “Hold your shawl out.” She did, and he poured six measures of barley into it and lifted it on her shoulders. Then she went home."
    },
    {
      "verse": "16",
      "text": "Naomi saw her pull up and said, “So… how’d it go, girl?” Ruth gave her the full play-by-play."
    },
    {
      "verse": "17",
      "text": "She added, “He gave me all this barley, said he didn’t want me going back to you empty-handed.”"
    },
    {
      "verse": "18",
      "text": "Naomi said, “Alright, just chill, Ruth. That man ain’t sleeping till he locks this deal in. You’ll see how it ends today.”"
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "Boaz went straight to the town gate—the spot where all the big deals go down—and sat there. Then guess who showed up? The dude who was the nearer redeemer. Boaz called out, “Yo, bro, pull up and sit.” So the man sat down."
    },
    {
      "verse": "2",
      "text": "Boaz grabbed ten of the town elders and said, “Squad, sit down here. We need witnesses.” They sat."
    },
    {
      "verse": "3",
      "text": "Then Boaz told the other guy, “So Naomi, who came back from Moab, is selling Elimelech’s land. You next in line to buy it.”"
    },
    {
      "verse": "4",
      "text": "“If you wanna redeem it, do it. If not, let me know, ‘cause I’m next after you.” The man said, “Bet. I’ll redeem it.”"
    },
    {
      "verse": "5",
      "text": "Boaz replied, “Cool, but just know—if you take the land, you also take Ruth, the Moabite widow. You gotta raise up a name for her late husband.”"
    },
    {
      "verse": "6",
      "text": "Dude paused and said, “Ah nah, that’ll mess up my own inheritance. You go ahead and redeem it yourself, bro.”"
    },
    {
      "verse": "7",
      "text": "(Quick history lesson: back then in Israel, when they sealed a deal like this, one dude took off his sandal and gave it to the other. It was the OG handshake.)"
    },
    {
      "verse": "8",
      "text": "So the man said to Boaz, “Here, take my sandal.” Boom. Official transfer."
    },
    {
      "verse": "9",
      "text": "Boaz turned to the elders and everyone there and said, “Y’all are witnesses today that I’ve bought all of Elimelech’s, Chilion’s, and Mahlon’s stuff from Naomi.”"
    },
    {
      "verse": "10",
      "text": "“And I’ve taken Ruth the Moabitess, Mahlon’s widow, as my wife. The man’s name ain’t dying out from his clan. Y’all are witnesses!”"
    },
    {
      "verse": "11",
      "text": "The whole crowd and the elders said, “We see it! May the Lord make this woman like Rachel and Leah—queens who built up Israel. May your house in Bethlehem thrive.”"
    },
    {
      "verse": "12",
      "text": "“May your family line be blessed like Perez, whom Tamar bore to Judah.”"
    },
    {
      "verse": "13",
      "text": "So Boaz married Ruth. They became one, and the Lord gave her conception—she gave birth to a son."
    },
    {
      "verse": "14",
      "text": "The women told Naomi, “Praise the Lord! He didn’t leave you hanging today. This child will carry your family name forward.”"
    },
    {
      "verse": "15",
      "text": "“He’ll give you new life and care for you in old age. Your daughter-in-law loves you like crazy—better than seven sons—and she’s the one who gave him to you.”"
    },
    {
      "verse": "16",
      "text": "Naomi scooped that baby, cuddled him tight, and basically became his nanny."
    },
    {
      "verse": "17",
      "text": "The neighborhood ladies said, “Naomi’s got a son again!” They named him Obed. He grew up and became the father of Jesse, who became the father of David."
    },
    {
      "verse": "18",
      "text": "Now here’s the family line rundown: Perez fathered Hezron,"
    },
    {
      "verse": "19",
      "text": "Hezron fathered Ram, Ram fathered Amminadab,"
    },
    {
      "verse": "20",
      "text": "Amminadab fathered Nahshon, Nahshon fathered Salmon,"
    },
    {
      "verse": "21",
      "text": "Salmon fathered Boaz, Boaz fathered Obed,"
    },
    {
      "verse": "22",
      "text": "Obed fathered Jesse, and Jesse fathered David."
    }]}
  ]}