{
  "book": "Titus",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Paul here — God’s servant, reppin’ Jesus Christ. Sent to build faith in God’s elect and drop truth that actually transforms."
    },
    {
      "verse": "2",
      "text": "This truth rests on eternal life — the promise God made way back. And God don’t cap, so yeah, it’s locked in."
    },
    {
      "verse": "3",
      "text": "Now at the right time, He made His Word go public — and I got tagged to preach it by His command."
    },
    {
      "verse": "4",
      "text": "To Titus, my legit spiritual son — grace, mercy, and peace from God the Father and Christ Jesus our Savior."
    },
    {
      "verse": "5",
      "text": "I left you in Crete so you could fix what’s messy and appoint elders who actually have sense — like I told you."
    },
    {
      "verse": "6",
      "text": "Pick blameless guys, loyal to one wife, kids that don’t act wild or disrespect."
    },
    {
      "verse": "7",
      "text": "A church leader’s gotta be clean — no arrogance, no quick temper, no addiction, no drama, no greed."
    },
    {
      "verse": "8",
      "text": "Instead, they gotta be chill, love people, self-controlled, holy, and locked into good vibes only (the godly kind)."
    },
    {
      "verse": "9",
      "text": "They gotta know the Word so deep that they can teach it and clap back at fake teachings confidently."
    },
    {
      "verse": "10",
      "text": "Cuz a lotta loudmouths out there just talk nonsense — especially those trying to twist stuff for money."
    },
    {
      "verse": "11",
      "text": "You gotta shut that down. They wreck whole families with fake doctrine for clout and coins."
    },
    {
      "verse": "12",
      "text": "Even one of their own said, “Cretans are always liars, lazy, and greedy.” Brutal but kinda true."
    },
    {
      "verse": "13",
      "text": "Paul said, “Yup, facts. So rebuke them hard, so their faith gets real.”"
    },
    {
      "verse": "14",
      "text": "Don’t let ‘em chase human myths or legalistic junk that distracts from the gospel."
    },
    {
      "verse": "15",
      "text": "To pure hearts, everything’s pure. But for the corrupted, even good stuff looks dirty, ‘cause their minds are fried."
    },
    {
      "verse": "16",
      "text": "They say they know God, but their actions expose ‘em — fake believers, useless in every good thing."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "You, Titus, speak straight — sound teaching, no cap."
    },
    {
      "verse": "2",
      "text": "Old men? Calm, wise, dignified, solid in faith, love, and patience."
    },
    {
      "verse": "3",
      "text": "Old women? Chill, no gossip, no shady drama, teach what’s good."
    },
    {
      "verse": "4",
      "text": "Train the young women — love their fam, self-controlled, pure, kind, always ready to do good."
    },
    {
      "verse": "5",
      "text": "So they don’t trash God’s Word with bad behavior — they gotta shine."
    },
    {
      "verse": "6",
      "text": "Young men? Stay self-controlled, lead with integrity, faith, love, endurance. Level up daily."
    },
    {
      "verse": "7",
      "text": "Show yourself as a model of good works — integrity, solid speech, wholesome teaching. That way, haters can’t clap back."
    },
    {
      "verse": "8",
      "text": "Live clean — teaching aligns with your actions. No cap, practice what you preach."
    },
    {
      "verse": "9",
      "text": "Slaves? Respect your masters in everything — please them, not just when they watch. No eye-rolling."
    },
    {
      "verse": "10",
      "text": "Do good, don’t steal, don’t cheat. Make the Word of God shine even when your life’s tough."
    },
    {
      "verse": "11",
      "text": "God’s grace came through to save everyone — teaching us to ditch sin and live righteous lives."
    },
    {
      "verse": "12",
      "text": "We’re not here just chilling — gotta say “no” to wild desires and “yes” to godly living. Time to level up spiritually."
    },
    {
      "verse": "13",
      "text": "Looking forward to Jesus Christ’s return — the big Day of glory, hope fully unlocked."
    },
    {
      "verse": "14",
      "text": "He gave Himself for us, freeing us from all bad vibes, purifying for His own squad, ready to do good forever."
    },
    {
      "verse": "15",
      "text": "Remind them to live this way. Speak with authority — don’t let anyone clown you. Live it, teach it, enforce it."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Remind people to respect leaders, obey the rules, and stay ready to do good. No cap — civics and holiness both matter."
    },
    {
      "verse": "2",
      "text": "No gossip, no fighting, no drama. Be chill with everyone."
    },
    {
      "verse": "3",
      "text": "Back in the day, we were wild — selfish, arrogant, obsessed with pleasure. Life was chaotic."
    },
    {
      "verse": "4",
      "text": "But then God’s kindness and love showed up — full glow-up through Christ our Savior."
    },
    {
      "verse": "5",
      "text": "He didn’t save us because of our messy deeds, but because of His mercy — He gave us new life via the Holy Spirit."
    },
    {
      "verse": "6",
      "text": "Jesus poured Himself out for us, so we could rise with hope and live clean."
    },
    {
      "verse": "7",
      "text": "Now we’re heirs — hope locked in — not because we earned it, but because God’s promise is real."
    },
    {
      "verse": "8",
      "text": "This message is solid, trustworthy, and worth doubling down on. God’s truth = foundation, fam."
    },
    {
      "verse": "9",
      "text": "Avoid pointless fights about myths and genealogies — they just fuel arguments, not faith."
    },
    {
      "verse": "10",
      "text": "Warn divisive people once, maybe twice. Then ghost them. Why waste energy on chaos?"
    },
    {
      "verse": "11",
      "text": "You know these folks are corrupt, sinful, self-condemned. No redemption in arguing with them."
    },
    {
      "verse": "12",
      "text": "I’m sending Artemas or Tychicus to you soon. Be ready — they’ll help you handle the squad."
    },
    {
      "verse": "13",
      "text": "Help Zenas and Apollos on their grind. Make sure their path is smooth — no roadblocks, full support."
    },
    {
      "verse": "14",
      "text": "Our mission: teach people to hustle for good works. That way, no one’s wasting time, everyone’s leveling spiritually."
    },
    {
      "verse": "15",
      "text": "Send greetings to every friend — people who flex in faith. The ones with me send love too."
    },
    {
      "verse": "16",
      "text": "Grace and peace? Locked in. Stay solid, live right, finish strong."
    }]}
  ]}